{"id":"2k6wXud2N91xpf4PwnSfo4j5WSuTNX5k","title":"Tech News - Last 2 days","displayTitle":"Tech News - Last 2 days","url":"","feedLink":"","items":[{"title":"OpenZFS 2.3-rc4 Released With Linux 6.12 LTS Support","url":"https://www.phoronix.com/news/OpenZFS-2.3-rc4","date":1734118107,"author":"Michael Larabel","unread":true,"desc":"","content":"Following the OpenZFS 2.2.7 stable point release earlier this week that brought Linux 6.12 LTS kernel compatibility along with various fixes, OpenZFS 2.3-rc4 is out today as the latest step toward the big OpenZFS 2.3 feature release...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"UnitedHealth’s Optum left an AI chatbot, used by employees to ask questions about claims, exposed to the internet","url":"https://techcrunch.com/2024/12/13/unitedhealthcares-optum-left-an-ai-chatbot-used-by-employees-to-ask-questions-about-claims-exposed-to-the-internet/","date":1734120318,"author":"Zack Whittaker","unread":true,"desc":"","content":"<p>Optum's AI chatbot was found exposed online at a time when the healthcare giant faces scrutiny for its use of AI to allegedly deny patient claims.</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Prosper Acquires 7,000 ASIC Miners From BITMAIN And Secures Strategic Funding To Democratize Bitcoin","url":"https://hackernoon.com/prosper-acquires-7000-asic-miners-from-bitmain-and-secures-strategic-funding-to-democratize-bitcoin?source=rss","date":1734122642,"author":"Chainwire","unread":true,"desc":"","content":"<p>DUBAI, United Arab Emirates, December 13th, 2024/Chainwire/--Prosper, a centralized protocol democratizing access to Bitcoin mining by tokenizing institutional-grade Bitcoin hashrate as omnichain real-world assets (RWA), today announced the acquisition of over 7,000 ASIC miners from BITMAIN along with the successful closing of its strategic funding round.</p>\n<p>\\</p>\n<ul>\n<li>Backed by Metalpha, Waterdrip Capital, BIT Mining, Animoca Brands, and more, Prosper has procured the new ASIC miners from BITMAIN to bring institutional-grade execution quality to its protocol</li>\n<li>Prosper aims to expand its underlying Bitcoin hashrate capacity to accelerate the flywheel of DAO-owned hashrate and Bitcoin treasury operations &amp; democratise access to institutional-grade mining</li>\n</ul>\n<p>\\\nFollowing the announcement of Prosper’s long-term partnership and hosting service agreement with BITMAIN, the world’s leading manufacturer of digital currency mining servers, this landmark purchase marks an instrumental step in Prosper’s mission to provide institutional-grade reliability to its mining ecosystem.</p>\n<p>\\\nBy leveraging BITMAIN’s cutting-edge products, Prosper enhances the value delivered to its $PROS token holders, further distinguishing itself as the premier Web3 Bitcoin mining protocol backed by leading industry players.</p>\n<p>\\</p>\n<blockquote>\n  <p>“Bitcoin brought about a fundamental shift in finance by democratizing an economic system in its entirety with blockchain technology. Prosper follows the footsteps of Bitcoin’s core ethos by democratizing access to Bitcoin hashrate, the underlying layer powering Bitcoin-through blockchain technology. This layer of community governance and ownership afforded by blockchain allows Prosper to scale its flywheel of both Bitcoin hashrate and treasury operations while simultaneously helping to ensure that Bitcoin mining layer is sufficiently decentralized to maintain Bitcoin’s status as the most recognized digital reserve currency. ” said Milton Lam, Prosper Advisory Council Member.</p>\n</blockquote>\n<p>\\</p>\n<h3 id=\"prosperslatestdevelopment\">Prosper’s Latest Development</h3>\n<ul>\n<li>1 EH/s of hashrate procured and ready to fully go live (with 250 PH/s live on Prosper’s dApp already)</li>\n<li>Access to pipeline capacity of 170MW with the mid-term goal of adding another 5 EH/s</li>\n<li>More than 2 BTC rewards given out to $PROS holders since November</li>\n<li>Access to more than 200 BTC to be delegated by launch partners to the DAO to unlock TVL opportunities for $PROS holders</li>\n</ul>\n<h3 id=\"strategicroundclosurestrengtheningthebitcoinecosystem\">Strategic Round Closure: Strengthening the Bitcoin Ecosystem</h3>\n<p>In addition to its BITMAIN partnership, Prosper announced the closure of its strategic funding round, which saw participation from prominent industry players and financial investors, including Metalpha, Waterdrip Capital, BIT Mining, and Satoshi Protocol. Earlier in October, Animoca Brands also disclosed its intention to purchase $PROS tokens from the open market.</p>\n<p>\\\nThese investments demonstrate the strong confidence in Prosper’s vision of bridging institutional-grade Bitcoin mining power on-chain and its innovative approach to Bitcoin liquidity farming. The involvement of these strategic partners brings crucial industry expertise and networks to support Prosper’s operations as it scales.</p>\n<h3 id=\"positioningprosperforgrowth\">Positioning Prosper for Growth</h3>\n<ul>\n<li>Prosper’s tokenomics adopts a unique design to ensure hashrate-per-token will only increase and be accretive to $PROS holders.</li>\n<li>Prosper’s DAO leverages a unique flywheel model with both hashrate and Bitcoin treasury operations - all governed by and for the benefits of $PROS holders.</li>\n<li>Institutional-grade hashrate generates Bitcoin on an ongoing basis, part of which is rewarded to holders for their active participation, and remaining goes to the DAO treasury.</li>\n<li>DAO’s treasury Bitcoin can be directed towards TVL opportunities with ecosystem partners such as Bitcoin L2 to generate benefits for $PROS holders and the DAO.</li>\n<li>Growth in DAO treasury value and $PROS adoption allows the protocol to further expand underlying hashrate and enhance protocol resilience.</li>\n</ul>\n<p>\\\nBy combining institutional-grade Bitcoin mining hashrate, a decentralized protocol design backed by strong fundamentals, and an extensive network of strategic partners, Prosper is well-positioned to solidify its status as the flagship decentralized Bitcoin mining protocol.</p>\n<h3 id=\"aboutprosper\">About Prosper</h3>\n<p><strong><a href=\"https://www.prosper-fi.com/\">Prosper</a></strong> is a decentralized protocol for a community that truly believes in Bitcoin, providing full exposure across Bitcoin hashrate and Bitcoin through tokenizing institutional-grade Bitcoin hashrate as omnichain RWA, and aims to fully unlock the potential of Bitcoin. For more information, users can visit <strong><a href=\"https://www.prosper-fi.com/\">prosper-fi.com</a></strong> or follow on <strong><a href=\"https://x.com/prosperfi_xyz\">X (formerly Twitter)</a></strong>.</p>\n<h3 id=\"contact\">Contact</h3>\n<p>Prosper</p>\n<p>contact@prosper-fi.com</p>\n<p>:::tip\nThis story was distributed as a release by Chainwire under HackerNoon’s Business Blogging Program. Learn more about the program&nbsp;<strong><a href=\"https://business.hackernoon.com/business-blogging?ref=hackernoon.com\">here</a></strong></p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Exxon can’t resist the AI power gold rush","url":"https://techcrunch.com/2024/12/13/exxon-cant-resist-the-ai-power-gold-rush/","date":1734122788,"author":"Tim De Chant","unread":true,"desc":"","content":"<p>The oil and gas company announced that it’s planning to build a massive power plant for data centers. </p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Bybit Advances Regulatory Compliance, Temporarily Adjusts EEA Operations","url":"https://hackernoon.com/bybit-advances-regulatory-compliance-temporarily-adjusts-eea-operations?source=rss","date":1734123153,"author":"Chainwire","unread":true,"desc":"","content":"<p>DUBAI, United Arab Emirates, December 13th, 2024/Chainwire/--Bybit, the world’s second-largest cryptocurrency exchange by trading volume, continues to reinforce its commitment to transparency and regulatory compliance.</p>\n<p>\\\nIn response to evolving regulations, Bybit has made the difficult but necessary decision to temporarily adjust the availability of its products and services within the European Economic Area (EEA).</p>\n<p>\\\nPaving the Way with MiCAR Compliance</p>\n<p>Bybit is actively pursuing a Markets in Crypto-Assets Regulation (MiCAR) license in Austria, a cornerstone of its compliance-first approach.</p>\n<p>\\\nThis effort underscores Bybit’s dedication to aligning with stringent European regulatory standards, enhancing user protection, and delivering a secure trading environment.</p>\n<p>\\</p>\n<blockquote>\n  <p>“Obtaining the MiCAR license will be a strategic milestone for Bybit,” said Ben Zhou, Co-founder and CEO of Bybit. “Our proactive stance ensures that we meet and exceed the expectations of both regulators and our users, as we work toward a future where innovation and compliance coexist seamlessly.”</p>\n</blockquote>\n<p>\\\nTemporary Adjustments to EEA Operations</p>\n<p>To ensure ongoing compliance with applicable regulatory laws, particularly regarding reverse solicitation, Bybit has made the difficult decision to generally cease all communication with the EEA region.</p>\n<p>\\\nThis measure is intended to avoid any potential breach of the strict reverse solicitation principle. Existing customers' access to their crypto assets remains uninterrupted. </p>\n<p>\\\nAlthough this was a challenging decision, it was necessary for Bybit to maintain its compliance-first approach. Bybit is actively working towards obtaining a MiCAR license in Austria to become one of the first players in the EEA.</p>\n<p>\\\nOnce the appropriate licensing is secured, Bybit will start engagement with its EEA clients in accordance with applicable laws.</p>\n<p>Balancing Innovation with Compliance</p>\n<p>\\</p>\n<blockquote>\n  <p>“As cryptocurrency adoption continues to grow globally, it is Bybit's mission to deliver secure and reliable trading experiences underpinned by robust regulatory framework to all crypto communities,\" said Ben Zhou, Co-founder and CEO of Bybit. </p>\n  <p>\\</p>\n</blockquote>\n<p>\\</p>\n<blockquote>\n  <p>\"To ensure we meet the highest standards and pave the way for a safer and more sustainable future for the industry, we've made the proactive decision to temporarily adjust our operations in the EEA. This allows us to focus on obtaining the necessary licenses and ensuring a fully compliant platform focused on serving EEA clients.\"</p>\n</blockquote>\n<p>\\</p>\n<h3 id=\"commitmenttotheeeamarket\">Commitment to the EEA Market</h3>\n<p>Bybit will be deeply committed to serving its EEA clients once it receives a MiCAR license. The company is actively engaging with regulatory authorities to expedite the licensing process and start full operations in the region.</p>\n<p>\\\nBybit appreciates the support of its users as it navigates this pivotal regulatory journey. For questions or assistance, users are encouraged to contact Bybit’s Customer Support team via Live Chat.</p>\n<p>#Bybit / #TheCryptoArk</p>\n<h3 id=\"aboutbybit\">About Bybit</h3>\n<p>Bybit is the world’s second-largest cryptocurrency exchange by trading volume, serving over 50 million users. </p>\n<p>\\\nEstablished in 2018, Bybit provides a professional platform where crypto investors and traders can find an ultra-fast matching engine, 24/7 customer service, and multilingual community support.</p>\n<p>\\\nBybit is a proud partner of Formula One’s reigning Constructors’ and Drivers’ champions: the Oracle Red Bull Racing team. For media inquiries, please contact: media@bybit.com</p>\n<h3 id=\"contact\">Contact</h3>\n<p>Head of PR</p>\n<p>Tony Au</p>\n<p>Bybit</p>\n<p>tony.au@bybit.com</p>\n<p>:::tip\nThis story was distributed as a release by Chainwire under HackerNoon’s Business Blogging Program. Learn more about the program&nbsp;<strong><a href=\"https://business.hackernoon.com/business-blogging?ref=hackernoon.com\">here</a></strong></p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Databricks is on track to raise a record $9.5+ billion round at $60B valuation","url":"https://techcrunch.com/2024/12/13/databricks-is-on-track-to-raise-a-record-9-5-billion-round-at-60b-valuation/","date":1734123581,"author":"Julie Bort","unread":true,"desc":"","content":"<p>Databricks is close to finalizing a $9.5 billion round at a $60 billion valuation, including a secondary sale for employees that could climb even higher before it closes, Reuters reports. Just 17 days ago, Reuters reported that the deal was at $8 billion and a $55 billion valuation. Thrive Capital is leading the deal with [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Intel Lands \"Round Robin Strict\" Driver Optimization For Helping Battlemage/Xe2","url":"https://www.phoronix.com/news/Intel-RR-Strict-Xe2-Optimize","date":1734125165,"author":"Michael Larabel","unread":true,"desc":"","content":"Intel's open-source Linux graphics driver engineers are busy working to further refine the Xe2 graphics performance for Lunar Lake integrated graphics and the newly-launched Battlemage discrete graphics. Landing in Mesa 25.0-devel this Friday afternoon is a new \"Round Robin Strict\" optimization to benefit both their OpenGL and Vulkan drivers on Linux with Xe2 hardware...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"G2 Ventures Partners is raising $750 million for a third fund","url":"https://techcrunch.com/2024/12/13/g2-ventures-partners-is-raising-750-million-for-a-third-fund/","date":1734125978,"author":"Tim De Chant","unread":true,"desc":"","content":"<p>The raise is a bullish vote of confidence in climate and sustainability startups.</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Yearlong supply-chain attack targeting security pros steals 390K credentials","url":"https://arstechnica.com/security/2024/12/yearlong-supply-chain-attack-targeting-security-pros-steals-390k-credentials/","date":1734126378,"author":"Dan Goodin","unread":true,"desc":"","content":"\n              <p>A sophisticated and ongoing supply-chain attack operating for the past year has been stealing sensitive login credentials from both malicious and benevolent security personnel by infecting them with Trojanized versions of open source software from GitHub and NPM, researchers said.</p>\n<p>The campaign, first reported three weeks ago by security firm <a href=\"https://checkmarx.com/blog/dozens-of-machines-infected-year-long-npm-supply-chain-attack-combines-crypto-mining-and-data-theft/\">Checkmarx</a> and again on Friday by <a href=\"https://securitylabs.datadoghq.com/articles/mut-1244-targeting-offensive-actors/\">Datadog Security Labs</a>, uses multiple avenues to infect the devices of researchers in security and other technical fields. One is through packages that have been available on open source repositories for over a year. They install a professionally developed backdoor that takes pains to conceal its presence. The unknown threat actors behind the campaign have also employed spear phishing that targets thousands of researchers who publish papers on the arXiv platform.</p>\n<h2>Unusual longevity</h2>\n<p>The objectives of the threat actors are also multifaceted. One is the collection of SSH private keys, Amazon Web Services access keys, command histories, and other sensitive information from infected devices every 12 hours. When this post went live, dozens of machines remained infected, and an online account on Dropbox contained some 390,000 credentials for WordPress websites taken by the attackers, most likely by stealing them from fellow malicious threat actors. The malware used in the campaign also installs cryptomining software that was present on at least 68 machines as of last month.</p><p><a href=\"https://arstechnica.com/security/2024/12/yearlong-supply-chain-attack-targeting-security-pros-steals-390k-credentials/\">Read full article</a></p>\n<p><a href=\"https://arstechnica.com/security/2024/12/yearlong-supply-chain-attack-targeting-security-pros-steals-390k-credentials/#comments\">Comments</a></p>\n\n            ","flags":null,"enclosureUrl":"https://cdn.arstechnica.net/wp-content/uploads/2024/04/malware.jpg","enclosureMime":""},{"title":"Kalshi CEO admits enlisting influencers to dis Polymarket in a now-deleted podcast segment","url":"https://techcrunch.com/2024/12/13/kalshi-ceo-admits-enlisting-influencers-to-dis-polymarket-in-a-now-deleted-podcast-segment/","date":1734130294,"author":"Marina Temkin","unread":true,"desc":"","content":"<p>Kalshi CEO Tarek Mansour confirmed on a podcast interview that his employees asked social media influencers to promote memes about the FBI’s raid on the home of his archrival, the CEO of Polymarket.  Both companies offer competing events-betting markets, a new kind of betting industry where people wager about the outcomes of events ranging from [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"AI helps Telegram remove 15 million suspect groups and channels in 2024","url":"https://techcrunch.com/2024/12/13/ai-helps-telegram-remove-15-million-suspect-groups-and-channels-in-2024/","date":1734133866,"author":"Charles Rollet","unread":true,"desc":"","content":"<p>Telegram launched a new page touting its moderation efforts, which have spiked since its founder's arrest.</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"OpenAI whistleblower found dead at 26 in San Francisco apartment","url":"https://techcrunch.com/2024/12/13/openai-whistleblower-found-dead-in-san-francisco-apartment/","date":1734135337,"author":"Maxwell Zeff","unread":true,"desc":"","content":"<p>A former OpenAI employee, Suchir Balaji, was recently found dead in his San Francisco apartment, according to the San Francisco Office of the Chief Medical Examiner. In October, the 26-year-old AI researcher raised concerns about OpenAI breaking copyright law when he was interviewed by The New York Times. &#8220;The Office of the Chief Medical Examiner [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"OpenAI co-founder Ilya Sutskever believes superintelligent AI will be ‘unpredictable’","url":"https://techcrunch.com/2024/12/13/openai-co-founder-ilya-sutskever-believes-superintelligent-ai-will-be-unpredictable/","date":1734138598,"author":"Kyle Wiggers","unread":true,"desc":"","content":"<p>OpenAI co-founder Ilya Sutskever spoke on a range of topics at NeurIPS, the annual AI conference, Friday afternoon before accepting an award for his contributions to the field. Sutskever gave his predictions for &#8220;superintelligent AI&#8221; — AI more capable than humans at many tasks, which he believes will be achieved at some point. Superintelligent AI [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Wine 10.0-rc2 Released With 21 Fixes For The Week","url":"https://www.phoronix.com/news/Wine-10.0-rc2-Released","date":1734139883,"author":"Michael Larabel","unread":true,"desc":"","content":"Building off last week's release of Wine 10.0-rc1 is now Wine 10.0-rc2 as the next test release in working toward the Wine 10.0 stable debut around mid January...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"X gains a faster Grok model and a new ‘Grok button’","url":"https://techcrunch.com/2024/12/13/x-gains-a-faster-grok-model-and-a-new-grok-button/","date":1734145932,"author":"Kyle Wiggers","unread":true,"desc":"","content":"<p>xAI, Elon Musk&#8217;s AI company, may be embroiled in an escalating lawsuit with OpenAI. But that&#8217;s not stopping it from shipping new products — on a Friday night, no less. This evening, xAI revealed that it has begun to roll out an upgraded version of its flagship Grok 2 chatbot model to all users on [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"PagedAttention: An Attention Algorithm Inspired By the Classical Virtual Memory in Operating Systems","url":"https://hackernoon.com/pagedattention-an-attention-algorithm-inspired-by-the-classical-virtual-memory-in-operating-systems?source=rss","date":1734146215,"author":"Writings, Papers and Blogs on Text Models","unread":true,"desc":"","content":"<h2 id=\"tableoflinks\">Table of Links</h2>\n<p><a href=\"http://hackernoon.com/preview/UZfnXsE8xpuPm7xJGzSd\">Abstract and 1 Introduction</a></p>\n<p><a href=\"https://hackernoon.com/preview/Joq6DOP9CkD0S4F8MX1r\">2 Background and 2.1 Transformer-Based Large Language Models</a></p>\n<p><a href=\"http://hackernoon.com/preview/25g0m9nrxol991ZY9qci\">2.2 LLM Service & Autoregressive Generation</a></p>\n<p><a href=\"http://hackernoon.com/preview/IQ9Fd8hlh5MpHVMFA27O\">2.3 Batching Techniques for LLMs</a></p>\n<p><a href=\"https://hackernoon.com/preview/ytSMq2pxVtKIRC7iS3kK\">3 Memory Challenges in LLM Serving</a></p>\n<p><a href=\"http://hackernoon.com/preview/6BZmg60VAii9DNx0L1qc\">3.1 Memory Management in Existing Systems</a></p>\n<p><a href=\"http://hackernoon.com/preview/ZzGN1QRkg16N6zN7hCJi\">4 Method and 4.1 PagedAttention</a></p>\n<p><a href=\"http://hackernoon.com/preview/4Da8juHWnURn6g4urrl4\">4.2 KV Cache Manager</a></p>\n<p><a href=\"http://hackernoon.com/preview/GieTLdxmIGxSHDideqV5\">4.3 Decoding with PagedAttention and vLLM</a></p>\n<p><a href=\"http://hackernoon.com/preview/7g3isP8BzgyEsTasNUr2\">4.4 Application to Other Decoding Scenarios</a></p>\n<p><a href=\"http://hackernoon.com/preview/TEjiBAga2TDQ1ZZp5Vbg\">4.5 Scheduling and Preemption</a></p>\n<p><a href=\"http://hackernoon.com/preview/OjYLeVPi5jM2NSWKvipy\">4.6 Distributed Execution</a></p>\n<p><a href=\"http://hackernoon.com/preview/yqADDmfsCggYCcSdA6Nj\">5 Implementation</a></p>\n<p><a href=\"http://hackernoon.com/preview/S6sF02nTOzlXKZE1iQcP\">6 Evaluation and 6.1 Experimental Setup</a></p>\n<p><a href=\"http://hackernoon.com/preview/K3TeA7MNOi0g142ICu5W\">6.2 Basic Sampling</a></p>\n<p><a href=\"http://hackernoon.com/preview/cJxKQHExtKQrburnndpo\">6.3 Parallel Sampling and Beam Search</a></p>\n<p><a href=\"http://hackernoon.com/preview/JEOm7WvIfRfxEjepPqXW\">6.4 Shared prefix</a></p>\n<p><a href=\"http://hackernoon.com/preview/DWk5D3KHLfKhdQC02ayZ\">6.5 Chatbot</a></p>\n<p><a href=\"http://hackernoon.com/preview/l7VvLlkEDSBJ5GzMlwJf\">7 Ablation Studies</a></p>\n<p><a href=\"http://hackernoon.com/preview/PJb0S41IDQAbwYp0e6RZ\">8 Discussion</a></p>\n<p><a href=\"http://hackernoon.com/preview/5d2sL9hRMUBNmVCZWMBC\">9 Related Work</a></p>\n<p><a href=\"http://hackernoon.com/preview/HL77hmYOoM9MPB5fKgmq\">10 Conclusion, Acknowledgement and References</a></p>\n<h2 id=\"abstract\">Abstract</h2>\n<p>High throughput serving of large language models (LLMs) requires batching sufficiently many requests at a time. However, existing systems struggle because the key-value cache (KV cache) memory for each request is huge and grows and shrinks dynamically. When managed inefficiently, this memory can be significantly wasted by fragmentation and redundant duplication, limiting the batch size. To address this problem, we propose PagedAttention, an attention algorithm inspired by the classical virtual memory and paging techniques in operating systems. On top of it, we build vLLM, an LLM serving system that achieves (1) near-zero waste in KV cache memory and (2) flexible sharing of KV cache within and across requests to further reduce memory usage. Our evaluations show that vLLM improves the throughput of popular LLMs by 2-4× with the same level of latency compared to the state-of-the-art systems, such as FasterTransformer and Orca. The improvement is more pronounced with longer sequences, larger models, and more complex decoding algorithms. vLLM’s source code is publicly available at https://github.com/vllm-project/vllm.</p>\n<h2 id=\"1introduction\">1 Introduction</h2>\n<p>The emergence of large language models (LLMs) like GPT [5, 37] and PaLM [9] have enabled new applications such as programming assistants [6, 18] and universal chatbots [19, 35] that are starting to profoundly impact our work and daily routines. Many cloud companies [34, 44] are racing to provide these applications as hosted services. However, running these applications is very expensive, requiring a large number of hardware accelerators such as GPUs. According to recent estimates, processing an LLM request can be 10× more expensive than a traditional keyword query [43]. Given these high costs, increasing the throughput—and hence reducing</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-no830r2.png\" alt=\"Figure 1. Left: Memory layout when serving an LLM with 13B parameters on NVIDIA A100. The parameters (gray) persist in GPU memory throughout serving. The memory for the KV cache (red) is (de)allocated per serving request. A small amount of memory (yellow) is used ephemerally for activation. Right: vLLM smooths out the rapid growth curve of KV cache memory seen in existing systems [31, 60], leading to a notable boost in serving throughput.\" /></p>\n<p>\\\nthe cost per request—of LLM serving systems is becoming more important.</p>\n<p>\\\nAt the core of LLMs lies an autoregressive Transformer model [53]. This model generates words (tokens), one at a time, based on the input (prompt) and the previous sequence of the output’s tokens it has generated so far. For each request, this expensive process is repeated until the model outputs a termination token. This sequential generation process makes the workload memory-bound, underutilizing the computation power of GPUs and limiting the serving throughput.</p>\n<p>\\\nImproving the throughput is possible by batching multiple requests together. However, to process many requests in a batch, the memory space for each request should be efficiently managed. For example, Fig. 1 (left) illustrates the memory distribution for a 13B-parameter LLM on an NVIDIA A100 GPU with 40GB RAM. Approximately 65% of the memory is allocated for the model weights, which remain static during serving. Close to 30% of the memory is used to store the dynamic states of the requests. For Transformers, these states consist of the key and value tensors associated with the attention mechanism, commonly referred to as KV cache [41], which represent the context from earlier tokens to generate new output tokens in sequence. The remaining small</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-ki93080.png\" alt=\"Figure 2. Average percentage of memory wastes in different LLM serving systems during the experiment in §6.2.\" /></p>\n<p>\\\npercentage of memory is used for other data, including activations – the ephemeral tensors created when evaluating the LLM. Since the model weights are constant and the activations only occupy a small fraction of the GPU memory, the way the KV cache is managed is critical in determining the maximum batch size. When managed inefficiently, the KV cache memory can significantly limit the batch size and consequently the throughput of the LLM, as illustrated in Fig. 1 (right).</p>\n<p>\\\nIn this paper, we observe that existing LLM serving systems [31, 60] fall short of managing the KV cache memory efficiently. This is mainly because they store the KV cache of a request in contiguous memory space, as most deep learning frameworks [33, 39] require tensors to be stored in contiguous memory. However, unlike the tensors in the traditional deep learning workloads, the KV cache has unique characteristics: it dynamically grows and shrinks over time as the model generates new tokens, and its lifetime and length are not known a priori. These characteristics make the existing systems’ approach significantly inefficient in two ways:</p>\n<p>\\\nFirst, the existing systems [31, 60] suffer from internal and external memory fragmentation. To store the KV cache of a request in contiguous space, they pre-allocate a contiguous chunk of memory with the request’s maximum length (e.g., 2048 tokens). This can result in severe internal fragmentation, since the request’s actual length can be much shorter than its maximum length (e.g., Fig. 11). Moreover, even if the actual length is known a priori, the pre-allocation is still inefficient: As the entire chunk is reserved during the request’s lifetime, other shorter requests cannot utilize any part of the chunk that is currently unused. Besides, external memory fragmentation can also be significant, since the preallocated size can be different for each request. Indeed, our profiling results in Fig. 2 show that only 20.4% - 38.2% of the KV cache memory is used to store the actual token states in the existing systems.</p>\n<p>\\\nSecond, the existing systems cannot exploit the opportunities for memory sharing. LLM services often use advanced decoding algorithms, such as parallel sampling and beam search, that generate multiple outputs per request. In these scenarios, the request consists of multiple sequences that can partially share their KV cache. However, memory sharing is not possible in the existing systems because the KV cache of the sequences is stored in separate contiguous spaces.</p>\n<p>\\\nTo address the above limitations, we propose PagedAttention, an attention algorithm inspired by the operating system’s (OS) solution to memory fragmentation and sharing: virtual memory with paging. PagedAttention divides the request’s KV cache into blocks, each of which can contain the attention keys and values of a fixed number of tokens. In PagedAttention, the blocks for the KV cache are not necessarily stored in contiguous space. Therefore, we can manage the KV cache in a more flexible way as in OS’s virtual memory: one can think of blocks as pages, tokens as bytes, and requests as processes. This design alleviates internal fragmentation by using relatively small blocks and allocating them on demand. Moreover, it eliminates external fragmentation as all blocks have the same size. Finally, it enables memory sharing at the granularity of a block, across the different sequences associated with the same request or even across the different requests.</p>\n<p>\\\nIn this work, we build vLLM, a high-throughput distributed LLM serving engine on top of PagedAttention that achieves near-zero waste in KV cache memory. vLLM uses block-level memory management and preemptive request scheduling that are co-designed with PagedAttention. vLLM supports popular LLMs such as GPT [5], OPT [62], and LLaMA [52] with varying sizes, including the ones exceeding the memory capacity of a single GPU. Our evaluations on various models and workloads show that vLLM improves the LLM serving throughput by 2-4× compared to the state-of-the-art systems [31, 60], without affecting the model accuracy at all. The improvements are more pronounced with longer sequences, larger models, and more complex decoding algorithms (§4.3). In summary, we make the following contributions:</p>\n<p>\\\n• We identify the challenges in memory allocation in serving LLMs and quantify their impact on serving performance.</p>\n<p>\\\n• We propose PagedAttention, an attention algorithm that operates on KV cache stored in non-contiguous paged memory, which is inspired by the virtual memory and paging in OS.</p>\n<p>\\\n• We design and implement vLLM, a distributed LLM serving engine built on top of PagedAttention.</p>\n<p>\\\n• We evaluate vLLM on various scenarios and demonstrate that it substantially outperforms the previous state-of-theart solutions such as FasterTransformer [31] and Orca [60].</p>\n<p>\\</p>\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2309.06180\">available on arxiv</a> under CC BY 4.0 DEED license.</p>\n<p>:::</p>\n<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Woosuk Kwon, UC Berkeley with Equal contribution;</p>\n<p>(2) Zhuohan Li, UC Berkeley with Equal contribution;</p>\n<p>(3) Siyuan Zhuang, UC Berkeley;</p>\n<p>(4) Ying Sheng, UC Berkeley and Stanford University;</p>\n<p>(5) Lianmin Zheng, UC Berkeley;</p>\n<p>(6) Cody Hao Yu, Independent Researcher;</p>\n<p>(7) Cody Hao Yu, Independent Researcher;</p>\n<p>(8) Joseph E. Gonzalez, UC Berkeley;</p>\n<p>(9) Hao Zhang, UC San Diego;</p>\n<p>(10) Ion Stoica, UC Berkeley.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The Generation and Serving Procedures of Typical LLMs: A Quick Explanation","url":"https://hackernoon.com/the-generation-and-serving-procedures-of-typical-llms-a-quick-explanation?source=rss","date":1734147085,"author":"Writings, Papers and Blogs on Text Models","unread":true,"desc":"","content":"<h2 id=\"tableoflinks\">Table of Links</h2>\n<p><a href=\"http://hackernoon.com/preview/UZfnXsE8xpuPm7xJGzSd\">Abstract and 1 Introduction</a></p>\n<p><a href=\"https://hackernoon.com/preview/Joq6DOP9CkD0S4F8MX1r\">2 Background and 2.1 Transformer-Based Large Language Models</a></p>\n<p><a href=\"http://hackernoon.com/preview/25g0m9nrxol991ZY9qci\">2.2 LLM Service & Autoregressive Generation</a></p>\n<p><a href=\"http://hackernoon.com/preview/IQ9Fd8hlh5MpHVMFA27O\">2.3 Batching Techniques for LLMs</a></p>\n<p><a href=\"https://hackernoon.com/preview/ytSMq2pxVtKIRC7iS3kK\">3 Memory Challenges in LLM Serving</a></p>\n<p><a href=\"http://hackernoon.com/preview/6BZmg60VAii9DNx0L1qc\">3.1 Memory Management in Existing Systems</a></p>\n<p><a href=\"http://hackernoon.com/preview/ZzGN1QRkg16N6zN7hCJi\">4 Method and 4.1 PagedAttention</a></p>\n<p><a href=\"http://hackernoon.com/preview/4Da8juHWnURn6g4urrl4\">4.2 KV Cache Manager</a></p>\n<p><a href=\"http://hackernoon.com/preview/GieTLdxmIGxSHDideqV5\">4.3 Decoding with PagedAttention and vLLM</a></p>\n<p><a href=\"http://hackernoon.com/preview/7g3isP8BzgyEsTasNUr2\">4.4 Application to Other Decoding Scenarios</a></p>\n<p><a href=\"http://hackernoon.com/preview/TEjiBAga2TDQ1ZZp5Vbg\">4.5 Scheduling and Preemption</a></p>\n<p><a href=\"http://hackernoon.com/preview/OjYLeVPi5jM2NSWKvipy\">4.6 Distributed Execution</a></p>\n<p><a href=\"http://hackernoon.com/preview/yqADDmfsCggYCcSdA6Nj\">5 Implementation</a></p>\n<p><a href=\"http://hackernoon.com/preview/S6sF02nTOzlXKZE1iQcP\">6 Evaluation and 6.1 Experimental Setup</a></p>\n<p><a href=\"http://hackernoon.com/preview/K3TeA7MNOi0g142ICu5W\">6.2 Basic Sampling</a></p>\n<p><a href=\"http://hackernoon.com/preview/cJxKQHExtKQrburnndpo\">6.3 Parallel Sampling and Beam Search</a></p>\n<p><a href=\"http://hackernoon.com/preview/JEOm7WvIfRfxEjepPqXW\">6.4 Shared prefix</a></p>\n<p><a href=\"http://hackernoon.com/preview/DWk5D3KHLfKhdQC02ayZ\">6.5 Chatbot</a></p>\n<p><a href=\"http://hackernoon.com/preview/l7VvLlkEDSBJ5GzMlwJf\">7 Ablation Studies</a></p>\n<p><a href=\"http://hackernoon.com/preview/PJb0S41IDQAbwYp0e6RZ\">8 Discussion</a></p>\n<p><a href=\"http://hackernoon.com/preview/5d2sL9hRMUBNmVCZWMBC\">9 Related Work</a></p>\n<p><a href=\"http://hackernoon.com/preview/HL77hmYOoM9MPB5fKgmq\">10 Conclusion, Acknowledgement and References</a></p>\n<h2 id=\"2background\">2 Background</h2>\n<p>In this section, we describe the generation and serving procedures of typical LLMs and the iteration-level scheduling used in LLM serving.</p>\n<h3 id=\"21transformerbasedlargelanguagemodels\">2.1 Transformer-Based Large Language Models</h3>\n<p>The task of language modeling is to model the probability of a list of tokens (𝑥1, . . . , 𝑥𝑛). Since language has a natural sequential ordering, it is common to factorize the joint probability over the whole sequence as the product of conditional probabilities (a.k.a. autoregressive decomposition [3]):</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-74830w3.png\" alt=\"\" /></p>\n<p>\\</p>\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2309.06180\">available on arxiv</a> under CC BY 4.0 DEED license.</p>\n<p>:::</p>\n<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Woosuk Kwon, UC Berkeley with Equal contribution;</p>\n<p>(2) Zhuohan Li, UC Berkeley with Equal contribution;</p>\n<p>(3) Siyuan Zhuang, UC Berkeley;</p>\n<p>(4) Ying Sheng, UC Berkeley and Stanford University;</p>\n<p>(5) Lianmin Zheng, UC Berkeley;</p>\n<p>(6) Cody Hao Yu, Independent Researcher;</p>\n<p>(7) Cody Hao Yu, Independent Researcher;</p>\n<p>(8) Joseph E. Gonzalez, UC Berkeley;</p>\n<p>(9) Hao Zhang, UC San Diego;</p>\n<p>(10) Ion Stoica, UC Berkeley.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"LLM Service & Autoregressive Generation: What This Means","url":"https://hackernoon.com/llm-service-and-autoregressive-generation-what-this-means?source=rss","date":1734147368,"author":"Writings, Papers and Blogs on Text Models","unread":true,"desc":"","content":"<h2 id=\"tableoflinks\">Table of Links</h2>\n<p><a href=\"http://hackernoon.com/preview/UZfnXsE8xpuPm7xJGzSd\">Abstract and 1 Introduction</a></p>\n<p><a href=\"https://hackernoon.com/preview/Joq6DOP9CkD0S4F8MX1r\">2 Background and 2.1 Transformer-Based Large Language Models</a></p>\n<p><a href=\"http://hackernoon.com/preview/25g0m9nrxol991ZY9qci\">2.2 LLM Service & Autoregressive Generation</a></p>\n<p><a href=\"http://hackernoon.com/preview/IQ9Fd8hlh5MpHVMFA27O\">2.3 Batching Techniques for LLMs</a></p>\n<p><a href=\"https://hackernoon.com/preview/ytSMq2pxVtKIRC7iS3kK\">3 Memory Challenges in LLM Serving</a></p>\n<p><a href=\"http://hackernoon.com/preview/6BZmg60VAii9DNx0L1qc\">3.1 Memory Management in Existing Systems</a></p>\n<p><a href=\"http://hackernoon.com/preview/ZzGN1QRkg16N6zN7hCJi\">4 Method and 4.1 PagedAttention</a></p>\n<p><a href=\"http://hackernoon.com/preview/4Da8juHWnURn6g4urrl4\">4.2 KV Cache Manager</a></p>\n<p><a href=\"http://hackernoon.com/preview/GieTLdxmIGxSHDideqV5\">4.3 Decoding with PagedAttention and vLLM</a></p>\n<p><a href=\"http://hackernoon.com/preview/7g3isP8BzgyEsTasNUr2\">4.4 Application to Other Decoding Scenarios</a></p>\n<p><a href=\"http://hackernoon.com/preview/TEjiBAga2TDQ1ZZp5Vbg\">4.5 Scheduling and Preemption</a></p>\n<p><a href=\"http://hackernoon.com/preview/OjYLeVPi5jM2NSWKvipy\">4.6 Distributed Execution</a></p>\n<p><a href=\"http://hackernoon.com/preview/yqADDmfsCggYCcSdA6Nj\">5 Implementation</a></p>\n<p><a href=\"http://hackernoon.com/preview/S6sF02nTOzlXKZE1iQcP\">6 Evaluation and 6.1 Experimental Setup</a></p>\n<p><a href=\"http://hackernoon.com/preview/K3TeA7MNOi0g142ICu5W\">6.2 Basic Sampling</a></p>\n<p><a href=\"http://hackernoon.com/preview/cJxKQHExtKQrburnndpo\">6.3 Parallel Sampling and Beam Search</a></p>\n<p><a href=\"http://hackernoon.com/preview/JEOm7WvIfRfxEjepPqXW\">6.4 Shared prefix</a></p>\n<p><a href=\"http://hackernoon.com/preview/DWk5D3KHLfKhdQC02ayZ\">6.5 Chatbot</a></p>\n<p><a href=\"http://hackernoon.com/preview/l7VvLlkEDSBJ5GzMlwJf\">7 Ablation Studies</a></p>\n<p><a href=\"http://hackernoon.com/preview/PJb0S41IDQAbwYp0e6RZ\">8 Discussion</a></p>\n<p><a href=\"http://hackernoon.com/preview/5d2sL9hRMUBNmVCZWMBC\">9 Related Work</a></p>\n<p><a href=\"http://hackernoon.com/preview/HL77hmYOoM9MPB5fKgmq\">10 Conclusion, Acknowledgement and References</a></p>\n<h2 id=\"22llmserviceautoregressivegeneration\">2.2 LLM Service &amp; Autoregressive Generation</h2>\n<p>Once trained, LLMs are often deployed as a conditional generation service (e.g., completion API [34] or chatbot [19, 35]). A request to an LLM service provides a list of input prompt tokens (𝑥1, . . . , 𝑥𝑛), and the LLM service generates a list of output tokens (𝑥𝑛+1, . . . , 𝑥𝑛+𝑇 ) according to Eq. 1. We refer to the concatenation of the prompt and output lists as sequence.</p>\n<p>\\\nDue to the decomposition in Eq. 1, the LLM can only sample and generate new tokens one by one, and the generation process of each new token depends on all the previous tokens in that sequence, specifically their key and value vectors. In this sequential generation process, the key and value vectors of existing tokens are often cached for generating future tokens, known as KV cache. Note that the KV cache of one token depends on all its previous tokens. This means that the KV cache of the same token appearing at different positions in a sequence will be different.</p>\n<p>\\\nGiven a request prompt, the generation computation in the LLM service can be decomposed into two phases:</p>\n<p>\\\nThe prompt phase takes the whole user prompt (𝑥1, . . . , 𝑥𝑛) as input and computes the probability of the first new token 𝑃 (𝑥𝑛+1 | 𝑥1, . . . , 𝑥𝑛). During this process, also generates the key vectors 𝑘1, . . . , 𝑘𝑛 and value vectors 𝑣1, . . . , 𝑣𝑛. Since prompt tokens 𝑥1, . . . , 𝑥𝑛 are all known, the computation of the prompt phase can be parallelized using matrixmatrix multiplication operations. Therefore, this phase can efficiently use the parallelism inherent in GPUs.</p>\n<p>\\\nThe autoregressive generation phase generates the remaining new tokens sequentially. At iteration 𝑡, the model takes one token 𝑥𝑛+𝑡 as input and computes the probability 𝑃 (𝑥𝑛+𝑡+1 | 𝑥1, . . . , 𝑥𝑛+𝑡) with the key vectors 𝑘1, . . . , 𝑘𝑛+𝑡 and value vectors𝑣1, . . . , 𝑣𝑛+𝑡 . Note that the key and value vectors at positions 1 to 𝑛 + 𝑡 − 1 are cached at previous iterations, only the new key and value vector 𝑘𝑛+𝑡 and 𝑣𝑛+𝑡 are computed at this iteration. This phase completes either when the sequence reaches a maximum length (specified by users or limited by LLMs) or when an end-of-sequence (<<em>eos</em>>) token is emitted. The computation at different iterations cannot be parallelized due to the data dependency and often uses matrix-vector multiplication, which is less efficient. As a result, this phase severely underutilizes GPU computation and becomes memory-bound, being responsible for most portion of the latency of a single request.</p>\n<p>\\</p>\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2309.06180\">available on arxiv</a> under CC BY 4.0 DEED license.</p>\n<p>:::</p>\n<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Woosuk Kwon, UC Berkeley with Equal contribution;</p>\n<p>(2) Zhuohan Li, UC Berkeley with Equal contribution;</p>\n<p>(3) Siyuan Zhuang, UC Berkeley;</p>\n<p>(4) Ying Sheng, UC Berkeley and Stanford University;</p>\n<p>(5) Lianmin Zheng, UC Berkeley;</p>\n<p>(6) Cody Hao Yu, Independent Researcher;</p>\n<p>(7) Cody Hao Yu, Independent Researcher;</p>\n<p>(8) Joseph E. Gonzalez, UC Berkeley;</p>\n<p>(9) Hao Zhang, UC San Diego;</p>\n<p>(10) Ion Stoica, UC Berkeley.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Batching Techniques for LLMs","url":"https://hackernoon.com/batching-techniques-for-llms?source=rss","date":1734147585,"author":"Writings, Papers and Blogs on Text Models","unread":true,"desc":"","content":"<h2 id=\"tableoflinks\">Table of Links</h2>\n<p><a href=\"http://hackernoon.com/preview/UZfnXsE8xpuPm7xJGzSd\">Abstract and 1 Introduction</a></p>\n<p><a href=\"https://hackernoon.com/preview/Joq6DOP9CkD0S4F8MX1r\">2 Background and 2.1 Transformer-Based Large Language Models</a></p>\n<p><a href=\"http://hackernoon.com/preview/25g0m9nrxol991ZY9qci\">2.2 LLM Service & Autoregressive Generation</a></p>\n<p><a href=\"http://hackernoon.com/preview/IQ9Fd8hlh5MpHVMFA27O\">2.3 Batching Techniques for LLMs</a></p>\n<p><a href=\"https://hackernoon.com/preview/ytSMq2pxVtKIRC7iS3kK\">3 Memory Challenges in LLM Serving</a></p>\n<p><a href=\"http://hackernoon.com/preview/6BZmg60VAii9DNx0L1qc\">3.1 Memory Management in Existing Systems</a></p>\n<p><a href=\"http://hackernoon.com/preview/ZzGN1QRkg16N6zN7hCJi\">4 Method and 4.1 PagedAttention</a></p>\n<p><a href=\"http://hackernoon.com/preview/4Da8juHWnURn6g4urrl4\">4.2 KV Cache Manager</a></p>\n<p><a href=\"http://hackernoon.com/preview/GieTLdxmIGxSHDideqV5\">4.3 Decoding with PagedAttention and vLLM</a></p>\n<p><a href=\"http://hackernoon.com/preview/7g3isP8BzgyEsTasNUr2\">4.4 Application to Other Decoding Scenarios</a></p>\n<p><a href=\"http://hackernoon.com/preview/TEjiBAga2TDQ1ZZp5Vbg\">4.5 Scheduling and Preemption</a></p>\n<p><a href=\"http://hackernoon.com/preview/OjYLeVPi5jM2NSWKvipy\">4.6 Distributed Execution</a></p>\n<p><a href=\"http://hackernoon.com/preview/yqADDmfsCggYCcSdA6Nj\">5 Implementation</a></p>\n<p><a href=\"http://hackernoon.com/preview/S6sF02nTOzlXKZE1iQcP\">6 Evaluation and 6.1 Experimental Setup</a></p>\n<p><a href=\"http://hackernoon.com/preview/K3TeA7MNOi0g142ICu5W\">6.2 Basic Sampling</a></p>\n<p><a href=\"http://hackernoon.com/preview/cJxKQHExtKQrburnndpo\">6.3 Parallel Sampling and Beam Search</a></p>\n<p><a href=\"http://hackernoon.com/preview/JEOm7WvIfRfxEjepPqXW\">6.4 Shared prefix</a></p>\n<p><a href=\"http://hackernoon.com/preview/DWk5D3KHLfKhdQC02ayZ\">6.5 Chatbot</a></p>\n<p><a href=\"http://hackernoon.com/preview/l7VvLlkEDSBJ5GzMlwJf\">7 Ablation Studies</a></p>\n<p><a href=\"http://hackernoon.com/preview/PJb0S41IDQAbwYp0e6RZ\">8 Discussion</a></p>\n<p><a href=\"http://hackernoon.com/preview/5d2sL9hRMUBNmVCZWMBC\">9 Related Work</a></p>\n<p><a href=\"http://hackernoon.com/preview/HL77hmYOoM9MPB5fKgmq\">10 Conclusion, Acknowledgement and References</a></p>\n<h2 id=\"23batchingtechniquesforllms\">2.3 Batching Techniques for LLMs</h2>\n<p>The compute utilization in serving LLMs can be improved by batching multiple requests. Because the requests share the same model weights, the overhead of moving weights is amortized across the requests in a batch, and can be overwhelmed by the computational overhead when the batch size is sufficiently large. However, batching the requests to an LLM service is non-trivial for two reasons. </p>\n<p>\\\nFirst, the requests may arrive at different times. A naive batching strategy would either make earlier requests wait for later ones or delay the incoming requests until earlier ones finish, leading to significant queueing delays. Second, the requests may have vastly different input and output lengths (Fig. 11). A straightforward batching technique would pad the inputs and outputs of the requests to equalize their lengths, wasting GPU computation and memory.</p>\n<p>\\\nTo address this problem, fine-grained batching mechanisms, such as cellular batching [16] and iteration-level scheduling [60], have been proposed. Unlike traditional methods that work at the request level, these techniques operate at the iteration level. After each iteration, completed requests are removed from the batch, and new ones are added. </p>\n<p>\\\nTherefore, a new request can be processed after waiting for a single iteration, not waiting for the entire batch to complete. Moreover, with special GPU kernels, these techniques eliminate the need to pad the inputs and outputs. By reducing the queueing delay and the inefficiencies from padding, the fine-grained batching mechanisms significantly increase the throughput of LLM serving.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-zl830pf.png\" alt=\"Figure 3. KV cache memory management in existing systems. Three types of memory wastes – reserved, internal fragmentation, and external fragmentation – exist that prevent other requests from fitting into the memory. The token in each memory slot represents its KV cache. Note the same tokens can have different KV cache when at different positions.\" /></p>\n<p>\\</p>\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2309.06180\">available on arxiv</a> under CC BY 4.0 DEED license.</p>\n<p>:::</p>\n<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Woosuk Kwon, UC Berkeley with Equal contribution;</p>\n<p>(2) Zhuohan Li, UC Berkeley with Equal contribution;</p>\n<p>(3) Siyuan Zhuang, UC Berkeley;</p>\n<p>(4) Ying Sheng, UC Berkeley and Stanford University;</p>\n<p>(5) Lianmin Zheng, UC Berkeley;</p>\n<p>(6) Cody Hao Yu, Independent Researcher;</p>\n<p>(7) Cody Hao Yu, Independent Researcher;</p>\n<p>(8) Joseph E. Gonzalez, UC Berkeley;</p>\n<p>(9) Hao Zhang, UC San Diego;</p>\n<p>(10) Ion Stoica, UC Berkeley.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Mailbird Expands to Mac: Manage All Your Inboxes and Favorite Apps in One Place","url":"https://hackernoon.com/mailbird-expands-to-mac-manage-all-your-inboxes-and-favorite-apps-in-one-place?source=rss","date":1734158658,"author":"HackerNoon Press Releases","unread":true,"desc":"","content":"<p><strong>Mailbird, the email client trusted by millions of Windows users worldwide, is now available for Mac. After years of user anticipation, Mailbird’s Mac app brings the same clutter-free simplicity and clean design language to Apple fans.</strong>&nbsp;</p>\n<p>\\</p>\n<blockquote>\n  <p>“The launching of <strong><a href=\"https://www.getmailbird.com\">Mailbird</a></strong> for Mac marks a truly significant point in our company vision,” said Alexis Dollé, Head of Growth at Mailbird. “Although we originally designed Mailbird for Windows, we always envisioned presenting our customers with a cross-platform app so they can enjoy a unified email experience no matter where they are. Mailbird for Mac is the first step towards achieving that goal.”</p>\n</blockquote>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/hQ098u52DzPm2Y4UITQcQXtLRAk2-z1130eo.jpeg\" alt=\"Alexis Dollé, Head of Growth at Mailbird\" /></p>\n<p>Focusing on customers’ needs is nothing new to Mailbird. With user-favorite features—unified inbox, email tracking, third-party app integrations, advanced search capabilities, folders, and email signatures—Mailbird for Mac possesses the same design and useability that makes the Windows version so popular.</p>\n<p>\\</p>\n<blockquote>\n  <p>“We listen closely to our customers, and the launch of Mailbird for Mac is a direct response to the demand from our Apple community,” said Michael Olsen, co-founder, CEO, and CTO of Mailbird. “Our goal has always been to simplify email management and make our customers’ lives easier. Now, Mac users can experience the productivity boost our Windows users have come to love. Our team is elated about this step forward and bringing even more value to our growing community.”</p>\n</blockquote>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/hQ098u52DzPm2Y4UITQcQXtLRAk2-yu230gb.jpeg\" alt=\"Michael Olsen, Co-founder, CEO, and CTO of Mailbird\" /></p>\n<p>In addition to inbox management, Mailbird allows users to create their own productivity workspace within the app by connecting their favorite tools. From Facebook, X, and LinkedIn to Dropbox, Trello, and ChatGPT—Mailbird’s integrations empower people with the flexibility to turn their inbox into an efficiency hub.</p>\n<p>:::tip\nTo learn more about Mailbird, its pricing, and its current promotions, visit Mailbird and <strong><a href=\"https://www.getmailbird.com/\">try the app</a></strong>.&nbsp;</p>\n<p>:::</p>\n<h2 id=\"aboutmailbird\">About Mailbird</h2>\n<p>Mailbird is one of the most popular email clients worldwide, with more than four million downloads to date and 25+ million emails processed monthly. It lets users manage their business and personal emails in one place, offering customizable themes and features like email signatures, tracking, and folders.&nbsp;</p>\n<p>\\\nMailbird also integrates with social media, task management, and collaboration platforms such as Asana, Slack, ChatGPT, and Google Workspace to help reduce app overload and boost efficiency.</p>\n<p>\\\nFounded in Bali 12 years ago by a fully remote team, Mailbird embraced a global team culture long before it became mainstream. These efforts earned the company multiple <em>Stevie Awards</em>, and its software was named “<strong><a href=\"https://www.getmailbird.com/why-is-mailbird-the-best-alternative-to-thunderbird/\">the best email client for Windows</a></strong>” by PCWorld.&nbsp;</p>\n<p>Mailbird’s core mission is to create a frustration-free email experience, simplify digital communication, and enhance people’s productivity. \\n </p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The TechBeat: Exploring the RIF Token: Bringing Utility to Bitcoin (12/14/2024)","url":"https://hackernoon.com/12-14-2024-techbeat?source=rss","date":1734160254,"author":"Techbeat","unread":true,"desc":"","content":"<p>How are you, hacker? \n 🪐<strong>Want to know what's trending right now?:</strong>\n <a href=\"https://hackernoon.com/homepage-has-a-new-baby\">The Techbeat by HackerNoon </a> has got you covered with fresh content from our trending stories of the day! Set email preference <a href=\"https://app.hackernoon.com/profile/email-settings\">here</a>.\n ## <strong><a href=\"https://hackernoon.com/exploring-the-rif-token-bringing-utility-to-bitcoin\">Exploring the RIF Token: Bringing Utility to Bitcoin</a></strong> <img src=\"https://cdn.hackernoon.com/images/5wpKgV75aONqkTJlafw2yQmK9yd2-tr0348k.png\" alt=\"\" />\n By <a href=\"https://hackernoon.com/u/rootstock_io\">@rootstock_io</a> [ 4 Min read ] \n Learn how the RIF token unlocks DeFi, governance, and improved UX on Bitcoin's leading sidechain, Rootstock. <a href=\"https://hackernoon.com/exploring-the-rif-token-bringing-utility-to-bitcoin\">Read More.</a></p>\n<h2 id=\"everythingyouneedtoknowaboutthelumoztokengenerationeventhttpshackernooncomeverythingyouneedtoknowaboutthelumoztokengenerationeventhttpscdnhackernooncomimageswls6ttjolgmbl8akwqlibcyfjqf2wm33zx8jpeg\"><strong><a href=\"https://hackernoon.com/everything-you-need-to-know-about-the-lumoz-token-generation-event\">Everything You Need to Know About the Lumoz Token Generation Event</a></strong> <img src=\"https://cdn.hackernoon.com/images/Wls6TtjOLGMbl8aKwQlIbcyfjQF2-wm33zx8.jpeg\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/lumoz\">@lumoz</a> [ 5 Min read ] \n The modular compute layer &amp; RaaS platform Lumoz will launch its mainnet and conduct the TGE within a week. Find all the details here! <a href=\"https://hackernoon.com/everything-you-need-to-know-about-the-lumoz-token-generation-event\">Read More.</a></p>\n<h2 id=\"futureproofyourmarketingwiththisguideonwritingforaisearchengineshttpshackernooncomfutureproofyourmarketingwiththisguideonwritingforaisearchengineshttpscdnhackernooncomimagesr40xrkhcy9qxu6ndkd58yy2mqoz1e313j4ywebp\"><strong><a href=\"https://hackernoon.com/future-proof-your-marketing-with-this-guide-on-writing-for-ai-search-engines\">Future-proof Your Marketing With This Guide on Writing for AI Search Engines</a></strong> <img src=\"https://cdn.hackernoon.com/images/R40xrKHcy9QXU6NDkd58YY2mQOz1-e313j4y.webp\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/darragh\">@darragh</a> [ 4 Min read ] \n Learn how to write for AI &amp; search engines with actionable tips, examples, &amp; FAQs. Future-proof your content for ChatGPT, Gemini, &amp; Google SEO success! <a href=\"https://hackernoon.com/future-proof-your-marketing-with-this-guide-on-writing-for-ai-search-engines\">Read More.</a></p>\n<h2 id=\"buildingadataanalyticsplatformtostreamlinethetemporarylaborsectorhttpshackernooncombuildingadataanalyticsplatformtostreamlinethetemporarylaborsectorhttpscdnhackernooncomimagesjt8poynxqmyp92waux1nylvf9im1oz136lkwebp\"><strong><a href=\"https://hackernoon.com/building-a-data-analytics-platform-to-streamline-the-temporary-labor-sector\">Building a Data Analytics Platform to Streamline the Temporary Labor Sector</a></strong> <img src=\"https://cdn.hackernoon.com/images/JT8PoynXQmYP92waUX1nYlVf9Im1-oz136lk.webp\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/marutitechlabs\">@marutitechlabs</a> [ 10 Min read ] \n How Maruti Techlabs developed a cutting-edge data analytics platform that optimized workforce management, reduced costs, and maximized productivity.\n <a href=\"https://hackernoon.com/building-a-data-analytics-platform-to-streamline-the-temporary-labor-sector\">Read More.</a></p>\n<h2 id=\"customeridentificationfrauddetectionfrommarutitechlabsplaybookabankingcasestudyhttpshackernooncomcustomeridentificationandfrauddetectionfrommarutitechlabsplaybookabankingcasestudyhttpscdnhackernooncomimagesjt8poynxqmyp92waux1nylvf9im1jc2353swebp\"><strong><a href=\"https://hackernoon.com/customer-identification-and-fraud-detection-from-maruti-techlabs-playbook-a-banking-case-study\">Customer Identification & Fraud Detection from Maruti Techlabs' Playbook: A Banking Case Study</a></strong> <img src=\"https://cdn.hackernoon.com/images/JT8PoynXQmYP92waUX1nYlVf9Im1-jc2353s.webp\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/marutitechlabs\">@marutitechlabs</a> [ 7 Min read ] \n Voice-based fraud detection offers safe authentication while improving customer service in banking and various industries handling customer calls.  <a href=\"https://hackernoon.com/customer-identification-and-fraud-detection-from-maruti-techlabs-playbook-a-banking-case-study\">Read More.</a></p>\n<h2 id=\"lightchainprotocolaimakeswavesindecentralizedaipresalesurpassesd300000inunder24hourshttpshackernooncomlightchainprotocolaimakeswavesindecentralizedaipresalesurpassesd300000inunder24hourshttpscdnhackernooncomimagesxaktxgmsdlppq9h8roi5ohw9igz2v8136z4jpeg\"><strong><a href=\"https://hackernoon.com/lightchain-protocol-ai-makes-waves-in-decentralized-ai-presale-surpasses-$300000-in-under-24-hours\">Lightchain Protocol AI Makes Waves in Decentralized AI, Presale Surpasses $300,000 in Under 24 Hours</a></strong> <img src=\"https://cdn.hackernoon.com/images/xAktXGmsdLPpQ9H8roi5ohW9igz2-v8136z4.jpeg\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/lightchainai\">@lightchainai</a> [ 3 Min read ] \n Lightchain Protocol AI's LCAI presale raises $300,000+ in 24hrs , merging blockchain and AI to revolutionize industries like healthcare, finance, and logistics. <a href=\"https://hackernoon.com/lightchain-protocol-ai-makes-waves-in-decentralized-ai-presale-surpasses-$300000-in-under-24-hours\">Read More.</a></p>\n<h2 id=\"wallstreetprobablydoesntwantyoutoknowaboutduckcodehttpshackernooncomwallstreetprobablydoesntwantyoutoknowaboutduckcodehttpscdnhackernooncomimages0x1fb1816da507a669f56a866db0f7df54cc539209ftx2zzopng\"><strong><a href=\"https://hackernoon.com/wall-street-probably-doesnt-want-you-to-know-about-duck-code\">Wall Street (Probably) Doesn't Want You to Know About Duck Code</a></strong> <img src=\"https://cdn.hackernoon.com/images/0x1fb1816da507a669f56a866db0f7df54cc539209-ftx2zzo.png\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/professor0\">@professor0</a> [ 13 Min read ] \n The Duck is present in all major financial markets, orchestrating movements on a grand scale. <a href=\"https://hackernoon.com/wall-street-probably-doesnt-want-you-to-know-about-duck-code\">Read More.</a></p>\n<h2 id=\"arischangingthewarehousegamehereshowhttpshackernooncomarischangingthewarehousegamehereshowhttpscdnhackernooncomimagesewjoblqqpvcbjut560idq0aki3q219534fljpeg\"><strong><a href=\"https://hackernoon.com/ar-is-changing-the-warehouse-game-heres-how\">AR is Changing the Warehouse Game— Here’s How</a></strong> <img src=\"https://cdn.hackernoon.com/images/EWjOBlQqPvcBJuT560iDq0AKI3q2-19534fl.jpeg\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/boxhero\">@boxhero</a> [ 10 Min read ] \n Augmented reality technology in warehouse management may sound like a futuristic concept, but in reality, is already in use by companies for years. <a href=\"https://hackernoon.com/ar-is-changing-the-warehouse-game-heres-how\">Read More.</a></p>\n<h2 id=\"arevirtualrelationshipsthenewnormalhttpshackernooncomarevirtualrelationshipsthenewnormalhttpscdnhackernooncomimages7xhqwesk1eg58rzqkiddizmpsi93je530jvpng\"><strong><a href=\"https://hackernoon.com/are-virtual-relationships-the-new-normal\">Are Virtual Relationships the New Normal? </a></strong> <img src=\"https://cdn.hackernoon.com/images/7XhQwEsk1Eg58rZqKidDiZMpsI93-je530jv.png\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/socialdiscoverygroup\">@socialdiscoverygroup</a> [ 2 Min read ] \n Explore how Social Discovery Group is transforming online dating with VR and AR technologies. <a href=\"https://hackernoon.com/are-virtual-relationships-the-new-normal\">Read More.</a></p>\n<h2 id=\"openailauncheschatgptproisthed200monthlysubscriptionworthithttpshackernooncomopenailauncheschatgptproisthed200monthlysubscriptionworthithttpscdnhackernooncomimagesapixelatedrobotaskingfor200onceamontheverymonthuntilyoudiedcqgecgi0hl41a4xf7euj8hupng\"><strong><a href=\"https://hackernoon.com/openai-launches-chatgpt-pro-is-the-$200-monthly-subscription-worth-it\">OpenAI Launches ChatGPT Pro: Is the $200 Monthly Subscription Worth It?</a></strong> <img src=\"https://cdn.hackernoon.com/images/a-pixelated-robot-asking-for-200-once-a-month-every-month-until-you-die-dcqgecgi0hl41a4xf7euj8hu.png\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/iamarsenibragimov\">@iamarsenibragimov</a> [ 3 Min read ] \n  <a href=\"https://hackernoon.com/openai-launches-chatgpt-pro-is-the-$200-monthly-subscription-worth-it\">Read More.</a></p>\n<h2 id=\"blockstmvssealevelacomparisonofparallelexecutionengineshttpshackernooncomblockstmvssealevelacomparisonofparallelexecutionengineshttpscdnhackernooncomimageswsqjfcsxoxwphtnq7snevvhdwgu1j7036ekpng\"><strong><a href=\"https://hackernoon.com/block-stm-vs-sealevel-a-comparison-of-parallel-execution-engines\">Block-STM vs. Sealevel: A Comparison of Parallel Execution Engines</a></strong> <img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-j7036ek.png\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/2077research\">@2077research</a> [ 75 Min read ] \n Block-STM and Sealevel are two approaches to parallelizing blockchain execution. This paper will examine and break down how both TPUs approach parallelization. <a href=\"https://hackernoon.com/block-stm-vs-sealevel-a-comparison-of-parallel-execution-engines\">Read More.</a></p>\n<h2 id=\"howawsempowersintercomtothriveasaproductfirstcompanyhttpshackernooncomhowawsempowersintercomtothriveasaproductfirstcompanyhttpscdnhackernooncomimageswrnyvtpoeveldnef8rw4hd5w26d2mf03rh5png\"><strong><a href=\"https://hackernoon.com/how-aws-empowers-intercom-to-thrive-as-a-product-first-company\">How AWS Empowers Intercom to Thrive as a Product-First Company</a></strong> <img src=\"https://cdn.hackernoon.com/images/wRNYvtpOEveLDNeF8rW4HD5W26D2-mf03rh5.png\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/jillian-godsil\">@jillian-godsil</a> [ 4 Min read ] \n How a product-first company thinks <a href=\"https://hackernoon.com/how-aws-empowers-intercom-to-thrive-as-a-product-first-company\">Read More.</a></p>\n<h2 id=\"iscryptojustanothermisleadingstrategybythereelectedtrumphttpshackernooncomiscryptojustanothermisleadingstrategybythereelectedtrumphttpscdnhackernooncomimagesao3i53agltrgq8nh0cq0aaviih42ye135o6png\"><strong><a href=\"https://hackernoon.com/is-crypto-just-another-misleading-strategy-by-the-re-elected-trump\">Is Crypto Just Another Misleading Strategy by The Re-Elected Trump?</a></strong> <img src=\"https://cdn.hackernoon.com/images/AO3i53agltRgq8NH0cq0AaViIh42-ye135o6.png\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/obyte\">@obyte</a> [ 6 Min read ] \n A lot of people in crypto seem to believe that Trump's re-election could be something very good for them and their ventures. Is it true, though? <a href=\"https://hackernoon.com/is-crypto-just-another-misleading-strategy-by-the-re-elected-trump\">Read More.</a></p>\n<h2 id=\"apentestertookapartawebsitescodetoproveitwastotallypointlesshttpshackernooncomapentestertookapartawebsitescodetoproveitwastotallypointlesshttpscdnhackernooncomimagestyjumticluzj10svuaeuhoy548k2mg1832ptpng\"><strong><a href=\"https://hackernoon.com/a-pentester-took-apart-a-websites-code-to-prove-it-was-totally-pointless\">A Pentester Took Apart a Website’s Code to Prove It Was Totally Pointless</a></strong> <img src=\"https://cdn.hackernoon.com/images/TYJUMtiClUZJ10sVuaeuHOy548K2-mg1832pt.png\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/vognik\">@vognik</a> [ 16 Min read ] \n In this article, I'll walk you through how to reverse-engineer Javascript code and show you how to write my Burp Suite extension in practice. <a href=\"https://hackernoon.com/a-pentester-took-apart-a-websites-code-to-prove-it-was-totally-pointless\">Read More.</a></p>\n<h2 id=\"newevidencechangeshowweunderstandinflationandmonetarypolicyhttpshackernooncomnewevidencechangeshowweunderstandinflationandmonetarypolicyhttpscdnhackernooncomimagesascalebalancedbymoneyoneithersideledhwhi1mgqd1scuzpgo9bh1png\"><strong><a href=\"https://hackernoon.com/new-evidence-changes-how-we-understand-inflation-and-monetary-policy\">New Evidence Changes How We Understand Inflation and Monetary Policy</a></strong> <img src=\"https://cdn.hackernoon.com/images/a-scale-balanced-by-money-on-either-side-ledhwhi1mgqd1scuzpgo9bh1.png\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/keynesian\">@keynesian</a> [ 18 Min read ] \n Discover key insights on inflation, DSGE models, and stochastic equilibrium in New Keynesian economics with fresh econometric approaches. <a href=\"https://hackernoon.com/new-evidence-changes-how-we-understand-inflation-and-monetary-policy\">Read More.</a></p>\n<h2 id=\"theallegedmanifestoofluigimagionetheaccusedmurdererofunitedhealthcareceobrianthompsonhttpshackernooncomreadthefullallegedmanifestoofthe26yearoldaccusedofmurderingunitedhealthcaresceohttpscdnhackernooncomimages2jqchkrv03exbugklrdzibfm99q2la12t7ujpeg\"><strong><a href=\"https://hackernoon.com/read-the-full-alleged-manifesto-of-the-26-year-old-accused-of-murdering-unitedhealthcares-ceo\">The Alleged Manifesto of Luigi Magione,  the Accused Murderer of UnitedHealthcare CEO Brian Thompson</a></strong> <img src=\"https://cdn.hackernoon.com/images/2jqChkrv03exBUgkLrDzIbfM99q2-la12t7u.jpeg\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/legalpdf\">@legalpdf</a> [ 2 Min read ] \n HackerNoon is reproducing the contents of Luigi Mangione's handwritten manifesto, found at the time of his arrest in Pennsylvania. <a href=\"https://hackernoon.com/read-the-full-alleged-manifesto-of-the-26-year-old-accused-of-murdering-unitedhealthcares-ceo\">Read More.</a></p>\n<h2 id=\"rankingonaiisnotascomplicatedasyouthinkhttpshackernooncomrankingonaiisnotascomplicatedasyouthinkhttpscdnhackernooncomimagesr40xrkhcy9qxu6ndkd58yy2mqoz1ta13j7mwebp\"><strong><a href=\"https://hackernoon.com/ranking-on-ai-is-not-as-complicated-as-you-think\">Ranking on AI Is Not as Complicated As You Think</a></strong> <img src=\"https://cdn.hackernoon.com/images/R40xrKHcy9QXU6NDkd58YY2mQOz1-ta13j7m.webp\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/darragh\">@darragh</a> [ 8 Min read ] \n Explore actionable ways to ensure your content surfaces in AI-driven search results and resonates with human readers. <a href=\"https://hackernoon.com/ranking-on-ai-is-not-as-complicated-as-you-think\">Read More.</a></p>\n<h2 id=\"thismonetizationapproachisbecomingmoreprominentinsoftwaresaleshttpshackernooncomthismonetizationapproachisbecomingmoreprominentinsoftwaresaleshttpscdnhackernooncomimageslibt2pgxytgfxfchuwb7qqqmcr425h034jtpng\"><strong><a href=\"https://hackernoon.com/this-monetization-approach-is-becoming-more-prominent-in-software-sales\">This Monetization Approach Is Becoming More Prominent in Software Sales</a></strong> <img src=\"https://cdn.hackernoon.com/images/libt2PgxytgFxFcHUwB7QQQmCr42-5h034jt.png\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/pbland\">@pbland</a> [ 5 Min read ] \n As usage-based pricing options grow in popularity, see how offering flexibility can complement - rather than replace - software subscription models. <a href=\"https://hackernoon.com/this-monetization-approach-is-becoming-more-prominent-in-software-sales\">Read More.</a></p>\n<h2 id=\"whyarentweteachingaiethicsinschoolshttpshackernooncomwhyarentweteachingaiethicsinschoolshttpscdnhackernooncomimagesn0enud29udnjcfcl7gnmzhdk2fa2wa039kmwebp\"><strong><a href=\"https://hackernoon.com/why-arent-we-teaching-ai-ethics-in-schools\">Why Aren't We Teaching AI Ethics in Schools?</a></strong> <img src=\"https://cdn.hackernoon.com/images/N0ENUd29UdNJCFcl7GnmZHdk2fA2-wa039km.webp\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/zacamos\">@zacamos</a> [ 6 Min read ] \n AI is becoming crucial to modern society, yet schools are slow in implementing AI ethics education. Here's how AI ethics should fit into the curriculum. <a href=\"https://hackernoon.com/why-arent-we-teaching-ai-ethics-in-schools\">Read More.</a></p>\n<h2 id=\"leveragetheshortcuttooutperformingeveryonehttpshackernooncomleveragetheshortcuttooutperformingeveryonehttpscdnhackernooncomimagesastreetracefastx6x1tjqzpjyempxjrpegh6oupng\"><strong><a href=\"https://hackernoon.com/leverage-the-shortcut-to-outperforming-everyone\">Leverage: The Shortcut to Outperforming Everyone</a></strong> <img src=\"https://cdn.hackernoon.com/images/a-street-race-fast-x6x1tjqzpjyempxjrpegh6ou.png\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/praisejames\">@praisejames</a> [ 6 Min read ] \n The world doesn’t reward effort. It rewards results. The secret? Leverage. <a href=\"https://hackernoon.com/leverage-the-shortcut-to-outperforming-everyone\">Read More.</a> \n 🧑‍💻 What happened in your world this week? It's been said that <a href=\"https://hackernoon.com/developers-the-why-and-how-to-writing-technical-articles-54e824789ef6\">writing can help consolidate technical knowledge</a>, <a href=\"https://hackernoon.com/how-can-non-writers-become-effective-bloggers-1pq32wd\">establish credibility</a>,<a href=\"https://hackernoon.com/how-can-non-writers-become-effective-bloggers-1pq32wd\"> and contribute to emerging community standards</a>. Feeling stuck? We got you covered ⬇️⬇️⬇️\n <a href=\"https://app.hackernoon.com/mobile/lZx3fmlPdlPJpVBIdble\">ANSWER THESE GREATEST INTERVIEW QUESTIONS OF ALL TIME</a>\n We hope you enjoy this worth of free reading material. Feel free to forward this email to a nerdy friend who'll love you for it.\n See you on Planet Internet! With love, \n The HackerNoon Team ✌️\n <img src=\"https://cdn.hackernoon.com/images/ezgif.com-gif-maker%20(44).gif\" alt=\"\" /></p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Short on Budget? Use These Design Methodologies to Build Your First MVP Without a Full-time Designer","url":"https://hackernoon.com/short-on-budget-use-these-design-methodologies-to-build-your-first-mvp-without-a-full-time-designer?source=rss","date":1734170413,"author":"Marina Chernyshova","unread":true,"desc":"","content":"<p>\\\nMy name is Marina Chernyshova, and in my professional life I often worked with startups at different stages with interface design. Year after year, I notice the same questions arising. I am also a mentor in the <strong><a href=\"https://www.b4i.unibocconi.it/\">Bocconi for Innovation program</a></strong>, where I mentor startups on how to use various design methods and resources to improve the user experience in their products.</p>\n<p>\\\nIn this article, I want to discuss whether an early-stage startup needs a full-time designer and how to approach UX/UI design in general. This article will be helpful for founders and emerging tech entrepreneurs who are just beginning to think about their first tech products, with little more than a raw idea and a business plan.</p>\n<p>\\\nWhen startups move beyond the simple idea stage and start working on an MVP or first prototype — whether to validate their idea or present it to initial investors — founders can often feel stuck. On the one hand, building a prototype seems to require a profound set of skills, making the involvement of designers appear essential. On the other hand, startups often lack resources, raising the question of how to pay designers for building a prototype.</p>\n<p>\\\nIn this article, I argue that an early-stage startup doesn’t always need a full-time designer. Product-oriented founders can often build their first prototypes on their own by following a clear and logical approach.</p>\n<p>\\\nI’ve split this topic into two parts to help founders better understand it. In the first part, I provide an overview of how to approach designing the first prototype, which includes several essential steps and methods such as persona development, interviews, customer journey maps, and user flows. You will see that UX is not just about design; it’s more about perspective — it’s how a user interacts with the company through various touchpoints. In this context, this work can and should be done by more than just designers. For founders, taking these steps will help shape the perspective of the future business as a whole. In the second part I will share useful tips and resources which can help founders to build the first MVP using available community resources.</p>\n<h2 id=\"thepersonasmethod\"><strong>The personas method</strong></h2>\n<p>To move from your idea to what will constitute the first prototype, I insist on starting with <strong>the Personas Method</strong>. Although it emerged as a design technique, I find it essential for other aspects of building the product.</p>\n<p>\\\nThe personas method is a research-driven technique used in design, marketing, and product development to create fictional but realistic profiles representing different types of users or customers. A persona method helps to understand your target audience more specifically, its priorities and potential channels of communication with it.</p>\n<p>\\\nA persona can contain: name, age, profession, interests, goals, values, etc. You can add some additional information relevant to your idea: which devices they use, in which social networks they sit, what kind of sports they do etc.\\</p>\n<p><img src=\"https://cdn.hackernoon.com/images/q85yWTe3qMYufWXZl6MfnYzzwa43-2024-12-14T10:00:10.787Z-zz88alayr01m7907ndd4mgtx\" alt=\"\" /><strong>How to organise:</strong> My tip is to your ready-made <strong><a href=\"https://www.figma.com/community/file/994974628735380661/multiple-personas-template\">Figma Template</a></strong>. But if it is too complicated, simply build it in the Google Doc or in your notepad.</p>\n<p>\\\n<strong>The Ultimate goal:</strong> understanding the profiles of the potential users helps to correctly format messages on banners and achieve better UI.</p>\n<h2 id=\"interviews\"><strong>Interviews</strong></h2>\n<p>Based on the insights unlocked after applying the personas method, you can target your audience and invite them for an interview.</p>\n<p>\\\n<strong>Tips for successful interviews:</strong></p>\n<p>\\</p>\n<ul>\n<li>Formulate open-ended questions to encourage participants to provide detailed responses;</li>\n<li>Start with some light conversation to create a comfortable environment ;</li>\n<li>Observe and listen more than you talk.</li>\n</ul>\n<p>\\\n<strong>Examples of the questions you can ask during an interview:</strong></p>\n<p>\\</p>\n<ul>\n<li>Could you please tell me how you usually choose the tickets for your holiday trip?</li>\n<li>Which problem did you try to solve making this purchase?</li>\n<li>What alternatives did you consider before making this purchase?</li>\n<li>What was the most important factor in your decision to buy this product?</li>\n</ul>\n<p>\\\n<strong>How to organise:</strong> search people through thematic groups on Facebook, Instagram or other social media. For example: <em>if you are making an application for runners, you can write a request to a group about running with an offer to chat for 15 minutes or you can ask the particular questions in writing.</em> Many people are willing to respond.</p>\n<p>\\\n<strong>The Ultimate goal:</strong> understand feelings and emotions of the target audience, what causes their concerns regarding the purchase &nbsp;— <em>high price, ignorance of the market, fear of making a mistake, something else.</em></p>\n<h2 id=\"jtbduserstory\"><strong>JTBD и User Story</strong></h2>\n<p>JTBD should be formulated on the basis of the user interviews. Ideally, it's worth talking to real people who relate to your potential audience. If it's difficult for you to communicate with strangers, then you can start with your friends and acquaintances to practice.</p>\n<p>\\\nJobs To Be Done is a concept in product development that assumes that \"Job\" in this context is a specific problem or task that a person is trying to solve in their life.</p>\n<p>\\\nJob Story has a specific formula that allows you to describe both the needs and the product at once:</p>\n<p><img src=\"https://cdn.hackernoon.com/images/q85yWTe3qMYufWXZl6MfnYzzwa43-2024-12-14T10:00:10.838Z-tokv099fhcdovrva2dwq79xu\" alt=\"\" /></p>\n<p>For example, \"<em>When I want to exercise, but I don't have time and money for the gym, I want to install a convenient and inexpensive online workout app to get in shape without leaving home and save money</em>.\"</p>\n<p>\\\nAnother similar but a bit different methodology is User Story. A user story is a product description based on the specific characteristics of the user and includes a description of the product's functions from his point of view.&nbsp;</p>\n<p>\\\nUser Story also has a formula:</p>\n<p><img src=\"https://cdn.hackernoon.com/images/q85yWTe3qMYufWXZl6MfnYzzwa43-2024-12-14T10:00:10.840Z-ntlph8g34yjhfeywmq62s0i1\" alt=\"\" /></p>\n<p>For example, \"<em>As a 30-year-old programmer who often has back and neck pain due to sedentary work, I want to order a massage chair to make my life more comfortable without leaving home</em>.\"</p>\n<p>\\\nA User Story may be more difficult to compose than a Job Story if you have not 1-2, but 5-10 or more segments of the target audience. In this case, get ready to describe the \"story\" for each segment.</p>\n<p>\\\nYou can choose one of these methods, for example, the one that looks more clear to you, and try to apply it to your idea. You can organize it in a more convenient way for you because it’s just some sentences, so you can start from writing it to your notepad.</p>\n<p>\\\nThe main goal of the JTBD or User Story frameworks is to guide decisions during product discovery, design and development by digging deeper into user behavior. It helps to explore why customers choose a product, and how it helps them solve a problem or achieve an outcome.</p>\n<h2 id=\"customerjourneymap\"><strong>Customer Journey Map</strong></h2>\n<p>After completing 3 steps above, we are getting closer to Customer Journey Map (CJM) and User Flow. Both concepts are important for product development but they address different parts.</p>\n<p>\\\nCJM is a visual representation of the end-to-end experience a customer has with a product, service, or brand. Ideally, the CJM is filled in after the user interviews or even in the process together with them. But if this is not possible, then you can start by filling it in, imagining yourself in the user's position.</p>\n<p>\\\nNormally CJM includes the following: <strong>Awareness > Consideration > Acquisition > Service > Loyalty</strong>, but for digital products it often includes: <strong>Discovery >&nbsp; Download>&nbsp; Onboarding>&nbsp; Retention >&nbsp; Advocacy.</strong></p>\n<p><img src=\"https://cdn.hackernoon.com/images/q85yWTe3qMYufWXZl6MfnYzzwa43-2024-12-14T10:00:10.841Z-m3ftyj38ysotscr6cut32aj0\" alt=\"\" /></p>\n<p>The most important thing is to pay attention to pain points and how we can deal with them using the interface of our product. For instance, we can add gamification to overcome boredom, or we can provide contextual hints or templates for complex features.</p>\n<p>\\\n<strong>How to organise:</strong> There are a lot of digital boards like Miro or FigJam where you can create and develop your CJM. They are really useful because you can share them with your team and it’s quite easy to onboard them. Personally I prefer FigJam because the work on the product design most likely is carried out in Figma and they match perfectly with each other.\\</p>\n<p>\\\nFigJam has its default <strong><a href=\"https://www.figma.com/resource-library/what-is-a-customer-journey-map/\">template for CJM</a></strong> and a guide on how to use it. For me it’s effective and works very well.</p>\n<p>\\\nBut it’s also totally fine to use a real sticker board for that and if you find that this methodology suits you, you can move your CJM to digital format later at any time.</p>\n<p>\\\n<strong>Ultimate goal:</strong> Among other things, CJM is crucial for identifying the pain points of potential customers and the opportunities next to them. With CJM, you can formulate an informed development strategy and prioritize the features within the product that are worth developing.</p>\n<h2 id=\"userflow\"><strong>User Flow</strong></h2>\n<p>After creating your CJM you can transfer it to User Flow. If CJM is an approximate user way without binding to specific screens or interface elements, then User Flow is already the first top-level scheme of your product or service.</p>\n<p>\\\nA User Flow is a visual diagram that maps out the path a user takes through a product or website to accomplish a specific task or goal. It breaks down the sequence of steps users follow, showing how they navigate through screens or pages, interact with elements, and make choices. User flows are essential in UX/UI design for understanding user behavior and creating an intuitive user experience.</p>\n<p><img src=\"https://cdn.hackernoon.com/images/null-rk13dg1.png\" alt=\"\" />Common recommendations for user flow creating:</p>\n<p>\\</p>\n<ul>\n<li>Clearly define the purpose of the product or features for which you are developing user flow. This will help you focus on the key steps and user needs.</li>\n<li>Consider the business goals of the product. Design the product so that each step of the user leads him to the target action. For example, the target action may be to increase the number of registered users, which means that the user flow should always lead the user to registration form.</li>\n<li>It is important to build the user flow so that it works without delay. For example, extra fields in the input form or too long onboarding can spoil the user experience&nbsp; in comparison with competitors.</li>\n<li>Think over all possible points of contact of the user. For example, if we are talking about the registration step, you should provide different options: registration via Gmail, Apple ID, phone etc.</li>\n</ul>\n<p>\\\nFigJam is also great for User Flow building. You can store all your diagrams and data in one project and make it more visual and easy to change.</p>\n<p>\\\nUser flow helps for coordinating the product structure between all team members: designers, developers, product managers, marketers and other stakeholders. It allows you to avoid ambiguity and misunderstandings discussing new features and obstacles.</p>\n<h2 id=\"conclusion\"><strong>Conclusion</strong></h2>\n<p>I hope this article helps founders and other team members choose the right strategy for building their first prototype, especially if they lack the resources to hire a full-time designer. Even if you’ve never seen yourself in the shoes of a designer and have no background in the field, many design methodologies are available that can be understood by people without a professional design background. Methodologies such as customer journey mapping, interviews, and user flows are useful far beyond design work.</p>\n<p>\\\nIn my next article, I will share more practical resources and links to help you move forward with your MVP in a cost-effective way, such as a ready-made design-system. You don’t need to strive for perfection from the very beginning. Just start, and you will gain valuable insights that will make your product’s user experience more organic and smooth. This will save development resources in the future and help avoid negative reviews from users.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"KDE Plasma 6.3 Delivers Much Better Fractional Scaling, Clipboard Using SQLite","url":"https://www.phoronix.com/news/Plasma-6.3-Better-Frac-Scaling","date":1734173179,"author":"Michael Larabel","unread":true,"desc":"","content":"KDE developers continue to be quite busy ahead of the holidays to pack more features into the upcoming Plasma 6.3 desktop release...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Qualcomm Preps Cloud AI 200 \"AIC200\" Accelerator Support","url":"https://www.phoronix.com/news/Qualcomm-AIC200-Support","date":1734175320,"author":"Michael Larabel","unread":true,"desc":"","content":"While not as popular as their Snapdragon SoCs, Qualcomm has been offering their Cloud AI line of accelerators for scalable AI inference. The current flagship is the Qualcomm Cloud AI 100 Ultra as a 150 Watt rated PCIe Gen4 x16 card for up to 870 TOPS INT8 performance, 576MB of SRAM, and 128GB LPR4x memory. But given the latest open-source Linux driver patch activity, Cloud AI 200 \"AIC200\" wares are on the way...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"NTSYNC Linux Driver Updated With API Design Improvements","url":"https://www.phoronix.com/news/Linux-NTSYNC-Driver-v7","date":1734176163,"author":"Michael Larabel","unread":true,"desc":"","content":"After some six months of silence, this past week the NTSYNC LInux kernel driver patches were revived for completing this open-source driver to better match the Windows NT synchronization primitives to help with Wine / Proton (Steam Play) Windows gaming performance on Linux. Following those \"v6\" patches posted a few days ago, on Friday evening a seventh iteration of the patches were volleyed to offer up some API design improvements for this NTSYNC driver...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Mesa 25.0 Introduces Standard Library For Driver OpenCL C","url":"https://www.phoronix.com/news/OpenCL-C-Std-Lib-Mesa-25.0","date":1734184202,"author":"Michael Larabel","unread":true,"desc":"","content":"An interesting addition to Mesa 25.0 this week is Alyssa Rosenzweig adding a standard library for the driver OpenCL C code, including the initial abbility to support assert() on device and other standard C constructs for the OpenCL C code...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"‘Reasoning’ AI models have become a trend, for better or worse","url":"https://techcrunch.com/2024/12/14/reasoning-ai-models-have-become-a-trend-for-better-or-worse/","date":1734184800,"author":"Kyle Wiggers","unread":true,"desc":"","content":"<p>Call it a reasoning renaissance. In the wake of the release of OpenAI&#8217;s o1, a so-called reasoning model, there&#8217;s been an explosion of reasoning models from rival AI labs. In early November, DeepSeek, an AI research company funded by quantitative traders, launched a preview of its first reasoning algorithm, DeepSeek-R1. That same month, Alibaba&#8217;s Qwen [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Shape-Shifting Antenna Takes Cue From \"The Expanse\"","url":"https://spectrum.ieee.org/smart-materials-morphing-antenna","date":1734184804,"author":"Edd Gent","unread":true,"desc":"","content":"<p>Inspired by the sci-fi show, the device morphs to suit its signals</p>","flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTI5MDAwNy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc0NTM1NjE4OX0.lISTY6raML7bt3y-0JgYrGA1UOLBRb4MtqH_SNKw7qY/image.jpg?width=600","enclosureMime":""},{"title":"Intel P-State Energy Aware Scheduling Patches Updated For Lunar Lake","url":"https://www.phoronix.com/news/Intel-P-State-EAS-Lunar-Lake","date":1734186450,"author":"Michael Larabel","unread":true,"desc":"","content":"As covered last month on Phoronix, Intel has been experimenting with Energy Aware Scheduling (EAS) for the Intel P-State driver with a goal of enhancing the power efficiency of Core Ultra \"Lunar Lake\" processors. Recently a second iteration of that work was posted for review ahead of possible inclusion in a future version of the Linux kernel...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Klarna’s CEO says it stopped hiring thanks to AI but still advertises many open positions","url":"https://techcrunch.com/2024/12/14/klarnas-ceo-says-it-stopped-hiring-thanks-to-ai-but-still-advertises-many-open-positions/","date":1734188400,"author":"Maxwell Zeff","unread":true,"desc":"","content":"<p>Klarna CEO Sebastian Siemiatkowski recently told Bloomberg TV that his company essentially stopped hiring a year ago and credited generative AI for enabling this massive workforce reduction. However, despite Siemiatkowski&#8217;s bullishness on AI, the company is not relying entirely on AI to replace human workers who leave, as open job listings — for more humans [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Teaching Kids About Bitcoin Can Ensure Its Legacy Goes On","url":"https://hackernoon.com/teaching-kids-about-bitcoin-can-ensure-its-legacy-goes-on?source=rss","date":1734188414,"author":"M-Marvin Ken","unread":true,"desc":"","content":"<p>I am writing a book for High School kids titled ‘Mathematics and Bitcoin’. \\n  \\n The focus is teaching Mathematics and Bitcoin at the same time, to kids whose parents have orange-pilled them.</p>\n<p>\\\nAll in a fun and educative way. \\n  \\n Does such a demographic exist? \\n  \\n Shoo. \\n  \\n Of course. \\n  \\n Bitcoiners are as pro-populate the Earth as Elon. They're making babies alright. \\n  \\n And dangling Bitcoin kids' cartoons and books in front of them. \\n  \\n Ok. \\n  \\n Why am I writing this book. \\n  \\n Well, when all the speculation is said and done, Bitcoin is still the most advanced form of money ever invented by humanity. \\n  \\n First and Foremost. \\n  \\n Last and Lastmost. \\n  \\n And money must be used for trade. \\n  \\n Must. \\n  \\n But to many a high school kid, this probably doesn't make sense. \\n  \\n They have never used it before for any purchase. \\n  \\n Are you a high school kid, dear reader? \\n  \\n Yeah? \\n  \\n You're still young. \\n  \\n You will find out soon enough. \\n  \\n This thing is like the internet. Everyone, even Boomers, eventually learned to 'Google' things. \\n  \\n If you are 13 in 2024, in 20 years time you will only be 33 years old. \\n  \\n At that time, Bitcoin will be shy of ~ 13 million per coin as some guy called Michael Saylor <a href=\"https://finance.yahoo.com/news/why-michael-saylor-sees-bitcoin-172608012.html\">predicts here</a>. \\n  \\n Saylor is the King of Bitcoin speculation.</p>\n<p>He is buying up as much Bitcoin as he can through as many partnerships as he can make. \\n  \\n He seems to be able to \"==buy at the top forever\"==. \\n  \\n But I'll tell you the truth. \\n  \\n Because you are young and you deserve the truth. \\n  \\n It will not happen forever. \\n  \\n Some have called it an <a href=\"https://dailycoin.com/microstrategys-latest-bitcoin-buy-triggers-andrew-tate-fomo/\">infinite money glitch</a>. \\n  \\n 'Make deals, get more money, buy Bitcoin, price goes up, repeat'. \\n  \\n But it ends. \\n  \\n Where, you say? \\n  \\n When the markets stop giving him bitcoins. That's when. \\n  \\n Why would they stop? \\n  \\n There are only 21 million of them. \\n Some are lost, and other people are also playing by the Saylor playbook. \\n  \\n It is still a small group of people.</p>\n<p>Maybe only 300 people, as Kgothatso Ngako of Machankura mentioned <a href=\"https://www.youtube.com/live/1Zx69XrzUuA?si=pRrDT6N8PN9gJ2V4\">recently (at timestamp 50:50)</a> at the Africa Bitcoin Conference 2024. \\n  \\n Buying every bitcoin they can get their hands on. \\n  \\n But a supply shock is definitely gearing up. \\n  \\n Like a tsunami. \\n  \\n Paper bitcoin (<a href=\"https://hackernoon.com/the-hidden-hand-is-paper-bitcoin-suppressing-btc-prices\">another term</a>) might be keeping it at bay, but people learn new tricks. \\n  \\n So it is happening. \\n  \\n What do you think will likely happen after 2044?</p>\n<p>\\\nSay in another 10 years. In 2054? \\n  \\n <em>thinking</em>… \\n  \\n <em>uuh, the price stops going up??</em> \\n  \\n Precisely. \\n  \\n Few Bitcoiners want to speculate on this. \\n  \\n They are scared of the uncertainty of what happens next. \\n  \\n And of breaking the momentum of their dreams. \\n  \\n But the price will seem to lock out at some point.</p>\n<p>\\\nOnce upon a time, at their birthing, even dollars were definitely going up in value.</p>\n<p>\\\nLike most altcoins.</p>\n<p>\\\nNow they're going down.</p>\n<p>\\\nGold itself seems locked out at some value. It is now snailing upwards. \\n  \\n Maybe $21 million per bitcoin is the mark. \\n  \\n Who knows. \\n  \\n The market and its invisible hand will know better. \\n  \\n That would be a $441 trillion market cap. Theoretically. \\n  \\n But like a Space X Starship rocket when it hits the upper atmosphere, \\n  \\n You know what happens next. \\n  \\n Yes. Free fall. \\n  \\n But not like a rocket. \\n  \\n Not until it falls to the ground. In the hands of Elon's mechazilla. \\n  \\n This isn't a rocket. \\n  \\n It's maybe like a rocket that can become an air balloon. \\n  \\n So the price may float at some value. \\n  \\n Saturate. Just like gold has done.</p>\n<p>\\\nEven more as it is FIXED.</p>\n<p>\\\nSo it will super-saturate.</p>\n<p>\\n And only climb 10% in a good market year. With next to zero black hacking events, rugs and wars. \\n  \\n Then falls 20% when there is a rugging of many ill informed newbies. \\n  \\n Maybe more. \\n  \\n Maybe it will fall back to $13 million per coin. \\n  \\n Here's the point though. \\n  \\n Whatever happens, saturated Bitcoin will need a band of smart and technical Bitcoiners to keep it useful. \\n  \\n With skills rooted in Mathematics and Physics. \\n  \\n Not Economics. \\n  \\n The government is the King in that arena. \\n  \\n Mathematics and Physics. \\n  \\n This is the foundation. \\n  \\n Make it rock solid, then the speculation can sit comfortably on top of it. \\n  \\n Absent Mathematics and Physics, and everything crashes. \\n  \\n *** \\n  \\n One other truth Bitcoiners might not like is this. \\n  \\n Bitcoin is fragile. \\n  \\n Like Human Civilization. \\n  \\n As Elon has reminded us, it isn't obvious that civilization keeps advancing. \\n  \\n The Greek Civilization died out. \\n </p>\n<p>Ancient Egypt, Ancient Rome, many countries today have memories of grander times. \\n  \\n If we nuke each other, we shall soon be the Ancient Silicon and Oil Civilization. \\n  \\n Same goes for Bitcoin. \\n  \\n IF not nukes… \\n  \\n IF Saylor and other hodlers crash Bitcoin, then someone will have to be ready to pick up the broken pieces and fix it. \\n  \\n I mean, at $13 million per coin, I can't imagine all the possible activity, legal and illegal, that might be birthed. \\n  \\n To capitalize on this hodling hype train. \\n  \\n To the moon, they'll all say. \\n  \\n But this will be a very heavy rocket. \\n  \\n It's mass will not allow it to go up any further. \\n  \\n So ya’ll kids will need to be ready when the time comes. \\n  \\n To save us, the then ancient Bitcoiners, from our hair brained too-the-moon hodling scheme. \\n  \\n Meanwhile, I too am stacking sats. \\n  \\n I want to push this up.</p>\n<p>Bring a novel economic reality closer to me, when still in my youth. \\n  \\n Shock sense into the naysayers bones. \\n  \\n All as I try to write that book instead of another blog article. \\n (Writing a book is hard, kid).</p>\n<p>\\\n*** \\n  \\n That's it kid. \\n  \\n Dear Anon. \\n  \\n Do enjoy the holidays. \\n  \\n I'll see you on the other side of my book.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Why Marc Andreessen was ‘very scared’ after meeting with the Biden administration about AI","url":"https://techcrunch.com/2024/12/14/why-marc-andreessen-was-very-scared-after-meeting-with-the-biden-administration-about-ai/","date":1734192000,"author":"Margaux MacColl","unread":true,"desc":"","content":"<p>What scared him most was what some said about the government’s role in AI, and what he described as a young staff who were “out for blood. ”</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The HackerNoon Newsletter: I Fell in Love With My Code, Then I Had to Kill It (12/14/2024)","url":"https://hackernoon.com/12-14-2024-newsletter?source=rss","date":1734192277,"author":"Noonification","unread":true,"desc":"","content":"\n              \n        <p><strong>How are you, hacker?</strong></p>\n        <br />\n        <p>🪐 What’s happening in tech today, December 14, 2024?</p>\n        <br />\n        <p>\n          The\n          <a href=\"https://hackernoon.com/noonification\" target=\"_blank\" rel=\"noopener\"> HackerNoon Newsletter</a>\n          brings the HackerNoon \n          <a href=\"https://hackernoon.com\" target=\"_blank\" rel=\"noopener\">homepage</a>\n          straight to your inbox.\n          <a href=\"https://hackernoon.com/on-this-day\" target=\"_blank\" rel=\"noopener\">On this day,</a>\n          \n            <strong>US Navy and MIT Developed Whirlwind</strong> in 1952,  <strong>Planck Presented Black-Body Radiation Law Derivation</strong> in 1900,  <strong>DNA is Created in a Test Tube</strong> in 1967,  <strong>Wilkinson Patented the Nut and Bolt Machine</strong> in 1798, \n          \n          and  we present you with these top quality stories. \n          \n            From \n        <a href=\"https://hackernoon.com/build-an-ai-chatbot-faster-than-your-morning-coffee-run-with-this-guide\" class=\"eventTitle\"><strong>Build an AI Chatbot Faster Than Your Morning Coffee Run With This Guide</strong></a>\n       to \n        <a href=\"https://hackernoon.com/explainable-ai-is-just-rebranding-the-chaos-not-solving-it\" class=\"eventTitle\"><strong>Explainable AI Is Just Rebranding the Chaos, Not Solving It</strong></a>,\n       let’s dive right in.\n          \n        </p>\n      \n              \n          <h2><a href=\"https://hackernoon.com/teaching-kids-about-bitcoin-can-ensure-its-legacy-goes-on\">Teaching Kids About Bitcoin Can Ensure Its Legacy Goes On</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/EHUYZRLLAUbgArGtd43kEIxTOTS2-zn03673.webp\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/maken8\">@maken8</a> [ 5 Min read ] Bitcoin is the biggest mathematical and technological invention of this century.\nAnd the best way to carry it forward is to teach its foundations to our kids. <a href=\"https://hackernoon.com/teaching-kids-about-bitcoin-can-ensure-its-legacy-goes-on\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/short-on-budget-use-these-design-methodologies-to-build-your-first-mvp-without-a-full-time-designer\">Short on Budget? Use These Design Methodologies to Build Your First MVP Without a Full-time Designer</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/q85yWTe3qMYufWXZl6MfnYzzwa43-8u03d0a.png\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/marinacher\">@marinacher</a> [ 8 Min read ] An early-stage startup doesn’t always need a full-time designer. Product-oriented founders can often build their first prototypes on their own. <a href=\"https://hackernoon.com/short-on-budget-use-these-design-methodologies-to-build-your-first-mvp-without-a-full-time-designer\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/i-fell-in-love-with-my-code-then-i-had-to-kill-it\">I Fell in Love With My Code, Then I Had to Kill It</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/oUS9HxHnMOackh1UhEDoXjMokWv1-7z22qhg.png\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/michaelsalim\">@michaelsalim</a> [ 6 Min read ] Sometimes the best code is the code you delete. Dont love your code and do whats best for the codebase. <a href=\"https://hackernoon.com/i-fell-in-love-with-my-code-then-i-had-to-kill-it\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/build-an-ai-chatbot-faster-than-your-morning-coffee-run-with-this-guide\">Build an AI Chatbot Faster Than Your Morning Coffee Run With This Guide</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/m6OvIAdfE8XXYN2x7hNbCvMdhAk2-kl133ii.jpeg\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/ivmarcos\">@ivmarcos</a> [ 7 Min read ] Learn how to build an AI-powered chatbot using React, Vite, and Coheres API.  <a href=\"https://hackernoon.com/build-an-ai-chatbot-faster-than-your-morning-coffee-run-with-this-guide\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/explainable-ai-is-just-rebranding-the-chaos-not-solving-it\">Explainable AI Is Just Rebranding the Chaos, Not Solving It</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/pC9ETKtznagNvUGUgZ8sqefPnUA3-l1031sq.jpeg\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/bigmao\">@bigmao</a> [ 8 Min read ] Explainable AI is hot. The promise of transparency is noble, but the trade-offs could stifle AI’s real potential. Is chasing “why” worth derailing progress? <a href=\"https://hackernoon.com/explainable-ai-is-just-rebranding-the-chaos-not-solving-it\">Read More.</a></p>\n        \n              \n        <br />\n        <p>🧑‍💻 What happened in your world this week?</p>\n        <p>\n          It's been said that\n          <a href=\"https://hackernoon.com/developers-the-why-and-how-to-writing-technical-articles-54e824789ef6\">writing can help consolidate technical knowledge</a>,\n          <a href=\"https://hackernoon.com/how-can-non-writers-become-effective-bloggers-1pq32wd\">establish credibility</a>,\n          <a href=\"https://hackernoon.com/how-can-non-writers-become-effective-bloggers-1pq32wd\"> and contribute to emerging community standards</a>.\n          Feeling stuck? We got you covered ⬇️⬇️⬇️\n        </p>\n        <br />\n        <p>\n          <a href=\"https://app.hackernoon.com/mobile/lZx3fmlPdlPJpVBIdble\">ANSWER THESE GREATEST INTERVIEW QUESTIONS OF ALL TIME</a>\n        </p>\n        <br />\n        <p>We hope you enjoy this worth of free reading material. Feel free to forward this email to a nerdy friend who'll love you for it.See you on Planet Internet! With love, \n The HackerNoon Team ✌️</p>\n        <br />\n        <p><img src=\"https://cdn.hackernoon.com/images/the-hackernoon-newsletter-footer.png\" alt /></p>\n      \n            ","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Arlan Hamilton announces changes at Backstage Capital, will step into advisory role","url":"https://techcrunch.com/2024/12/14/arlan-hamilton-announces-changes-at-backstage-capital-will-step-into-advisory-role/","date":1734193800,"author":"Dominic-Madori Davis","unread":true,"desc":"","content":"<p>Arlan Hamilton, founder of Backstage Capital, announced Friday that her role at the firm she started in 2015 will evolve.&#160; “After 12 years of being deeply involved in the day-to-day operations, I’ve decided to transition into a chairperson and advisory position,” she wrote in a statement released online. She was previously a managing partner at [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Evaluation Metrics for Assessing LLM Performance on Syllogistic Tasks","url":"https://hackernoon.com/evaluation-metrics-for-assessing-llm-performance-on-syllogistic-tasks?source=rss","date":1734195613,"author":"Large Models","unread":true,"desc":"","content":"<h2 id=\"tableoflinks\">Table of Links</h2>\n<ol>\n<li><p><a href=\"http://hackernoon.com/preview/aSXPlErMbpr6a2LTxaH9\">Abstract and Introduction</a> </p></li>\n<li><p><a href=\"https://hackernoon.com/preview/MEstM5YLV40pSBnE79rn\">SylloBio-NLI</a> </p></li>\n<li><p><a href=\"https://hackernoon.com/preview/oaS9suCIHEiYxEmmMu7T\">Empirical Evaluation</a> </p></li>\n<li><p><a href=\"https://hackernoon.com/preview/dljlfhDBlWzYbwAlFWed\">Related Work</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/WP3H1CCStiBYGQdmWGRB\">Conclusions</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/3vZr4QtazoJvQ9Gx1OGS\">Limitations and References</a></p>\n<p>\\</p></li>\n</ol>\n<p><a href=\"http://hackernoon.com/preview/zmWCXL4vRhA46DKDYgUM\">A. Formalization of the SylloBio-NLI Resource Generation Process</a></p>\n<p><a href=\"http://hackernoon.com/preview/W59VxQoaIRFddzuBgXWv\">B. Formalization of Tasks 1 and 2</a></p>\n<p><a href=\"http://hackernoon.com/preview/E6xq9YUyuOPB3jIMYVgi\">C. Dictionary of gene and pathway membership</a></p>\n<p><a href=\"https://hackernoon.com/preview/zZfv6kyOiyGP5c5X4pLQ\">D. Domain-specific pipeline for creating NL instances and E Accessing LLMs</a></p>\n<p><a href=\"https://hackernoon.com/preview/fgseYuHoMrGtQZw0Cybf\">F. Experimental Details</a> </p>\n<p><a href=\"http://hackernoon.com/preview/T88hyNZd1S74exmackTl\">G. Evaluation Metrics</a></p>\n<p><a href=\"http://hackernoon.com/preview/CZQFZ6XkKskgvOBHFRYY\">H. Prompting LLMs - Zero-shot prompts</a></p>\n<p><a href=\"http://hackernoon.com/preview/eCDePTBvQklVeZ5Hghs0\">I. Prompting LLMs - Few-shot prompts</a></p>\n<p><a href=\"http://hackernoon.com/preview/oEHn454yOGJkiiM5cKH2\">J. Results: Misaligned Instruction-Response</a></p>\n<p><a href=\"http://hackernoon.com/preview/JVG0UwEHwu0TQUcleYvY\">K. Results: Ambiguous Impact of Distractors on Reasoning</a></p>\n<p><a href=\"http://hackernoon.com/preview/d4D9VdXVQwM76Axu39iE\">L. Results: Models Prioritize Contextual Knowledge Over Background Knowledge</a></p>\n<p><a href=\"http://hackernoon.com/preview/HZFLCYxM9569OJ3b6HZG\">M Supplementary Figures and N Supplementary Tables</a></p>\n<h2 id=\"gevaluationmetrics\">G Evaluation Metrics</h2>\n<p><img src=\"https://cdn.hackernoon.com/images/null-n2134zx.png\" alt=\"\" /></p>\n<p>\\</p>\n<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Magdalena Wysocka, National Biomarker Centre, CRUK-MI, Univ. of Manchester, United Kingdom;</p>\n<p>(2) Danilo S. Carvalho, National Biomarker Centre, CRUK-MI, Univ. of Manchester, United Kingdom and Department of Computer Science, Univ. of Manchester, United Kingdom;</p>\n<p>(3) Oskar Wysocki, National Biomarker Centre, CRUK-MI, Univ. of Manchester, United Kingdom and ited Kingdom 3 I;</p>\n<p>(4) Marco Valentino, Idiap Research Institute, Switzerland;</p>\n<p>(5) André Freitas, National Biomarker Centre, CRUK-MI, Univ. of Manchester, United Kingdom, Department of Computer Science, Univ. of Manchester, United Kingdom and Idiap Research Institute, Switzerland.</p>\n<p>:::</p>\n<hr />\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2410.14399\">available on arxiv</a> under CC BY-NC-SA 4.0 license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Tired of Siri Messing Up Your Name? Here's a Simple Fix","url":"https://hackernoon.com/tired-of-siri-messing-up-your-name-heres-a-simple-fix?source=rss","date":1734195617,"author":"Philip Hopkins","unread":true,"desc":"","content":"<p>I’ve had an iPhone for ten years, and I love it. Unlike some people, I really enjoy Siri and use it frequently. But after ten years, Siri hasn't figured out that when it transcribes my texts, it should know my wife's name is not Aaron, it's Erin. I forgive the speech-to-text implementation, which is resource-intensive, but after I corrected that mistake once and sent a revised text, that correction should have been stored in a correction history on my phone—a small file used by a post-processing transformer model, along with other clues, to make this mistake much less likely. I know that to call the iPhone’s speech to text functionality Siri is oversimplifying, but that’s how my kids think of the ‘AI in my iPhone.’</p>\n<p>\\\nSpeech-to-text systems often struggle with homophones—words that sound the same but have different spellings and meanings. These errors can be frustrating, especially when they affect personal names or commonly used terms. The key to fixing this problem lies not in overhauling the speech recognition engine but in a lightweight, post-transcription text processing layer that adapts to user corrections over time. Here’s the PyTorch-based code I designed to address this.</p>\n<p>\\\nIt's super compact and easy to deploy on a phone after compiling for mobile. I know that behind Siri is a highly complex set of chained models, so this code could be used just to provide a new feature as input to those models, a score that helps personalize the transcription when particular homophones arise. But it would be simpler to use this as a post processing layer.</p>\n<p>This doesn’t have to wait for a new phone release to be deployed. It would make life better for me in the next update Apple releases for my iPhone.</p>\n<h2 id=\"thecoreidea\"><strong>The Core Idea</strong></h2>\n<h3 id=\"thisapproachfocusesonthreemainelements\">This approach focuses on three main elements:</h3>\n<ul>\n<li><strong>Correction History:</strong> Stores previous user corrections, prioritizing words the user has explicitly fixed before.</li>\n<li><strong>Frequent Contacts:</strong> Tracks frequently used words or names, assigning a higher likelihood to those more commonly used.</li>\n<li><strong>Contextual Analysis:</strong> Uses Natural Language Processing (NLP) to analyze the surrounding text for clues that help disambiguate homophones.</li>\n</ul>\n<p>\\\nThe system calculates a likelihood score for each homophone candidate based on these three factors and selects the most likely correction. Below is the Python implementation broken into sections with explanations.</p>\n<h3 id=\"loadingthehomophonesdatabase\"><strong>Loading the Homophones Database</strong></h3>\n<p>The first step is creating or loading a database of homophones. These are word pairs (or groups) that are likely to be confused during transcription.</p>\n<p>\\</p>\n<pre><code class=\"javascript language-javascript\"># Homophones database\nhomophones_db = {\n    \"Aaron\": [\"Erin\"],\n    \"bare\": [\"bear\"],\n    \"phase\": [\"faze\"],\n    \"affect\": [\"effect\"],\n}\n</code></pre>\n<p>This is a simple dictionary where the key is the incorrectly transcribed word, and the value is a list of homophone alternatives. For example, \"phase\" can be confused with \"faze\". Later, this database will be queried when an ambiguous word is encountered.</p>\n<h3 id=\"trackingcorrectionhistory\"><strong>Tracking Correction History</strong></h3>\n<p>The code tracks user corrections in a dictionary where each key is a tuple of (original<em>word, corrected</em>word) and the value is the count of times the user corrected that error.</p>\n<h3 id=\"correctionhistorytracker\">Correction history tracker</h3>\n<pre><code class=\"javascript language-javascript\"># Correction history tracker\ncorrection_history = {\n    (\"phase\", \"Faye's\"): 3,\n    (\"bear\", \"bare\"): 2,\n}\n</code></pre>\n<p>\\\nIf the user corrects \"phase\" to \"Faye’s\" three times, the system prioritizes this correction for future transcriptions.</p>\n<h3 id=\"frequentcontacts\"><strong>Frequent Contacts</strong></h3>\n<p>Another factor influencing homophone selection is how often a particular word is used. This could be personal names or terms the user frequently types.</p>\n<pre><code class=\"javascript language-javascript\"># Frequent contact tracker\nfrequent_contacts = {\n    \"faye\": 15,\n    \"phase\": 5,\n    \"erin\": 10,\n    \"aaron\": 2,\n}\n</code></pre>\n<p>The system gives more weight to frequently used words when disambiguating homophones. For instance, if \"faye\" appears 15 times but \"phase\" appears only 5 times, \"faye\" will be preferred.</p>\n<h3 id=\"contextualanalysis\"><strong>Contextual Analysis</strong></h3>\n<p>Context clues are extracted from the surrounding sentence to further refine the selection. For example, if the sentence contains the pronoun \"she\", the system might favor \"Erin\" over \"Aaron\". from transformers import pipeline</p>\n<h2 id=\"loadannlpmodelforcontextanalysis\">Load an NLP model for context analysis</h2>\n<pre><code class=\"javascript language-javascript\">from transformers import pipeline\n\n# Load an NLP model for context analysis\ncontext_analyzer = pipeline(\"fill-mask\", model=\"bert-base-uncased\")\n\ndef detect_context(sentence):\n    \"\"\"Detect context-specific clues in the sentence.\"\"\"\n    pronouns = [\"he\", \"she\", \"his\", \"her\", \"their\"]\n    tokens = sentence.lower().split()\n    return [word for word in tokens if word in pronouns]\n</code></pre>\n<p>This function scans the sentence for gender-specific pronouns or other clues that might indicate the intended meaning of the word.</p>\n<h2 id=\"calculatinglikelihoodscores\">Calculating Likelihood Scores</h2>\n<p>Each homophone candidate is assigned a likelihood score based on:</p>\n<ol>\n<li><strong>Past Corrections</strong>: Higher weight (e.g., 3x).</li>\n<li><strong>Frequent Usage</strong>: Medium weight (e.g., 2x).</li>\n<li><strong>Context Matching</strong>: Lower weight (e.g., 1x).</li>\n</ol>\n<pre><code class=\"javascript language-javascript\">def calculate_likelihood(word, candidate, sentence):\n    \"\"\"Calculate a likelihood score for a homophone candidate.\"\"\"\n    correction_score = correction_history.get((word, candidate), 0) * 3\n    frequency_score = frequent_contacts.get(candidate, 0) * 2\n    context = detect_context(sentence)\n    context_clues = homophones_db.get(candidate, [])\n    context_score = sum(1 for clue in context if clue in context_clues)\n    return correction_score + frequency_score + context_score\n</code></pre>\n<p>This score combines the three factors to determine the most likely homophone.</p>\n<h2 id=\"disambiguatinghomophones\">Disambiguating Homophones</h2>\n<p>With the likelihood scores calculated, the system selects the homophone with the highest score.</p>\n<pre><code class=\"javascript language-javascript\">def prioritize_homophones(word, candidates, sentence):\n    \"\"\"Prioritize homophones based on their likelihood scores.\"\"\"\n    likelihoods = {\n        candidate: calculate_likelihood(word, candidate, sentence) for candidate in candidates\n    }\n    return max(likelihoods, key=likelihoods.get)\n\ndef disambiguate_homophone(word, sentence):\n    \"\"\"Disambiguate homophones using likelihood scores.\"\"\"\n    candidates = homophones_db.get(word, [])\n    if not candidates:\n        return word\n    return prioritize_homophones(word, candidates, sentence)\n</code></pre>\n<p>\\\nThis process ensures the most appropriate word is chosen based on history, frequency, and context.</p>\n<h2 id=\"processingfulltranscriptions\"><strong>Processing Full Transcriptions</strong></h2>\n<p>The system processes an entire sentence, applying the disambiguation logic to each word.</p>\n<pre><code class=\"javascript language-javascript\">def process_transcription(transcription):\n    \"\"\"Process the transcription to correct homophones.\"\"\"\n    words = transcription.split()\n    corrected_words = [disambiguate_homophone(word, transcription) for word in words]\n    return \" \".join(corrected_words)\n</code></pre>\n<h2 id=\"fullexampleworkflow\">Full Example Workflow</h2>\n<pre><code class=\"javascript language-javascript\"># Example transcription and correction\nraw_transcription = \"This is phase one plan.\"\ncorrected_transcription = process_transcription(raw_transcription)\n\nprint(\"Original Transcription:\", raw_transcription)\nprint(\"Corrected Transcription:\", corrected_transcription)\n\n# Simulate user feedback\nupdate_correction_history(\"phase\", \"faye\")\nprint(\"Updated Correction History:\", correction_history)\nprint(\"Updated Frequent Contacts:\", frequent_contacts)\n</code></pre>\n<h2 id=\"updatingfeedback\">Updating Feedback</h2>\n<p>When the user corrects a mistake, the correction history and frequent contacts are updated to improve future predictions.</p>\n<p>\\</p>\n<pre><code class=\"javascript language-javascript\">def update_correction_history(original, corrected):\n    \"\"\"Update correction history and frequent contacts.\"\"\"\n    correction_history[(original, corrected)] = correction_history.get((original, corrected), 0) + 1\n    frequent_contacts[corrected] = frequent_contacts.get(corrected, 0) + 1\n    frequent_contacts[original] = max(0, frequent_contacts.get(original, 0) - 1)\n</code></pre>\n<h1 id=\"exampletranscriptionandcorrection\">Example transcription and correction</h1>\n<pre><code class=\"javascript language-javascript\">Original Transcription: This is phase one plan.\nCorrected Transcription: This is Faye's one plan.\nUpdated Correction History: {('phase', 'Faye's'): 4}\nUpdated Frequent Contacts: {'Faye's': 16, 'phase': 4}\n</code></pre>\n<hr />\n<h3 id=\"conclusion\"><strong>Conclusion</strong></h3>\n<p>This lightweight text-processing layer enhances the accuracy of speech-to-text applications by learning from user corrections, leveraging frequent usage, and analyzing context. It’s compact enough to run on mobile devices and adaptable to individual user needs, offering a smarter alternative to traditional static models. With minimal effort, Apple—or any other company—could integrate this functionality to make virtual assistants like Siri more responsive and personalized.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The Science Behind AI’s Ability to Recreate Art Styles","url":"https://hackernoon.com/the-science-behind-ais-ability-to-recreate-art-styles?source=rss","date":1734195619,"author":"Torts","unread":true,"desc":"","content":"<h2 id=\"tableoflinks\">Table of Links</h2>\n<p><a href=\"http://hackernoon.com/preview/LsXcUIkIu85mmj5J2zZO\">Abstract and 1. Introduction</a></p>\n<ol start=\"2\">\n<li><p><a href=\"http://hackernoon.com/preview/ZChuKAMuEZWC2MFwFjce\">Background and Related Work</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/Ih6TEkzwEqrGeNNYhy3B\">Threat Model</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/112rIPQl4eN67oQwYH62\">Robust Style Mimicry</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/aUg0L0pkdqrIC3ZXYZrC\">Experimental Setup</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/wt8OohM7KVglziiuQ2kb\">Results</a></p>\n<p><a href=\"https://hackernoon.com/preview/BURm7nJw7qLxv0xgk9SH\">6.1 Main Findings: All Protections are Easily Circumvented</a></p>\n<p><a href=\"http://hackernoon.com/preview/qf0fmDGxkwHKNljVb9GZ\">6.2 Analysis</a> </p></li>\n<li><p><a href=\"https://hackernoon.com/preview/Nan3sap7D86JxuZKNjKs\">Discussion and Broader Impact, Acknowledgements, and References</a></p></li>\n</ol>\n<p><a href=\"http://hackernoon.com/preview/5QUQCnKdEDZaJKUesUBK\">A. Detailed Art Examples</a> </p>\n<p><a href=\"https://hackernoon.com/preview/2Dlrp82ks8JgJ7gSdQiZ\">B. Robust Mimicry Generations</a> </p>\n<p><a href=\"http://hackernoon.com/preview/rZwLkJjFYqu4gndPjwe2\">C. Detailed Results</a> </p>\n<p><a href=\"https://hackernoon.com/preview/go1iBzdzIX8LVvV3HoIi\">D. Differences with Glaze Finetuning</a> </p>\n<p><a href=\"http://hackernoon.com/preview/Upeyfrqqx0A7ATQRFasx\">E. Findings on Glaze 2.0</a> </p>\n<p><a href=\"https://hackernoon.com/preview/0pKU7964WfCUB450ktQx\">F. Findings on Mist v2</a> </p>\n<p><a href=\"http://hackernoon.com/preview/yFqpQfuJ2oaZmDbrkxpQ\">G. Methods for Style Mimicry</a> </p>\n<p><a href=\"http://hackernoon.com/preview/gwnVL3RT3X24cyDJoktq\">H. Existing Style Mimicry Protections</a> </p>\n<p><a href=\"https://hackernoon.com/preview/mIogJifKFI37iKcvSdXT\">I. Robust Mimicry Methods</a> </p>\n<p><a href=\"http://hackernoon.com/preview/qIaRQ6OxXQce90MtVt3K\">J. Experimental Setup</a> </p>\n<p><a href=\"https://hackernoon.com/preview/cwRDm1AqdaMByA8reKW7\">K. User Study</a> </p>\n<p><a href=\"http://hackernoon.com/preview/BhGyXuAxf4sRHGCuwlnw\">L. Compute Resources</a></p>\n<h2 id=\"gmethodsforstylemimicry\">G Methods for Style Mimicry</h2>\n<p>This section summarizes the existing methods that a style forger can use to perform style mimicry. Our work only considers finetuning since it is reported to be the most effective (Shan et al., 2023a).</p>\n<h3 id=\"g1prompting\">G.1 Prompting</h3>\n<p>Well-known artistic styles contained in the training data (e.g. Van Gogh) can be mimicked by prompting a text-to-image model with a description of the style or the name of the artist. For example, a prompt can be augmented with “ painted in a cubistic style” “ painted by van Gogh” to mimic those styles, respectively. Prompting is easy to apply and does not require changes to the model. However, it fails to mimic styles that are not sufficiently represented in the training data of model—often from the most vulnerable artists.</p>\n<h3 id=\"g2img2img\">G.2 Img2Img</h3>\n<p>Img2Img creates an updated version of an image with guidance from a prompt. For this, Img2Img processes image x with t timesteps of a diffusion process to obtain the diffused image xt. Then, Img2Img uses the model with guidance from prompt P to reverse the diffusion process into the output image variation xP . Analogous to prompting, a prompt suffices to transfer a well-known style, but Img2Img also fails for unknown styles.</p>\n<h3 id=\"g3textualinversion\">G.3 Textual Inversion</h3>\n<p>Textual inversion (Gal et al., 2022) optimizes the embedding of some n new tokens t = [t1, . . . , tn] that are appended to image prompts P so that generations closely mimic the style of a given set of images. The tokens are optimized via gradient descent on the model training loss so that P + t generates images that mimic the target style. Textual inversion requires white-box access to the target model, but enables the mimicry of unknown styles.</p>\n<h3 id=\"g4finetuning\">G.4 Finetuning</h3>\n<p>Finetuning updates the weights of a pretrained text-to-image model to introduce a new functionality. In this case, finetuning allows a forger to “teach” the generative model an unknown style using a set of images in the target style and their captions (e.g. an astronaut riding a horse). First, all captions are augmented with some special word, like the name of the artist, to create prompts Px = Cx + “by w∗”. Then, the model weights are updated to minimize the reconstruction loss of the given images following the augmented prompts. At inference time, the forger can append “by w∗” to any prompt to obtain art in the target style</p>\n<p>\\\nThe authors of Glaze identify this finetuning setup as the strongest style mimicry method (Shan et al., 2023a). We validate the success of our style mimicry with a user study detailed in Appendix K.1</p>\n<p>\\</p>\n<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Robert Honig, ETH Zurich (robert.hoenig@inf.ethz.ch);</p>\n<p>(2) Javier Rando, ETH Zurich (javier.rando@inf.ethz.ch);</p>\n<p>(3) Nicholas Carlini, Google DeepMind;</p>\n<p>(4) Florian Tramer, ETH Zurich (florian.tramer@inf.ethz.ch).</p>\n<p>:::</p>\n<hr />\n<p>:::info\nThis paper is <strong><a href=\"https://arxiv.org/abs/2406.12027\">available on arxiv</a></strong> under CC BY 4.0 license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Chinese Electric Cars are Already Surging in Popularity in Mexico, Europe, Asia, and Africa","url":"https://hardware.slashdot.org/story/24/12/14/0534213/chinese-electric-cars-are-already-surging-in-popularity-in-mexico-europe-asia-and-africa?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1734197640,"author":"EditorDavid","unread":true,"desc":"","content":"\"The Chinese government has long subsidized carmakers with the goal of becoming a major auto exporter,\" notes the New York Times. But this week they reported on dozens of dealerships around Mexico that are now selling China-made electric vehicles, saying it could be \"a potentially grave threat to the North American auto industry.\" \n\nOne employee said their dealership \"was selling cars as fast as they arrived from China,\" including \"a small but capable four-door electric compact that costs about $18,000.\"\n\nChinese carmakers are effectively barred from the United States by tariffs that double the sticker price of vehicles imported from China, and they are not yet manufacturing significant numbers of vehicles in Mexico that could be exported across the border. But their ambition to expand overseas is on vivid display in Mexico and across Latin America, Asia, Europe and Africa. Ads for Chinese brands are in airports and soccer stadiums and loom above Mexico City streets on large billboards. Chinese cars, both gasoline and electric models, are an increasingly common sight. BYD and others are also looking for places to build factories in Mexico, although none have announced firm plans. Initially, the plants would serve Latin America, part of a campaign by Chinese automakers to erode the dominance of Japanese, American and European carmakers in places like Brazil and Thailand. \n\nBut there is little doubt that, eventually, Chinese carmakers hope to use Mexico as an on-ramp to the United States.\n \nOne of Mexico's EV dealers suggested to the Times that \"maybe next year BYD can enter the United States.\" And he added with a smile, \"If not, I can deliver.\"\nIt is very unlikely that the Dolphin or any other Chinese car brand will be available in the United States soon. Because of the high tariffs, Chinese carmakers have not tried to establish dealerships or get approval from federal regulators to sell in the United States. (BYD does make electric buses in California.) And someone buying a BYD from a Mexican dealer like Mr. Alegr&iacute;a would have a hard time registering and insuring it in the United States because the cars have not demonstrated that they meet safety standards... But in the years to come it may be difficult to explain to consumers in the United States why they're not allowed to buy inexpensive electric vehicles that are readily available across the border, especially if they're made in Mexico, which already manufactures millions of cars for the United States. \n\nLess than 20 years ago, Chinese cars were widely seen as inferior, even by many Chinese drivers. But in recent years, the country's manufacturers have pulled even with foreign rivals in mechanical quality, analysts say, and often surpass U.S., Japanese and European carmakers in battery technology, autonomous driving and entertainment software. (Think in-car karaoke and rotating touch screens)... [T]he auto industry does not appear to have seen anything like the current wave of Chinese brands, which have quickly overtaken Japanese companies as the world's largest auto exporters. Chinese carmakers have made deep inroads in countries where they have local production or face few significant trade barriers. In Brazil, Chinese brands have a 9 percent share of car sales, up from 1 percent in 2019. In Thailand, they have 18 percent of the market, up from 5 percent in 2019, according to JATO. \nThe article notes that for the world's largest car market &mdash; China itself &mdash; General Motors just announced \"a more than $5 billion hit to its profit\" to restructure China operations that have been losing money in recent years. And the article includes this quote from Felipe Munoz, global analyst at the research firm JATO Dynamics. \n\n\"Before the pandemic, the rules were set down by the Western carmakers. Now it's the opposite.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Chinese+Electric+Cars+are+Already+Surging+in+Popularity+in+Mexico%2C+Europe%2C+Asia%2C+and+Africa%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F12%2F14%2F0534213%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F12%2F14%2F0534213%2Fchinese-electric-cars-are-already-surging-in-popularity-in-mexico-europe-asia-and-africa%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://hardware.slashdot.org/story/24/12/14/0534213/chinese-electric-cars-are-already-surging-in-popularity-in-mexico-europe-asia-and-africa?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23551399&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"How Are Artists Protecting Their Unique Styles from Imitation in AI Art?","url":"https://hackernoon.com/how-are-artists-protecting-their-unique-styles-from-imitation-in-ai-art?source=rss","date":1734199214,"author":"Torts","unread":true,"desc":"","content":"<h2 id=\"tableoflinks\">Table of Links</h2>\n<p><a href=\"http://hackernoon.com/preview/LsXcUIkIu85mmj5J2zZO\">Abstract and 1. Introduction</a></p>\n<ol start=\"2\">\n<li><p><a href=\"http://hackernoon.com/preview/ZChuKAMuEZWC2MFwFjce\">Background and Related Work</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/Ih6TEkzwEqrGeNNYhy3B\">Threat Model</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/112rIPQl4eN67oQwYH62\">Robust Style Mimicry</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/aUg0L0pkdqrIC3ZXYZrC\">Experimental Setup</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/wt8OohM7KVglziiuQ2kb\">Results</a></p>\n<p><a href=\"https://hackernoon.com/preview/BURm7nJw7qLxv0xgk9SH\">6.1 Main Findings: All Protections are Easily Circumvented</a></p>\n<p><a href=\"http://hackernoon.com/preview/qf0fmDGxkwHKNljVb9GZ\">6.2 Analysis</a> </p></li>\n<li><p><a href=\"https://hackernoon.com/preview/Nan3sap7D86JxuZKNjKs\">Discussion and Broader Impact, Acknowledgements, and References</a></p></li>\n</ol>\n<p><a href=\"http://hackernoon.com/preview/5QUQCnKdEDZaJKUesUBK\">A. Detailed Art Examples</a> </p>\n<p><a href=\"https://hackernoon.com/preview/2Dlrp82ks8JgJ7gSdQiZ\">B. Robust Mimicry Generations</a> </p>\n<p><a href=\"http://hackernoon.com/preview/rZwLkJjFYqu4gndPjwe2\">C. Detailed Results</a> </p>\n<p><a href=\"https://hackernoon.com/preview/go1iBzdzIX8LVvV3HoIi\">D. Differences with Glaze Finetuning</a> </p>\n<p><a href=\"http://hackernoon.com/preview/Upeyfrqqx0A7ATQRFasx\">E. Findings on Glaze 2.0</a> </p>\n<p><a href=\"https://hackernoon.com/preview/0pKU7964WfCUB450ktQx\">F. Findings on Mist v2</a> </p>\n<p><a href=\"http://hackernoon.com/preview/yFqpQfuJ2oaZmDbrkxpQ\">G. Methods for Style Mimicry</a> </p>\n<p><a href=\"http://hackernoon.com/preview/gwnVL3RT3X24cyDJoktq\">H. Existing Style Mimicry Protections</a> </p>\n<p><a href=\"https://hackernoon.com/preview/mIogJifKFI37iKcvSdXT\">I. Robust Mimicry Methods</a> </p>\n<p><a href=\"http://hackernoon.com/preview/qIaRQ6OxXQce90MtVt3K\">J. Experimental Setup</a> </p>\n<p><a href=\"https://hackernoon.com/preview/cwRDm1AqdaMByA8reKW7\">K. User Study</a> </p>\n<p><a href=\"http://hackernoon.com/preview/BhGyXuAxf4sRHGCuwlnw\">L. Compute Resources</a></p>\n<h2 id=\"hexistingstylemimicryprotections\">H Existing Style Mimicry Protections</h2>\n<p><strong>Naming convention.</strong> Depending on the context, style mimicry protections may be viewed either as attacks or as the targets of attacks. In an artistic setting, artists see style mimicry as an attack and utilize methods like Glaze as a defense. Conversely, in the context of adversarial robustness, Glaze can be seen as an attack against style mimicry methods through adversarial perturbations. The research community has not reached a consensus on terminology: Glaze’s authors consider style mimicry an attack and label Glaze as a defense, while the authors of Mist and Anti-DreamBooth describe their approaches as attacks. In our work, we distance ourselves from the attack/defense terminology and instead refer to these mechanisms as protections, and to the party performing mimicry as the “style forger”.</p>\n<p>\\\nExisting protections can either target the encoder or the decoder of text-to-image models. We classify them accordingly.</p>\n<h3 id=\"h1encoderprotections\">H.1 Encoder Protections</h3>\n<p><img src=\"https://cdn.hackernoon.com/images/null-s8134zz.png\" alt=\"\" /></p>\n<h3 id=\"h2denoiserprotections\">H.2 Denoiser Protections</h3>\n<p>Denoiser protections use the prediction error of the denoiser ϵθ as a proxy of the quality of style mimicry, making it a feasible target for adversarial optimization. Current Denoiser protections, such as Mist (Liang et al., 2023) and Anti-DreamBooth (Van Le et al., 2023) assume that poorly reconstructed images will fail to mimic style</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/null-kw234x2.png\" alt=\"\" /></p>\n<p>\\</p>\n<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Robert Honig, ETH Zurich (robert.hoenig@inf.ethz.ch);</p>\n<p>(2) Javier Rando, ETH Zurich (javier.rando@inf.ethz.ch);</p>\n<p>(3) Nicholas Carlini, Google DeepMind;</p>\n<p>(4) Florian Tramer, ETH Zurich (florian.tramer@inf.ethz.ch).</p>\n<p>:::</p>\n<hr />\n<p>:::info\nThis paper is <strong><a href=\"https://arxiv.org/abs/2406.12027\">available on arxiv</a></strong> under CC BY 4.0 license.</p>\n<p>:::</p>\n<p>[7] Mist project also contains a denoiser attack that we fail to reproduce as a robust protection.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Zero-shot Prompts for Logical Reasoning Tasks in Biological Pathways","url":"https://hackernoon.com/zero-shot-prompts-for-logical-reasoning-tasks-in-biological-pathways?source=rss","date":1734199217,"author":"Large Models","unread":true,"desc":"","content":"<h2 id=\"tableoflinks\">Table of Links</h2>\n<ol>\n<li><p><a href=\"http://hackernoon.com/preview/aSXPlErMbpr6a2LTxaH9\">Abstract and Introduction</a> </p></li>\n<li><p><a href=\"https://hackernoon.com/preview/MEstM5YLV40pSBnE79rn\">SylloBio-NLI</a> </p></li>\n<li><p><a href=\"https://hackernoon.com/preview/oaS9suCIHEiYxEmmMu7T\">Empirical Evaluation</a> </p></li>\n<li><p><a href=\"https://hackernoon.com/preview/dljlfhDBlWzYbwAlFWed\">Related Work</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/WP3H1CCStiBYGQdmWGRB\">Conclusions</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/3vZr4QtazoJvQ9Gx1OGS\">Limitations and References</a></p>\n<p>\\</p></li>\n</ol>\n<p><a href=\"http://hackernoon.com/preview/zmWCXL4vRhA46DKDYgUM\">A. Formalization of the SylloBio-NLI Resource Generation Process</a></p>\n<p><a href=\"http://hackernoon.com/preview/W59VxQoaIRFddzuBgXWv\">B. Formalization of Tasks 1 and 2</a></p>\n<p><a href=\"http://hackernoon.com/preview/E6xq9YUyuOPB3jIMYVgi\">C. Dictionary of gene and pathway membership</a></p>\n<p><a href=\"https://hackernoon.com/preview/zZfv6kyOiyGP5c5X4pLQ\">D. Domain-specific pipeline for creating NL instances and E Accessing LLMs</a></p>\n<p><a href=\"https://hackernoon.com/preview/fgseYuHoMrGtQZw0Cybf\">F. Experimental Details</a> </p>\n<p><a href=\"http://hackernoon.com/preview/T88hyNZd1S74exmackTl\">G. Evaluation Metrics</a></p>\n<p><a href=\"http://hackernoon.com/preview/CZQFZ6XkKskgvOBHFRYY\">H. Prompting LLMs - Zero-shot prompts</a></p>\n<p><a href=\"http://hackernoon.com/preview/eCDePTBvQklVeZ5Hghs0\">I. Prompting LLMs - Few-shot prompts</a></p>\n<p><a href=\"http://hackernoon.com/preview/oEHn454yOGJkiiM5cKH2\">J. Results: Misaligned Instruction-Response</a></p>\n<p><a href=\"http://hackernoon.com/preview/JVG0UwEHwu0TQUcleYvY\">K. Results: Ambiguous Impact of Distractors on Reasoning</a></p>\n<p><a href=\"http://hackernoon.com/preview/d4D9VdXVQwM76Axu39iE\">L. Results: Models Prioritize Contextual Knowledge Over Background Knowledge</a></p>\n<p><a href=\"http://hackernoon.com/preview/HZFLCYxM9569OJ3b6HZG\">M Supplementary Figures and N Supplementary Tables</a></p>\n<h2 id=\"hpromptingllmszeroshotprompts\">H Prompting LLMs - Zero-shot prompts</h2>\n<h3 id=\"h1task1\">H.1 TASK 1</h3>\n<p>prompt = <em>Suppose you are a specialist with existing knowledge about a signaling and metabolic molecules and their relations organized into biological pathways and processes. Given premises marked with the letter P and the following number and the conclusion marked with the letter C, determine whether the conclusion logically follows from these premises. If the conclusion logically follows from the premises, you need to return ’True’. If the conclusion does not follow logically from the premises, you need to return ’False’. The output should be a single word <True> or <False>.</em></p>\n<p>\\\n\"P1: \" + Premise 1 </p>\n<p>\\\n\"P2: \" + Premise 2 </p>\n<p>\\\n\"C:\" + Conclusion</p>\n<h3 id=\"h2task2\">H.2 TASK 2</h3>\n<p>prompt = <em>Suppose you are a specialist with existing knowledge about a signaling and metabolic molecules and their relations organized into biological pathways and processes. Given premises marked with the letter P and the following number and the conclusion marked with the letter C, determine whether the conclusion logically follows from these premises. If the conclusion logically follows from the premises, you need to return ’True’. If the conclusion does not follow logically from the premises, you need to return ’False’. Specify the premises you used to determine whether the conclusion logically follows from the premises, and only these premises. The output should be a single word <True> or <False>and the numbers of the selected premises after the decimal point, like <True, P1, P2>.</em></p>\n<p>\\\n\"P1: \" + Premise 1 </p>\n<p>\\\n\"P2: \" + Premise 2 </p>\n<p>\\\n\"C:\" + Conclusion</p>\n<p>\\</p>\n<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Magdalena Wysocka, National Biomarker Centre, CRUK-MI, Univ. of Manchester, United Kingdom;</p>\n<p>(2) Danilo S. Carvalho, National Biomarker Centre, CRUK-MI, Univ. of Manchester, United Kingdom and Department of Computer Science, Univ. of Manchester, United Kingdom;</p>\n<p>(3) Oskar Wysocki, National Biomarker Centre, CRUK-MI, Univ. of Manchester, United Kingdom and ited Kingdom 3 I;</p>\n<p>(4) Marco Valentino, Idiap Research Institute, Switzerland;</p>\n<p>(5) André Freitas, National Biomarker Centre, CRUK-MI, Univ. of Manchester, United Kingdom, Department of Computer Science, Univ. of Manchester, United Kingdom and Idiap Research Institute, Switzerland.</p>\n<p>:::</p>\n<hr />\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2410.14399\">available on arxiv</a> under CC BY-NC-SA 4.0 license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"What are AI ‘world models,’ and why do they matter?","url":"https://techcrunch.com/2024/12/14/what-are-ai-world-models-and-why-do-they-matter/","date":1734199279,"author":"Kyle Wiggers","unread":true,"desc":"","content":"<p>World models, also known as world simulators, are being touted by some as the next big thing in AI. AI pioneer Fei-Fei Li&#8217;s World Labs has raised $230 million to build &#8220;large world models,&#8221; and DeepMind hired one of the creators of OpenAI&#8217;s video generator, Sora, to work on &#8220;world simulators.&#8221; (Sora was released on [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"America's FCC Opens 6-GHz Band to Unlicensed Very-Low-Power Devices","url":"https://tech.slashdot.org/story/24/12/14/0548225/americas-fcc-opens-6-ghz-band-to-unlicensed-very-low-power-devices?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1734201240,"author":"EditorDavid","unread":true,"desc":"","content":"America's telecom-regulating Federal Communications Commission \"has opened up the entire 6 GHz frequency band to very low-power devices,\" reports the Register, \"alongside other unlicensed applications such as Wi-Fi kits.\"\n\n\n\nThe FCC said it has adopted extra rules to allow very low-power device operation across the entire 1,200 MHz of the 6 GHz band, from 5.925 to 7.125 GHz, within the US. The agency had already opened up 850 MHz of the band to small mobile devices a year ago, and has now decided to open up the remaining 350 MHz. \n\nIt hopes that this will give a shot in the arm to an ecosystem of short-range devices such as wearables, healthcare monitors, short-range mobile hotspots, and in-car devices that will be able to make use of this spectrum without the need of a license. These applications often call for low power transmission across short distances, but at very high connection speeds, the FCC says &mdash; otherwise, existing technologies like Bluetooth could suffice. \"This 1,200 MHz means unlicensed bandwidth with a mix of high capacity and low latency that is absolutely prime for immersive, real-time applications,\" said Jessica Rosenworcel, the FCC's outgoing chair. \"These are the airwaves where we can develop wearable technologies and expand access to augmented and virtual reality in ways that will provide new opportunities in education, healthcare, and entertainment.\" \n\nBecause these are such low-power devices, no restrictions have been placed on where they can be used, and they will not be required to operate under the control of an automatic frequency coordination system, as some Wi-Fi equipment must to avoid interference with existing services that use the 6 GHz spectrum. However, to minimize the risk of any potential interference, the devices will be required to implement a transmit power control mechanism and employ a contention-based protocol, requiring a device to listen to the channel before transmission. They are, however, prohibited from operating as part of any fixed outdoor infrastructure.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=America's+FCC+Opens+6-GHz+Band+to+Unlicensed+Very-Low-Power+Devices%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F14%2F0548225%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F14%2F0548225%2Famericas-fcc-opens-6-ghz-band-to-unlicensed-very-low-power-devices%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://tech.slashdot.org/story/24/12/14/0548225/americas-fcc-opens-6-ghz-band-to-unlicensed-very-low-power-devices?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23551403&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Meta asks California AG to block OpenAI’s conversion to for-profit","url":"https://techcrunch.com/2024/12/14/meta-asks-california-ag-to-block-openais-conversion-to-for-profit/","date":1734201969,"author":"Anthony Ha","unread":true,"desc":"","content":"<p>Facebook’s parent company Meta is supporting Elon Musk’s effort to block OpenAI’s conversion from a non-profit company into a for-profit one. As reported by The Wall Street Journal, Meta sent a letter to California Attorney General Rob Bonta arguing that allowing the shift would have “seismic implications for Silicon Valley.&#8221; And while the company asked [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Join Lumoz zkVerifier Node Mining and Share 2.5 Billion MOZ Rewards","url":"https://hackernoon.com/join-lumoz-zkverifier-node-mining-and-share-25-billion-moz-rewards?source=rss","date":1734203314,"author":"Lumoz (formerly Opside)","unread":true,"desc":"","content":"<p>\\\n<em>Abstract: The Lumoz Node Network and MOZ staking system officially launched on December 13, 2024, at 16:00 UTC+8. Opportunities for the community and node users to participate in the zkVerifier network and MOZ staking are now fully open. By running zkVerifier Nodes, staking MOZ, and delegating licenses, users can collectively share 25% of the total MOZ token mining rewards!</em></p>\n<p>\\\nWith the successful launch of the mainnet and completion of the TGE, Lumoz has received widespread acclaim from community members and Ethereum ecosystem users alike. To date, over one million users have checked or claimed their esMOZ airdrops, and more than 100,000 OG NFTs have been burned during the esMOZ-to-MOZ redemption process. Additionally, MOZ tokens have been listed on major exchanges, including Bybit, KuCoin, and Gate.io.</p>\n<p>\\\n<strong>Today, we are excited to announce that Lumoz’s node network is now open for registration, along with the activation of the MOZ staking system.</strong> Any user can earn substantial rewards by staking MOZ or using a Node License. According to Lumoz’s tokenomics, 25% of MOZ tokens are allocated to the zkVerifier network. Based on the latest <a href=\"https://coinmarketcap.com/currencies/lumoz/\">CoinMarketCap</a> price, the total zkVerifier rewards are valued at <strong>$90 million</strong>. Register your node and start validation services now to secure your share of these significant rewards early!</p>\n<p>Participation in zkVerifier mining is simple and efficient. Any user can easily join by staking MOZ, registering a zkVerifier License, or running a node. Whether you are a technical user or a regular investor, you can contribute to network development based on your preferences and enjoy substantial rewards.</p>\n<p>\\\n<strong>Join the zkVerifier network now:</strong> <a href=\"https://zkverifier.lumoz.org/\">https://zkverifier.lumoz.org/</a></p>\n<h2 id=\"quickoverviewofzkverifiernode\">Quick Overview of zkVerifier Node:</h2>\n<p>The Lumoz zkVerifier Node, as a key component of the Lumoz architecture, is responsible for verifying the ZKPs generated by the zkProver. It ensures the correctness and validity of proofs submitted to the chain. The zkVerifier efficiently processes proofs, reducing operational costs and gas consumption.</p>\n<p>\\</p>\n<h1 id=\"howtojoinzkverifiernodeandearnoverd250millioninmozrewards\">How to Join zkVerifier Node and Earn Over $250 Million in MOZ Rewards?</h1>\n<ul>\n<li>Stake MOZ</li>\n<li>Run zkVerifier Node</li>\n<li>Delegate zkVerifier Node License</li>\n</ul>\n<h2 id=\"stakemoz\"><strong>Stake MOZ</strong></h2>\n<p>Staking MOZ is a key step in participating in the zkVerifier Node. The network allocates mining rewards based on the amount staked and the node’s performance. The staking mechanism locks tokens to provide higher security for the network, while also incentivizing participants to hold MOZ for the long term. Users can adjust the staked amount at any time, offering flexibility in asset management. Whether you are running a node or delegating a License, staking MOZ will provide long-term rewards.</p>\n<p>\\\nStake MOZ: <a href=\"https://zkverifier.lumoz.org/staking\">https://zkverifier.lumoz.org/staking</a></p>\n<p>\\</p>\n<h2 id=\"runzkverifiernode\">Run zkVerifier Node</h2>\n<p>Running a zkVerifier Node is the direct way to become a core part of the Lumoz network's validation layer. As a node operator, you will be responsible for verifying zero-knowledge proof (ZKP) computation tasks, participating in network consensus, and receiving 25% of the total MOZ supply as a reward from network incentives. To run a zkVerifier Node, the following requirements must be met:</p>\n<p>\\</p>\n<ul>\n<li><strong>Users need to hold at least one node or node License.</strong> The License is the official recognition of zkVerifier Node status and is a necessary condition for running a zkVerifier Node.</li>\n</ul>\n<p>\\</p>\n<ul>\n<li><p><strong>Hardware Requirements</strong></p>\n<p>CPU: 2 CPU Cores, x86/X64 Processor</p>\n<p>RAM: 4 GB RAM</p>\n<p>Storage: 60 GB Disk Space</p>\n<p>Bandwidth: Stable Internet Connection</p></li>\n</ul>\n<p>\\</p>\n<ul>\n<li><p><strong>Stake esMOZ:</strong> Node operators must stake a certain amount of esMOZ tokens to ensure the stability and security of the node.</p>\n<p>Download the command-line client to run the node: [https://github.com/Lumoz-protocol/Lumoz-zkverifier-node-cli/releases/tag/mainnet-v0.0.1]()</p></li>\n</ul>\n<h2 id=\"delegatezkverifierlicense\">Delegate zkVerifier License</h2>\n<p>If you are unable to run a zkVerifier Node directly, you can choose to delegate your zkVerifier License to other node operators. This way, you don’t need to bear hardware and operational costs, yet you can still earn a share of the node rewards.</p>\n<p>\\</p>\n<ul>\n<li><p>Flexible Participation: Users without technical requirements can still join the network ecosystem by delegating and sharing the zkVerifier rewards.</p>\n<p>Delegate a node: <a href=\"https://zkverifier.lumoz.org/staking?tab=delegate\">https://zkverifier.lumoz.org/staking?tab=delegate</a></p>\n<p>\\</p></li>\n</ul>\n<p>For detailed tutorials on running nodes, delegating node licenses, and staking MOZ: <a href=\"https://docs.google.com/document/d/14_RfVBia_j_K9GE7-5AWhIqweq8Wy_ZHUyaOVvms-iU/edit?usp=sharing\">https://docs.google.com/document/d/14_RfVBia_j_K9GE7-5AWhIqweq8Wy_ZHUyaOVvms-iU/edit?usp=sharing</a></p>\n<p>\\</p>\n<h1 id=\"futureoutlook\"><strong>Future Outlook</strong></h1>\n<p>As a core component of the Lumoz network, the zkVerifier Node plays a critical role in network validation, zero-knowledge proof (ZKP) computing, and the development of a decentralized ecosystem. Users of zkVerifier Nodes will share 25% of the total MOZ token mining rewards, which is one of the most significant incentives in the Lumoz tokenomics model.</p>\n<p>\\\nLumoz’s zkVerifier Node efficiently executes ZKP computations to validate transactions and data within the network. It aligns closely with the Snarkification process of ETH 3.0, supporting Ethereum’s transaction verification in a more efficient and decentralized environment. Through this synergy, Lumoz not only enhances the technical performance of Ethereum 3.0 but also brings more participants and ecosystem collaboration opportunities to its own network.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"America Prepares New AI Chip Restrictions to Close China's Backdoor Access","url":"https://hardware.slashdot.org/story/24/12/14/1921226/america-prepares-new-ai-chip-restrictions-to-close-chinas-backdoor-access?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1734204840,"author":"EditorDavid","unread":true,"desc":"","content":"The U.S. wants to limit China's access to advanced AI chips, reports the Wall Street Journal, with new rules to restrict sales in parts of the world. \n\n\"The rules are aimed at China, but they threaten to create conflict between the U.S. and nations that may not want their purchases of chips micromanaged from Washington.\n\n\nThe latest round of curbs could come this month... Among the restrictions, the administration aims to introduce caps on shipments of AI chips to certain countries for use in large computing facilities, people familiar with the plans said. One grouping of countries &mdash; close U.S. allies &mdash; would be unrestricted, the people said, while another tier of countries would face limits on the number of chips that can go into data centers used for AI... The purchasing caps primarily apply to regions such as Southeast Asia and the Middle East, the people said... \n\nThe administration recently sent letters to major chip-makers including Taiwan Semiconductor Manufacturing and Samsung Electronics informing them about some of the restrictions, these people said. The letters said the companies needed to apply for a license to transfer chips to China that are manufactured using advanced chip-making technology or meet other criteria. These criteria include a size and transistor-number limit as well as any indication that the chips are for use in training AI models, the people said. Previous regulations already limit the shipment of advanced GPUs and memory chips to China, but the new rules spell out more clearly to manufacturers what is banned. \nU.S. officials \"are also considering other options,\" the article points out. \"The administration is considering placing controls on exports of the so-called weights that underlie advanced AI models, according to people familiar with the matter, and weighing further China-specific restrictions on chip manufacturing.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=America+Prepares+New+AI+Chip+Restrictions+to+Close+China's+Backdoor+Access%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F12%2F14%2F1921226%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F12%2F14%2F1921226%2Famerica-prepares-new-ai-chip-restrictions-to-close-chinas-backdoor-access%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://hardware.slashdot.org/story/24/12/14/1921226/america-prepares-new-ai-chip-restrictions-to-close-chinas-backdoor-access?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23551735&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Some Qualcomm CPUs Left Exposed To Spectre Vulnerabilities On Mainline Linux","url":"https://www.phoronix.com/news/Qualcomm-Spectre-Mainline-Patch","date":1734206976,"author":"Michael Larabel","unread":true,"desc":"","content":"Some Qualcomm processors/SoCs on the mainline Linux kernel are left vulnerable to Spectre security issues since Qualcomm hasn't upstreamed patches for properly treating affected CPU cores to their relevant mitigations. But a new patch series  from a Google engineer is working to get those Qualcomm CPU security mitigations in order...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Could an Undersea Hyperloop Train Tunnel Offer One-Hour Trips From London to New York?","url":"https://tech.slashdot.org/story/24/12/14/1945209/could-an-undersea-hyperloop-train-tunnel-offer-one-hour-trips-from-london-to-new-york?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1734208440,"author":"EditorDavid","unread":true,"desc":"","content":"\"Proposals for a tunnel connecting the U.K. to the U.S. underneath the Atlantic Ocean have resurfaced,\" reports Newsweek, \"but with a price tag of almost $20 trillion, the project is a big ask.\"\n\n\n\nWith the two global cities being over 3,000 miles apart, construction would take several years &mdash; the 23.5-mile Channel Tunnel linking England and France took six years to construct &mdash; and require significant investment. Estimates over the cost have reached as high as &pound;15.5 trillion, the equivalent of $19.8 trillion. \n\nHowever, developments in vacuum tube technology have made the concept more viable. By creating a vacuum within the tunnel and using pressurized vehicles, trains traveling along the structure could theoretically reach speeds of more than 3,000 mph, making the journey between London and New York barely an hour long. This is because trains would not face any air resistance within the tunnel, allowing them to reach higher speeds than unconventional trains. This design, which has seen new development in Indian transportation, is sometimes called a \"hyperloop\". Cutting the intercontinental journey down to a matter of minutes means that for the first time, the Transatlantic Tunnel justifies the hefty price tag that undersea construction comes with, as it would become significantly more efficient and environmentally friendly than flying.\n \n\nWhile no plans are underway, it's interesting to ask whether it could even be done. Weighing in, Elon Musk \"has suggested the idea of building a '&pound;20 trillion' underground tunnel link from London to New York appears to be a genuine possibility,\" according to the site LADbible, \"although he says he could do it for less.\" (On X.com Musk posted that his Boring Company \"could do it for 1000X less money.\")\nThis comes after the SpaceX boss, 53, who promises to revolutionise the way we travel, said his 'Starship' rocket could be used to transport passengers to any city in the world in under an hour.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Could+an+Undersea+Hyperloop+Train+Tunnel+Offer+One-Hour+Trips+From+London+to+New+York%3F%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F14%2F1945209%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F14%2F1945209%2Fcould-an-undersea-hyperloop-train-tunnel-offer-one-hour-trips-from-london-to-new-york%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://tech.slashdot.org/story/24/12/14/1945209/could-an-undersea-hyperloop-train-tunnel-offer-one-hour-trips-from-london-to-new-york?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23551749&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Why AI Art Protections Aren’t as Strong as They Seem","url":"https://hackernoon.com/why-ai-art-protections-arent-as-strong-as-they-seem?source=rss","date":1734210014,"author":"Torts","unread":true,"desc":"","content":"<h2 id=\"tableoflinks\">Table of Links</h2>\n<p><a href=\"http://hackernoon.com/preview/LsXcUIkIu85mmj5J2zZO\">Abstract and 1. Introduction</a></p>\n<ol start=\"2\">\n<li><p><a href=\"http://hackernoon.com/preview/ZChuKAMuEZWC2MFwFjce\">Background and Related Work</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/Ih6TEkzwEqrGeNNYhy3B\">Threat Model</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/112rIPQl4eN67oQwYH62\">Robust Style Mimicry</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/aUg0L0pkdqrIC3ZXYZrC\">Experimental Setup</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/wt8OohM7KVglziiuQ2kb\">Results</a></p>\n<p><a href=\"https://hackernoon.com/preview/BURm7nJw7qLxv0xgk9SH\">6.1 Main Findings: All Protections are Easily Circumvented</a></p>\n<p><a href=\"http://hackernoon.com/preview/qf0fmDGxkwHKNljVb9GZ\">6.2 Analysis</a> </p></li>\n<li><p><a href=\"https://hackernoon.com/preview/Nan3sap7D86JxuZKNjKs\">Discussion and Broader Impact, Acknowledgements, and References</a></p></li>\n</ol>\n<p><a href=\"http://hackernoon.com/preview/5QUQCnKdEDZaJKUesUBK\">A. Detailed Art Examples</a> </p>\n<p><a href=\"https://hackernoon.com/preview/2Dlrp82ks8JgJ7gSdQiZ\">B. Robust Mimicry Generations</a> </p>\n<p><a href=\"http://hackernoon.com/preview/rZwLkJjFYqu4gndPjwe2\">C. Detailed Results</a> </p>\n<p><a href=\"https://hackernoon.com/preview/go1iBzdzIX8LVvV3HoIi\">D. Differences with Glaze Finetuning</a> </p>\n<p><a href=\"http://hackernoon.com/preview/Upeyfrqqx0A7ATQRFasx\">E. Findings on Glaze 2.0</a> </p>\n<p><a href=\"https://hackernoon.com/preview/0pKU7964WfCUB450ktQx\">F. Findings on Mist v2</a> </p>\n<p><a href=\"http://hackernoon.com/preview/yFqpQfuJ2oaZmDbrkxpQ\">G. Methods for Style Mimicry</a> </p>\n<p><a href=\"http://hackernoon.com/preview/gwnVL3RT3X24cyDJoktq\">H. Existing Style Mimicry Protections</a> </p>\n<p><a href=\"https://hackernoon.com/preview/mIogJifKFI37iKcvSdXT\">I. Robust Mimicry Methods</a> </p>\n<p><a href=\"http://hackernoon.com/preview/qIaRQ6OxXQce90MtVt3K\">J. Experimental Setup</a> </p>\n<p><a href=\"https://hackernoon.com/preview/cwRDm1AqdaMByA8reKW7\">K. User Study</a> </p>\n<p><a href=\"http://hackernoon.com/preview/BhGyXuAxf4sRHGCuwlnw\">L. Compute Resources</a></p>\n<h2 id=\"irobustmimicrymethods\">I Robust Mimicry Methods</h2>\n<p>This section details the robust mimicry methods we use in our work. These methods are not aimed at maximizing performance. Instead, they demonstrate how various ”off-the-shelf” and low-effort techniques can significantly weaken style mimicry protections.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-9n034uk.png\" alt=\"\" /></p>\n<h3 id=\"i1diffpure\">I.1 DiffPure</h3>\n<p><img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-hv134zn.png\" alt=\"\" /></p>\n<p>\\\nIf the text-to-image model M supports unconditional image generation, then we can use model M for the reverse diffusion process. For example, Stable Diffusion (Rombach et al., 2022) generates images unconditionally when the prompt P equals the empty string. Under these conditions, Img2Img is equivalent to DiffPure. Therefore, in the context of defenses for style mimicry, we refer to Img2Img applied with an empty prompt P as unconditional DiffPure, and to Img2Img applied with a non-empty prompt P as conditional DiffPure.</p>\n<h3 id=\"i2noisyupscaling\">I.2 Noisy Upscaling</h3>\n<p>Upscaling increases the resolution of an image by predicting new pixels that enhance the level of detail. Upscaling images can purify adversarially perturbed images (Mustafa et al., 2019). However, we discover that applying upscaling directly on protected images fails to remove the perturbations.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-gm234bl.png\" alt=\"\" /></p>\n<p>\\\nSecond, we note that upscaling has shown success against adversarial perturbations for classifiers (Mustafa et al., 2019), but not against adversarial perturbations for generative models (Liang et al., 2023; Shan et al., 2023a).</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-z8334xs.png\" alt=\"Figure 26: Illustration of Noisy Upscaling on a random image from @nulevoy. Unlike naive upscaling and Compressed Upscaling, Noisy Upscaling removes protections while preserving the details in the original artwork.\" /></p>\n<h3 id=\"i3impress\">I.3 IMPRESS++</h3>\n<p>We enhance the IMPRESS algorithm (Cao et al., 2024). We change the loss of the reverse encoding optimization from patch similarity to l∞ and include two additional steps: negative prompting and post-processing. All in all, IMPRESS++ first preprocesses protected images with Gaussian noise and reverse encoder optimization, then samples using negative prompting and finally post-processes the generated images with DiffPure to remove noise.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-ij434d3.png\" alt=\"\" /></p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-ad534qn.png\" alt=\"\" /></p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-49634yv.png\" alt=\"\" /></p>\n<p>\\\nFigure 27 illustrates the improvements introduced by each additional step.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-jd734e5.png\" alt=\"Figure 27: Improvements of each additional step in IMPRESS++ over the original IMPRESS (Cao et al., 2024). Negative prompting improves image consistency and denoising reduces artifacts in generated images.\" /></p>\n<p>\\</p>\n<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Robert Honig, ETH Zurich (robert.hoenig@inf.ethz.ch);</p>\n<p>(2) Javier Rando, ETH Zurich (javier.rando@inf.ethz.ch);</p>\n<p>(3) Nicholas Carlini, Google DeepMind;</p>\n<p>(4) Florian Tramer, ETH Zurich (florian.tramer@inf.ethz.ch).</p>\n<p>:::</p>\n<hr />\n<p>:::info\nThis paper is <strong><a href=\"https://arxiv.org/abs/2406.12027\">available on arxiv</a></strong> under CC BY 4.0 license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"GM ‘blindsides’ Cruise by giving up on robotaxis","url":"https://techcrunch.com/2024/12/14/gm-blindsides-cruise-by-giving-up-on-robotaxis/","date":1734211020,"author":"Cody Corrall","unread":true,"desc":"","content":"<p>Welcome back to Week in Review. This week, we’re looking at GM’s decision to pull out of the robotaxi business, Google alluding to the existence of multiple universes, and how you can make some serious cash by getting an AI bot to fall in love with you. Let’s get into it. General Motors will no [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Raspberry Pi Announces New $90 Computer in a Keyboard, Plus 'Raspberry Pi Monitor'","url":"https://build.slashdot.org/story/24/12/14/2044250/raspberry-pi-announces-new-90-computer-in-a-keyboard-plus-raspberry-pi-monitor?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1734212040,"author":"EditorDavid","unread":true,"desc":"","content":"\"Single-board computer maker Raspberry Pi is updating its cute little computer-meet-keyboard device with better specifications...\" reports TechCrunch. \n\nThey call the new $90 Raspberry Pi 500 \"not as intimidating\" because \"when you look at the Raspberry Pi 500, you can't see any chipsets or printed circuit board... The idea with the Raspberry Pi 500 is that you can plug in a mouse and display, and you're ready to hit the ground running.\"\nWhen it comes to specifications, the Raspberry Pi 500 features a 64-bit quad-core Arm processor (the same one as the Raspberry Pi 5 uses); 8GB of RAM; 2 micro-HDMI ports, with support for up to two 4K displays; 3 traditional USB ports (but no USB-C besides the power port unfortunately); a Gigabit Ethernet port; and a 40-pin expansion header. It comes with native Wi-Fi and Bluetooth support. \n\nMore importantly, this device brings us back Raspberry Pi's roots. Raspberry Pi computers were originally intended for educational use cases... The Raspberry Pi 500 draws inspiration from the not-for-profit Raspberry Pi Foundation's roots. It's the perfect first computer for school. In many ways, it's much better than a Chromebook or an iPad because it is both cheap and highly customizable &mdash; encouraging creative thinking. The Raspberry Pi 500 comes with a 32GB SD card preloaded with Raspberry Pi OS, a Debian-based Linux distribution... \n\n\nIn other news, Raspberry Pi has announced another brand-new product: the Raspberry Pi Monitor. It's a 15.6-inch 1080p monitor with a price-tag of $100.\n \n\nTom's Hardware calls the Pi 500 \"a superb update\" to the original computer-in-a-keyboard Raspberry Pi 400:\n\nHaving the ports at the back makes total sense. It tidies up the cables, and means that we only need one thick edge, the rest can be as thin as possible... [P]assive cooling performance is remarkable, even when overclocked to 3 GHz...! I did have to adjust the voltage to keep everything stable, but once I found the magic numbers, the system was stable and performed remarkably well... [I]t ran buttery smooth and surprisingly, cool under stress. I'd consider this a successful overclock and one that I would happily keep as a permanent addition... \nJust like the Raspberry Pi 400, the Pi 500 is there to be a 21st century equivalent to the home computers of the 1980s. You plug in to a wedge-shaped keyboard, hook up to your display, and start work. But the Raspberry Pi 500 has much more processing power than the Pi 400, and that means it can be a viable desktop computer for those that don't need an RTX 4090 or a power-hungry CPU. \n\nI like the Raspberry Pi 500. It's a powerful machine, in a pleasant package. I'm old enough to remember the 1980s home computer craze, and this, just like the Pi 400, reminds me of that time. But now we have much more power... The Raspberry Pi 500 is the kit that you buy as a gift for someone, or as a child's first computer. I can see this being used in schools and to an extent in offices around the world.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Raspberry+Pi+Announces+New+%2490+Computer+in+a+Keyboard%2C+Plus+'Raspberry+Pi+Monitor'%3A+https%3A%2F%2Fbuild.slashdot.org%2Fstory%2F24%2F12%2F14%2F2044250%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fbuild.slashdot.org%2Fstory%2F24%2F12%2F14%2F2044250%2Fraspberry-pi-announces-new-90-computer-in-a-keyboard-plus-raspberry-pi-monitor%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://build.slashdot.org/story/24/12/14/2044250/raspberry-pi-announces-new-90-computer-in-a-keyboard-plus-raspberry-pi-monitor?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23551789&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Linux 6.6.66 LTS Kernel Released With New Hardware Support & Many Fixes","url":"https://www.phoronix.com/news/Linux-6.6.66-LTS-Released","date":1734214548,"author":"Michael Larabel","unread":true,"desc":"","content":"Linux 6.6.66 was released today alongside other updated Long Term Support (LTS) kernel versions...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Donald Bitzer, a Pioneer of Cyberspace and Plasma Screens, Dies At 90","url":"https://hardware.slashdot.org/story/24/12/14/2128209/donald-bitzer-a-pioneer-of-cyberspace-and-plasma-screens-dies-at-90?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1734215640,"author":"EditorDavid","unread":true,"desc":"","content":"The Washington Post reports:\n\nYears before the internet was created and the first smartphones buzzed to life, an educational platform called PLATO offered a glimpse of the digital world to come. Launched in 1960 at the University of Illinois at Urbana-Champaign [UIUC], it was the first generalized, computer-based instructional system, and grew into a home for early message boards, emails, chatrooms, instant messaging and multiplayer video games.\n\n The platform's developer, Donald Bitzer, was a handball-playing, magic-loving electrical engineer who opened his computer lab to practically everyone, welcoming contributions from Illinois undergrads as well as teenagers who were still in high school. Dr. Bitzer, who died Dec. 10 at age 90, spent more than two decades working on PLATO, managing its growth and development while also pioneering digital technologies that included the plasma display panel, a forerunner of the ultrathin screens used on today's TVs and tablets. \"All of the features you see kids using now, like discussion boards or forums and blogs, started with PLATO,\" he said during a 2014 return to Illinois, his alma mater. \"All of the social networking we take for granted actually started as an educational tool.\" \n\nLong-time Slashdot reader theodp found another remembrance online. \"Ray Ozzie, whose LinkedIn profile dedicates more space to describing his work as a PLATO developer as a UIUC undergrad than it does to his later successes as a creator of Lotus Notes and as Microsoft's Chief Software Architect, offers his own heartfelt mini-obit.\" Ozzie writes:\n\nIt's difficult to adequately convey how much impact he had on so many, and I implore you to take a few minutes to honor him by reading a bit about him and his contributions. Links below. As an insecure young CS student at UIUC in 1974, Paul Tenczar, working for/with Don, graciously gave me a chance as a jr. systems programmer on the mind-bogglingly forward thinking system known as PLATO. A global, interactive system for learning, collaboration, and community like no other at the time. We were young and in awe of how Don led, inspired, and managed to keep the project alive. I was introverted; shaking; stage fright. Yeah I could code. But how could such a deeply technical engineer assemble such a strong team to execute on such a totally novel and inspirational vision, secure government funding, and yet also demo the product on the Phil Donahue show? \n\n\"Here's to the crazy ones. The misfits. The rebels. The troublemakers. The ones who see things differently. They're not fond of rules.\" You touched so many of us and shaped who we became and the risks we would take, having an impact well beyond that which you created. You made us think and you made us laugh. I hope we made you proud.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Donald+Bitzer%2C+a+Pioneer+of+Cyberspace+and+Plasma+Screens%2C+Dies+At+90%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F12%2F14%2F2128209%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F12%2F14%2F2128209%2Fdonald-bitzer-a-pioneer-of-cyberspace-and-plasma-screens-dies-at-90%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://hardware.slashdot.org/story/24/12/14/2128209/donald-bitzer-a-pioneer-of-cyberspace-and-plasma-screens-dies-at-90?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23551813&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Rhode Island says personal data likely breached in social services cyberattack","url":"https://techcrunch.com/2024/12/14/rhode-island-says-personal-data-likely-breached-in-social-services-cyberattack/","date":1734218268,"author":"Anthony Ha","unread":true,"desc":"","content":"<p>State officials said hundreds of thousands of Rhode Island residents could be affected by a cyberattack on the state’s online portal for social services, with a “high probability” that&#160; personally identifiable information was breached. According to an update from Governor Dan McKee’s office, the attack targeted RIBridges, which Rhode Island residents use to apply for [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Waymo Robotaxis Pass Emergency Vehicle Review. But One Got Stuck in a Roundabout","url":"https://tech.slashdot.org/story/24/12/14/0640258/waymo-robotaxis-pass-emergency-vehicle-review-but-one-got-stuck-in-a-roundabout?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1734219240,"author":"EditorDavid","unread":true,"desc":"","content":"An anonymous reader shared this report from The Verge:\n\nWaymo's driverless vehicles can detect emergency vehicles, know how to respond to hand signals for traffic cops, and can be disabled manually when something goes wrong, according to an independent review of the company's first responder protocols. As such, the Alphabet company's first responder protocols passed an independent review conducted by T&uuml;v S&uuml;d, a German tech inspection company. The firm's assessment found that Waymo's First Responder Program \"meets industry standards\" for responding to emergency situations, which is in line with the best practices set out in the Society of Automotive Engineers (SAE)... \n\nWaymo is staking out the position that it goes beyond what's required to prove that its vehicles are trustworthy... The company has also publicly released its own guide for first responders who are responding to incidents involving autonomous vehicles. The 32-page document includes a toll free number for getting in touch with remote operators, a visual guide for disabling the vehicle's autonomous mode, and instructions for how to disconnect the high-voltage battery. Waymo also hosts training sessions for police and fire officials in the cities in which it operates. The company says it has trained 15,000 first responders from over 75 agencies.\n \n\nGizmodo notes that Waymo's self-driving cars are already live for paying customers in San Francisco, Los Angeles, and Austin, \"with deployment in Miami coming soon.\"\n\nBut Waymo's self-driving cars still attract some mockery online, reports TechCrunch:\n A video is circulating on social media showing a Waymo robotaxi going round and round on a roundabout &mdash; as if it is stuck in a loop. A Waymo spokesperson told TechCrunch there were no passengers onboard the vehicle in the video and said the company has already addressed the issue by deploying a software update to its fleet.\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Waymo+Robotaxis+Pass+Emergency+Vehicle+Review.++But+One+Got+Stuck+in+a+Roundabout%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F14%2F0640258%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F14%2F0640258%2Fwaymo-robotaxis-pass-emergency-vehicle-review-but-one-got-stuck-in-a-roundabout%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://tech.slashdot.org/story/24/12/14/0640258/waymo-robotaxis-pass-emergency-vehicle-review-but-one-got-stuck-in-a-roundabout?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23551417&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Was the US Telecom Breach Inevitable, Proving Backdoors Can't Be Secure?","url":"https://it.slashdot.org/story/24/12/15/0023237/was-the-us-telecom-breach-inevitable-proving-backdoors-cant-be-secure?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1734230040,"author":"EditorDavid","unread":true,"desc":"","content":"America's 1994 \"Communications Assistance for Law Enforcement Act\" (or CALEA) created the security hole that helped enable a massive telecomm breach. But now America's FBI \"is falling back on the same warmed-over, bad advice about encryption that it has trotted out for years,\" argues the Intercept:\n\nIn response to the Salt Typhoon hack, attributed to state-backed hackers from China, the bureau is touting the long-debunked idea that federal agents could access U.S. communications without opening the door to foreign hackers. Critics say the FBI's idea, which it calls \"responsibly managed encryption,\" is nothing more than a rebranding of a government backdoor. \"It's not this huge about-face by law enforcement,\" said Andrew Crocker, the surveillance litigation director at the Electronic Frontier Foundation. \"It's just the same, illogical talking points they have had for 30+ years, where they say, 'Encryption is OK, but we need to be able to access communications.' That is a circle that cannot be squared....\" \n\nIn a blog post last month, encryption expert Susan Landau said CALEA had long been a \"national security disaster waiting to happen... If you build a system so that it is easy to break into, people will do so &mdash; both the good guys and the bad. That's the inevitable consequence of CALEA, one we warned would come to pass &mdash; and it did,\" she said... \n\nSean Vitka, the policy director at the progressive group Demand Progress, said the hack has once again provided damning evidence that government backdoors cannot be secured. \"If the FBI cannot keep their wiretap system safe, they absolutely cannot keep the skeleton key to all Apple phones safe,\" Vitka said. \n\nThanks to Slashdot reader mspohr for sharing the article.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Was+the+US+Telecom+Breach+Inevitable%2C+Proving+Backdoors+Can't+Be+Secure%3F%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F12%2F15%2F0023237%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F12%2F15%2F0023237%2Fwas-the-us-telecom-breach-inevitable-proving-backdoors-cant-be-secure%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://it.slashdot.org/story/24/12/15/0023237/was-the-us-telecom-breach-inevitable-proving-backdoors-cant-be-secure?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23551929&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Why a Bacteria Can Withstand Radiation Which Would Kill a Human","url":"https://science.slashdot.org/story/24/12/15/0142225/why-a-bacteria-can-withstand-radiation-which-would-kill-a-human?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1734237240,"author":"EditorDavid","unread":true,"desc":"","content":"Long-time Slashdot reader smooth wombat writes: Scientist have unlocked the secret to a bacteria dubbed 'Conan the Bacterium' which is listed in the Guinness Book of World Records as the most radiant-resistant life-form. Deinococcus radiodurans can withstand radiation doses 28,000 times greater than that which would kill a human [and every other organism]. In addition, this bacteria can survive on the outside of the International Space Station for three years. It can also withstand acid, cold, and dehydration (a D&amp;D player's worst nightmare). All of this protection comes down to a unique antioxidant. The antioxidant is formed by a simple group of small molecules called metabolites, including manganese, phosphate and a small peptide, or molecule, of amino acids. \n\n\nCNN reports:\n\n\nThe antioxidant is formed by a simple group of small molecules called metabolites, including manganese, phosphate and a small peptide, or molecule, of amino acids. Together, this powerful trilogy is more effective in protecting against radiation than manganese combined with just one of the other components, according to a new study published Monday in the Proceedings of the National Academy of Sciences. \n\nThe findings could be used to protect astronauts from high doses of cosmic radiation on future deep-space missions across our solar system, according to the study authors. \n\n&#226;oeWe&#226;(TM)ve long known that manganese ions and phosphate together make a strong antioxidant, but discovering and understanding the &#226;magic&#226;(TM) potency provided by the addition of the third component is a breakthrough,\" said study coauthor Brian Hoffman, the Charles E. and Emma H. Morrison Professor of Chemistry and professor of molecular biosciences at Northwestern University&#226;(TM)s Weinberg College of Arts and Sciences, in a statement... \nOn Earth, the antioxidant could be used for protection against accidents that release radiation.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Why+a+Bacteria+Can+Withstand+Radiation+Which+Would+Kill+a+Human%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F12%2F15%2F0142225%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F12%2F15%2F0142225%2Fwhy-a-bacteria-can-withstand-radiation-which-would-kill-a-human%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://science.slashdot.org/story/24/12/15/0142225/why-a-bacteria-can-withstand-radiation-which-would-kill-a-human?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23551973&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The TechBeat: Clapper Expands to Mexico, Betting Big on Authenticity and Creator Empowerment (12/15/2024)","url":"https://hackernoon.com/12-15-2024-techbeat?source=rss","date":1734246652,"author":"Techbeat","unread":true,"desc":"","content":"<p>How are you, hacker? \n 🪐<strong>Want to know what's trending right now?:</strong>\n <a href=\"https://hackernoon.com/homepage-has-a-new-baby\">The Techbeat by HackerNoon </a> has got you covered with fresh content from our trending stories of the day! Set email preference <a href=\"https://app.hackernoon.com/profile/email-settings\">here</a>.\n ## <strong><a href=\"https://hackernoon.com/clapper-expands-to-mexico-betting-big-on-authenticity-and-creator-empowerment\">Clapper Expands to Mexico, Betting Big on Authenticity and Creator Empowerment</a></strong> <img src=\"https://cdn.hackernoon.com/images/gcoNMczFrmejSE031VcfDOwm11X2-iq035ax.webp\" alt=\"\" />\n By <a href=\"https://hackernoon.com/u/clapper\">@clapper</a> [ 3 Min read ] \n Positioned as a sanctuary for authentic self-expression and creativity, Clapper’s foray into the Mexican market highlights the platform's growing clout. <a href=\"https://hackernoon.com/clapper-expands-to-mexico-betting-big-on-authenticity-and-creator-empowerment\">Read More.</a></p>\n<h2 id=\"lumozprotocolmainnetlaunchmoztokensandnodeclaimsnowopenhttpshackernooncomlumozprotocolmainnetlaunchmoztokensandnodeclaimsnowopenhttpscdnhackernooncomimageswls6ttjolgmbl8akwqlibcyfjqf21143y7epng\"><strong><a href=\"https://hackernoon.com/lumoz-protocol-mainnet-launch-moz-tokens-and-node-claims-now-open\">Lumoz Protocol Mainnet Launch: MOZ Tokens and Node Claims Now Open!</a></strong> <img src=\"https://cdn.hackernoon.com/images/Wls6TtjOLGMbl8aKwQlIbcyfjQF2-1143y7e.png\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/lumoz\">@lumoz</a> [ 4 Min read ] \n Today, we are proud to announce the official launch of the Lumoz Protocol mainnet!  <a href=\"https://hackernoon.com/lumoz-protocol-mainnet-launch-moz-tokens-and-node-claims-now-open\">Read More.</a></p>\n<h2 id=\"strengtheningcybersecuritybreakingdownindrivesbugbountyprogramhttpshackernooncomstrengtheningcybersecuritybreakingdownindrivesbugbountyprogramhttpscdnhackernooncomimages6wbo18yskkbatyblecagy9tmyol2k103dukpng\"><strong><a href=\"https://hackernoon.com/strengthening-cybersecurity-breaking-down-indrives-bug-bounty-program\">Strengthening Cybersecurity: Breaking Down inDrive’s Bug Bounty Program</a></strong> <img src=\"https://cdn.hackernoon.com/images/6WbO18ySKKbatYbleCAgy9Tmyol2-k103duk.png\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/indrivetech\">@indrivetech</a> [ 6 Min read ] \n Learn how inDrive's bug bounty program strengthens cybersecurity by collaborating with white hat hackers to detect vulnerabilities and optimize security process <a href=\"https://hackernoon.com/strengthening-cybersecurity-breaking-down-indrives-bug-bounty-program\">Read More.</a></p>\n<h2 id=\"whydoeseth30needlumozszkcomputingnetworkhttpshackernooncomwhydoeseth30needlumozszkcomputingnetworkhttpscdnhackernooncomimageswls6ttjolgmbl8akwqlibcyfjqf2sl33y13jpeg\"><strong><a href=\"https://hackernoon.com/why-does-eth-30-need-lumozs-zk-computing-network\">Why Does ETH 3.0 Need Lumoz's ZK Computing Network? </a></strong> <img src=\"https://cdn.hackernoon.com/images/Wls6TtjOLGMbl8aKwQlIbcyfjQF2-sl33y13.jpeg\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/lumoz\">@lumoz</a> [ 5 Min read ] \n Find out why ETH 3.0 needs Lumoz's Computing Network. <a href=\"https://hackernoon.com/why-does-eth-30-need-lumozs-zk-computing-network\">Read More.</a></p>\n<h2 id=\"developingapatientfriendlyehrplatformahealthcarecasestudybymarutitechlabshttpshackernooncomdevelopingapatientfriendlyehrplatformahealthcarecasestudybymarutitechlabshttpscdnhackernooncomimagesjt8poynxqmyp92waux1nylvf9im1zq0377fwebp\"><strong><a href=\"https://hackernoon.com/developing-a-patient-friendly-ehr-platform-a-healthcare-case-study-by-maruti-techlabs\">Developing a Patient-Friendly EHR Platform: A Healthcare Case Study by Maruti Techlabs</a></strong> <img src=\"https://cdn.hackernoon.com/images/JT8PoynXQmYP92waUX1nYlVf9Im1-zq0377f.webp\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/marutitechlabs\">@marutitechlabs</a> [ 7 Min read ] \n Here's how Maruti Techlabs digitized the entire patient journey for a client, from appointment booking to virtual doctor consultations to doorstep medicine deli <a href=\"https://hackernoon.com/developing-a-patient-friendly-ehr-platform-a-healthcare-case-study-by-maruti-techlabs\">Read More.</a></p>\n<h2 id=\"depinonethereumredefiningcoordinationsystemshttpshackernooncomdepinonethereumredefiningcoordinationsystemshttpscdnhackernooncomimageswsqjfcsxoxwphtnq7snevvhdwgu1eg036olpng\"><strong><a href=\"https://hackernoon.com/depin-on-ethereum-redefining-coordination-systems\">DePIN On Ethereum: Redefining Coordination Systems</a></strong> <img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-eg036ol.png\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/2077research\">@2077research</a> [ 26 Min read ] \n DePIN brings Ethereum's global coordination to the physical world. Learn how Ethereum DePIN networks solve problems across energy, telecom, compute, and more. <a href=\"https://hackernoon.com/depin-on-ethereum-redefining-coordination-systems\">Read More.</a></p>\n<h2 id=\"redditthreadshedslightoncompaniestryingtoreplicatemicrostrategysappetiteforbitcoinhttpshackernooncomredditthreadshedslightoncompaniestryingtoreplicatemicrostrategysappetiteforbitcoinhttpscdnhackernooncomimages2jqchkrv03exbugklrdzibfm99q23w02spjjpeg\"><strong><a href=\"https://hackernoon.com/reddit-thread-sheds-light-on-companies-trying-to-replicate-microstrategys-appetite-for-bitcoin\">Reddit Thread Sheds Light on Companies Trying to Replicate MicroStrategy’s Appetite for Bitcoin</a></strong> <img src=\"https://cdn.hackernoon.com/images/2jqChkrv03exBUgkLrDzIbfM99q2-3w02spj.jpeg\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/sergeigorshunov\">@sergeigorshunov</a> [ 3 Min read ] \n MicroStrate’s stock has risen fivefold in 2024 as it has been steadily buying BTC. Many investors would like to replicate the success. But are there really any? <a href=\"https://hackernoon.com/reddit-thread-sheds-light-on-companies-trying-to-replicate-microstrategys-appetite-for-bitcoin\">Read More.</a></p>\n<h2 id=\"denovsoraclewhoreallyownsjavascripthttpshackernooncomdenovsoraclewhoreallyownsjavascripthttpscdnhackernooncomimagesszrhcskt6vb1juurwxmb3x2goqu23s434wfpng\"><strong><a href=\"https://hackernoon.com/deno-vs-oracle-who-really-owns-javascript\">Deno vs Oracle: Who Really Owns JavaScript?</a></strong> <img src=\"https://cdn.hackernoon.com/images/szRhcSkT6Vb1JUUrwXMB3X2GOqu2-3s434wf.png\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/abrahamdahunsi\">@abrahamdahunsi</a> [ 6 Min read ] \n Deno battles Oracle over JavaScript’s trademark. A fight for open-source freedom with massive stakes for the web's future. <a href=\"https://hackernoon.com/deno-vs-oracle-who-really-owns-javascript\">Read More.</a></p>\n<h2 id=\"hawktuahthemoonorprisonhalieywelchmightbeinbigtroublehttpshackernooncomhawktuahthemoonorprisonhalieywelchmightbeinbigtroublehttpscdnhackernooncomimagesarustyspaceshiptryingtomakeittothemoonwaterpainta38e18i0q4hg7ps4kn13v95gpng\"><strong><a href=\"https://hackernoon.com/hawk-tuah-the-moon-or-prison-haliey-welch-might-be-in-big-trouble\">Hawk Tuah the Moon or Prison: Haliey Welch Might Be in Big Trouble</a></strong> <img src=\"https://cdn.hackernoon.com/images/a-rusty-spaceship-trying-to-make-it-to-the-moon-waterpaint-a38e18i0q4hg7ps4kn13v95g.png\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/ani-alexander\">@ani-alexander</a> [ 6 Min read ] \n The story started about 5 months ago, when one of those random street interview videos went viral… <a href=\"https://hackernoon.com/hawk-tuah-the-moon-or-prison-haliey-welch-might-be-in-big-trouble\">Read More.</a></p>\n<h2 id=\"thetoptenopensourceboilerplatesof2024httpshackernooncomthetoptenopensourceboilerplatesof2024httpscdnhackernooncomimagesn0enud29udnjcfcl7gnmzhdk2fa2ay039uzpng\"><strong><a href=\"https://hackernoon.com/the-top-ten-open-source-boilerplates-of-2024\">The Top Ten Open Source Boilerplates of 2024</a></strong> <img src=\"https://cdn.hackernoon.com/images/N0ENUd29UdNJCFcl7GnmZHdk2fA2-ay039uz.png\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/sadekirfan3\">@sadekirfan3</a> [ 2 Min read ] \n A curated list of open source boilerplates to kickstart you next project in react, nextjs, nodejs, mobile development, backend frameworks, and more. <a href=\"https://hackernoon.com/the-top-ten-open-source-boilerplates-of-2024\">Read More.</a></p>\n<h2 id=\"everyreasonyoushouldbegettingstartedwithnetaspirehttpshackernooncomeveryreasonyoushouldbegettingstartedwithnetaspirehttpscdnhackernooncomimages2jqchkrv03exbugklrdzibfm99q2mm02st5png\"><strong><a href=\"https://hackernoon.com/every-reason-you-should-be-getting-started-with-net-aspire\">Every Reason You Should be Getting Started With .Net Aspire</a></strong> <img src=\"https://cdn.hackernoon.com/images/2jqChkrv03exBUgkLrDzIbfM99q2-mm02st5.png\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/funkysi1701\">@funkysi1701</a> [ 6 Min read ] \n .Net Aspire is a comprehensive set of tools, templates, and packages designed to simplify the development of cloud-native applications using .Net. <a href=\"https://hackernoon.com/every-reason-you-should-be-getting-started-with-net-aspire\">Read More.</a></p>\n<h2 id=\"oneofftoonedataplatformdesigningdataplatformswithscalableintentpart2httpshackernooncomoneofftoonedataplatformdesigningdataplatformswithscalableintentpart2httpscdnhackernooncomimagesabunchofnumbersscatteratopascalefeq88iyfk6zyzps54hweff9ppng\"><strong><a href=\"https://hackernoon.com/one-off-to-one-data-platform-designing-data-platforms-with-scalable-intent-part-2\">One Off to One Data Platform: Designing Data Platforms with Scalable Intent [Part 2] </a></strong> <img src=\"https://cdn.hackernoon.com/images/a-bunch-of-numbers-scatter-atop-a-scale-feq88iyfk6zyzps54hweff9p.png\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/luluc\">@luluc</a> [ 5 Min read ] \n Introducing a data platform architecture framework that enables organizations to systematically design and implement scalable data platform. <a href=\"https://hackernoon.com/one-off-to-one-data-platform-designing-data-platforms-with-scalable-intent-part-2\">Read More.</a></p>\n<h2 id=\"ridingthewavemyjourneyfromvscodetowindsurfhttpshackernooncomridingthewavemyjourneyfromvscodetowindsurfhttpscdnhackernooncomimages2jqchkrv03exbugklrdzibfm99q2wf02paqpng\"><strong><a href=\"https://hackernoon.com/riding-the-wave-my-journey-from-vscode-to-windsurf\">Riding the Wave: My Journey from VSCode to Windsurf</a></strong> <img src=\"https://cdn.hackernoon.com/images/2jqChkrv03exBUgkLrDzIbfM99q2-wf02paq.png\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/edwinliavaa\">@edwinliavaa</a> [ 3 Min read ] \n As a developer who has spent countless hours in VSCode, I wasn't actively looking for a change. But sometimes change finds you. <a href=\"https://hackernoon.com/riding-the-wave-my-journey-from-vscode-to-windsurf\">Read More.</a></p>\n<h2 id=\"microsoftresearcherssaynewaimodelcanseeyourphonescreenhttpshackernooncommicrosoftresearcherssaynewaimodelcanseeyourphonescreenhttpscdnhackernooncomimages2jqchkrv03exbugklrdzibfm99q2h222sfgjpeg\"><strong><a href=\"https://hackernoon.com/microsoft-researchers-say-new-ai-model-can-see-your-phone-screen\">Microsoft Researchers Say New AI Model Can 'See' Your Phone Screen</a></strong> <img src=\"https://cdn.hackernoon.com/images/2jqChkrv03exBUgkLrDzIbfM99q2-h222sfg.jpeg\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/fewshot\">@fewshot</a> [ 5 Min read ] \n Researchers at Microsoft and University of California San Diego have developed an AI model capable of navigating your smartphone screen. <a href=\"https://hackernoon.com/microsoft-researchers-say-new-ai-model-can-see-your-phone-screen\">Read More.</a></p>\n<h2 id=\"teachingkidsaboutbitcoincanensureitslegacygoesonhttpshackernooncomteachingkidsaboutbitcoincanensureitslegacygoesonhttpscdnhackernooncomimagesehuyzrllaubgargtd43keixtots2zn03673webp\"><strong><a href=\"https://hackernoon.com/teaching-kids-about-bitcoin-can-ensure-its-legacy-goes-on\">Teaching Kids About Bitcoin Can Ensure Its Legacy Goes On</a></strong> <img src=\"https://cdn.hackernoon.com/images/EHUYZRLLAUbgArGtd43kEIxTOTS2-zn03673.webp\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/maken8\">@maken8</a> [ 5 Min read ] \n Bitcoin is the biggest mathematical and technological invention of this century.\nAnd the best way to carry it forward is to teach its foundations to our kids. <a href=\"https://hackernoon.com/teaching-kids-about-bitcoin-can-ensure-its-legacy-goes-on\">Read More.</a></p>\n<h2 id=\"howvectorsearchcracksthecodeoncontractanalyticshttpshackernooncomhowvectorsearchcracksthecodeoncontractanalyticshttpscdnhackernooncomimagesqiqzyjn6lvardmvgsbd9gxt8bty2a61348gwebp\"><strong><a href=\"https://hackernoon.com/how-vector-search-cracks-the-code-on-contract-analytics\">How Vector Search Cracks the Code on Contract Analytics </a></strong> <img src=\"https://cdn.hackernoon.com/images/qiQzyjN6LvaRDmVgSbd9gXT8bty2-a61348g.webp\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/datastax\">@datastax</a> [ 4 Min read ] \n Learn how vector search helped build a powerful way to identify recurring payments in the financial sector. <a href=\"https://hackernoon.com/how-vector-search-cracks-the-code-on-contract-analytics\">Read More.</a></p>\n<h2 id=\"ibuiltanichesiteandrankeditongoogleinashorttimehereshowhttpshackernooncomibuiltanichesiteandrankeditongoogleinashorttimehereshowhttpscdnhackernooncomimages2jqchkrv03exbugklrdzibfm99q24e02swvjpeg\"><strong><a href=\"https://hackernoon.com/i-built-a-niche-site-and-ranked-it-on-google-in-a-short-time-heres-how\">I Built a Niche Site and Ranked it On Google in a Short Time — Here's How</a></strong> <img src=\"https://cdn.hackernoon.com/images/2jqChkrv03exBUgkLrDzIbfM99q2-4e02swv.jpeg\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/amraandelma\">@amraandelma</a> [ 4 Min read ] \n After five years in the SEO world, I’ve learned one thing: the true measure of an SEO \"expert\" is whether they can rank their own site.  <a href=\"https://hackernoon.com/i-built-a-niche-site-and-ranked-it-on-google-in-a-short-time-heres-how\">Read More.</a></p>\n<h2 id=\"howidealtwithprotonvpnsenshittificationusinganopensourcesolutionhttpshackernooncomhowidealtwithprotonvpnsenshittificationusinganopensourcesolutionhttpscdnhackernooncomimagesfwg2qgsxk8m9zfz7grgymocdagz1r502u46jpeg\"><strong><a href=\"https://hackernoon.com/how-i-dealt-with-proton-vpns-enshittification-using-an-open-source-solution\">How I Dealt with Proton VPN's Enshittification Using an Open-source Solution</a></strong> <img src=\"https://cdn.hackernoon.com/images/fwg2QgSXk8M9zFz7grgYmOCDaGz1-r502u46.jpeg\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/techshinobi\">@techshinobi</a> [ 3 Min read ] \n Proton now looks too much like baby Google back in the days. Free users are going to be their products, and that is when enshittification starts. <a href=\"https://hackernoon.com/how-i-dealt-with-proton-vpns-enshittification-using-an-open-source-solution\">Read More.</a></p>\n<h2 id=\"buildanaichatbotfasterthanyourmorningcoffeerunwiththisguidehttpshackernooncombuildanaichatbotfasterthanyourmorningcoffeerunwiththisguidehttpscdnhackernooncomimagesm6oviadfe8xxyn2x7hnbcvmdhak2kl133iijpeg\"><strong><a href=\"https://hackernoon.com/build-an-ai-chatbot-faster-than-your-morning-coffee-run-with-this-guide\">Build an AI Chatbot Faster Than Your Morning Coffee Run With This Guide</a></strong> <img src=\"https://cdn.hackernoon.com/images/m6OvIAdfE8XXYN2x7hNbCvMdhAk2-kl133ii.jpeg\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/ivmarcos\">@ivmarcos</a> [ 7 Min read ] \n Learn how to build an AI-powered chatbot using React, Vite, and Cohere's API.  <a href=\"https://hackernoon.com/build-an-ai-chatbot-faster-than-your-morning-coffee-run-with-this-guide\">Read More.</a></p>\n<h2 id=\"whathappenswheneconomicmodelsfailtopredictrealoutcomeshttpshackernooncomwhathappenswheneconomicmodelsfailtopredictrealoutcomeshttpscdnhackernooncomimagesafailuregraphonalaptopscreenqxl98nz92pmejmo2twvx648apng\"><strong><a href=\"https://hackernoon.com/what-happens-when-economic-models-fail-to-predict-real-outcomes\">What Happens When Economic Models Fail to Predict Real Outcomes?</a></strong> <img src=\"https://cdn.hackernoon.com/images/a-failure-graph-on-a-laptop-screen-qxl98nz92pmejmo2twvx648a.png\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/keynesian\">@keynesian</a> [ 8 Min read ] \n This article explores how economic models break down near zero interest rates, discussing price changes, market failures, and the effects of economic rigidity. <a href=\"https://hackernoon.com/what-happens-when-economic-models-fail-to-predict-real-outcomes\">Read More.</a> \n 🧑‍💻 What happened in your world this week? It's been said that <a href=\"https://hackernoon.com/developers-the-why-and-how-to-writing-technical-articles-54e824789ef6\">writing can help consolidate technical knowledge</a>, <a href=\"https://hackernoon.com/how-can-non-writers-become-effective-bloggers-1pq32wd\">establish credibility</a>,<a href=\"https://hackernoon.com/how-can-non-writers-become-effective-bloggers-1pq32wd\"> and contribute to emerging community standards</a>. Feeling stuck? We got you covered ⬇️⬇️⬇️\n <a href=\"https://app.hackernoon.com/mobile/lZx3fmlPdlPJpVBIdble\">ANSWER THESE GREATEST INTERVIEW QUESTIONS OF ALL TIME</a>\n We hope you enjoy this worth of free reading material. Feel free to forward this email to a nerdy friend who'll love you for it.\n See you on Planet Internet! With love, \n The HackerNoon Team ✌️\n <img src=\"https://cdn.hackernoon.com/images/ezgif.com-gif-maker%20(44).gif\" alt=\"\" /></p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Wales Police Begin Using a Facial-Recognition Phone App","url":"https://yro.slashdot.org/story/24/12/14/224222/wales-police-begin-using-a-facial-recognition-phone-app?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1734251640,"author":"EditorDavid","unread":true,"desc":"","content":"\"There are concerns human rights will be breached,\" reports the BBC, as Wales police forces launch a facial-recognition app that \"will allow officers to use their phones to confirm someone's identity.\"\n\n\nThe app, known as Operator Initiated Facial Recognition (OIFR), has already been tested by 70 officers across south Wales and will be used by South Wales Police and Gwent Police. Police said its use on unconscious or dead people would help officers to identify them promptly so their family can be reached with care and compassion. In cases where someone is wanted for a criminal offence, the forces said it would secure their quick arrest and detention. Police also said cases of mistaken identity would be easily resolved without the need to visit a police station or custody suite. \n\nPolice said photos taken using the app would not be retained, and those taken in private places such as houses, schools, medical facilities and places of worship would only be used in situations relating to a risk of significant harm. \n\nLiberty, a civil liberties group, is urging new privacy protections from the government, according to the article, which also includes this quote from Jake Hurfurt, of the civil liberties/privacy group Big Brother Watch. \"In Britain, none of us has to identify ourselves to police without very good reason but this unregulated surveillance tech threatens to take that fundamental right away.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Wales+Police+Begin+Using+a+Facial-Recognition+Phone+App%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F24%2F12%2F14%2F224222%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fyro.slashdot.org%2Fstory%2F24%2F12%2F14%2F224222%2Fwales-police-begin-using-a-facial-recognition-phone-app%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://yro.slashdot.org/story/24/12/14/224222/wales-police-begin-using-a-facial-recognition-phone-app?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23551837&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Linux 6.14 To Add Sensor Monitoring For A ~$180 ASRock AM5 Motherboard","url":"https://www.phoronix.com/news/Linux-6.13-HWMON-B650-Steel","date":1734260794,"author":"Michael Larabel","unread":true,"desc":"","content":"In addition to Linux 6.14 set to add sensor monitoring support for the ASUS TUF GAMING X670E PLUS, another lower-cost AMD AM5 motherboard is also set to see sensor monitoring support with this next version of the Linux kernel...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Btrfs Working On RAID1 Round-Robin Read Balancing","url":"https://www.phoronix.com/news/Btrfs-RAID1-Round-Robin-Coming","date":1734261600,"author":"Michael Larabel","unread":true,"desc":"","content":"It's been a while since there has been anything new to report on the Btrfs file-system's built-in RAID functionality but that is changing with RAID1 round-robin read balancing...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Xfce 4.20 Desktop Released With Wayland Improvements & New Features","url":"https://www.phoronix.com/news/Xfce-4.20-Released","date":1734262472,"author":"Michael Larabel","unread":true,"desc":"","content":"After roughly two years of development the Xfce 4.20 lightweight desktop has been released ahead of the year end holidays...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"A Fake Uber Driver Borrowed Phones, Then Stole $200K in Cryptocurrency, Police Say","url":"https://mobile.slashdot.org/story/24/12/14/071245/a-fake-uber-driver-borrowed-phones-then-stole-200k-in-cryptocurrency-police-say?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1734266040,"author":"EditorDavid","unread":true,"desc":"","content":"\"A man is accused of several felony charges after he allegedly posed as an Uber driver and then stole hundreds of thousands of dollars in cryptocurrency from customers in Scottsdale,\" reports Arizona news channel Fox 10. \n\n\n\"Prosecutors have called it an 'extremely sophisticated electronic fraud,'\" reports Gizmodo, \" and it's a strange approach to scamming that makes it sound unique in several ways.\"\n\nNuruhussein Hussein, 40, allegedly picked up two unsuspecting people who were looking for Uber rides they'd ordered in Scottsdale &mdash; one in March and the other in October according to Fox 10 &mdash; by shouting their names on the street outside a hotel. It's not clear how Hussein may have known these people were looking for rides and court documents give no indication how he accomplished this or knew the victims would have crypto accounts, according to Fox 10, though a hotel does make sense as a target-rich environment for those looking to get picked up. \n\nOnce the victims were in the car, Hussein allegedly obtained the phones of the victims through some kind of pretense, including problems with his own phone and the need to look something up as well as a need to connect with the Uber app, according to NBC News. Hussein would then allegedly open up the victim's Coinbase account. \"While manipulating the unsuspecting victim's phone the suspect transferred cryptocurrency from their digital wallet to his digital wallet,\" police reportedly explained in a statement.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=A+Fake+Uber+Driver+Borrowed+Phones%2C+Then+Stole+%24200K+in+Cryptocurrency%2C+Police+Say%3A+https%3A%2F%2Fmobile.slashdot.org%2Fstory%2F24%2F12%2F14%2F071245%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fmobile.slashdot.org%2Fstory%2F24%2F12%2F14%2F071245%2Fa-fake-uber-driver-borrowed-phones-then-stole-200k-in-cryptocurrency-police-say%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://mobile.slashdot.org/story/24/12/14/071245/a-fake-uber-driver-borrowed-phones-then-stole-200k-in-cryptocurrency-police-say?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23551431&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Linux Fixing A \"Hilarious/Revolting Performance Regression\" Around Intel KVM Virtualization","url":"https://www.phoronix.com/news/Linux-Intel-KVM-Cache-CPUID","date":1734270900,"author":"Michael Larabel","unread":true,"desc":"","content":"It's not too often that \"fixes\" to the Kernel-based Virtual Machine (KVM) are noteworthy but today is an interesting exception with among the KVM fixes sent in today ahead of the Linux 6.13-rc3 tagging is for beginning to deal with a \"hilarious/revolting\" performance regression affecting recent generations of Intel processors. This performance regression won't be fully worked around until Linux 6.14 but at least there is an interim step in place once the code is merged later today...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Trump’s Silicon Valley advisers have AI ‘censorship’ in their crosshairs","url":"https://techcrunch.com/2024/12/15/trumps-silicon-valley-advisers-have-ai-censorship-in-their-crosshairs/","date":1734271200,"author":"Maxwell Zeff","unread":true,"desc":"","content":"<p>President-elect Donald Trump has surrounded himself with Silicon Valley entrepreneurs — including Elon Musk, Marc Andreessen, and David Sacks — who are now advising him on technology and other issues. When it comes to AI, this crew of technologists is fairly aligned on the need for rapid development and adoption of AI throughout the U.S. [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Jean Sammet: An Accidental Computer Programmer","url":"https://spectrum.ieee.org/jean-sammet-accidental-computer-programmer","date":1734271204,"author":"Amanda Davis","unread":true,"desc":"","content":"<p>The IBM programming language specialist helped develop Cobol in 1959</p>","flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTI5MDkwMC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc0MjIyNzUzOH0.YEwhv73pIttaJf7Ra_ygX_sLW-mxXK1Gw9vQwzGoNIo/image.jpg?width=600","enclosureMime":""},{"title":"Open source companies that go proprietary: A timeline","url":"https://techcrunch.com/2024/12/15/open-source-companies-that-go-proprietary-a-timeline/","date":1734274800,"author":"Paul Sawers","unread":true,"desc":"","content":"<p>Open source might be the building blocks of the modern software stack, but companies building businesses off the back of open source software face a perennial struggle between keeping their community happy and ensuring that third parties don&#8217;t abuse the permissions afforded by the license. Many companies have launched with lofty open source ambitions, only [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Java Throughput/Latency & Power Efficiency Tuning For AMD EPYC Turin","url":"https://www.phoronix.com/review/java-optimizations-epyc-turin","date":1734274848,"author":"Michael Larabel","unread":true,"desc":"","content":"Last month I looked at the impact of AMD's BIOS tuning guide on AI / machine learning workloads for new 5th Gen EPYC \"Turin\" processors. In today's article I am looking at the performance and power efficiency impact of AMD EPYC 9005 series processors with AMD's BIOS tuning recommendations for Java workloads on Linux.","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"New 'The Witcher 4' Trailer: Pre-Rendered on an 'Unannounced' NVIDIA GeForce RTX GPU","url":"https://games.slashdot.org/story/24/12/14/233211/new-the-witcher-4-trailer-pre-rendered-on-an-unannounced-nvidia-geforce-rtx-gpu?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1734276840,"author":"EditorDavid","unread":true,"desc":"","content":" Witcher 4's first trailer debuted at the 2024 Game Awards &mdash; a six-minute cinema-quality thriller. It's a teaser for a game that \"aims to be the most immersive and ambitious open-world Witcher game to date,\" according to an announcement from CD Projekt Red.\n\nThe trailer is pre-rendered in a custom build of Unreal Engine 5 on an unannounced NVIDIA GeForce RTX GPU. Powered by the same tech that The Witcher IV is built on, using assets and models from the game itself, it aims to provide players with a cinematic look at the kind of experience the game is aspiring to provide. \nThe trailer shows \"a remote village that has been terrorized for generations by a fearsome monster demanding human sacrifices...\" their announcement notes. (\"At the heart of the trailer is Ciri's perspective as an outsider to the village.\") \"Geralt will appear in the game, but we don't want to spoil his role precisely,\" CD Projekt Red told IGN. \n\nKotaku reminds fans there's also Netflix's animated movie The Witcher: Sirens of the Deep in February 2025 &mdash; plus the first new Witcher novel in over a decade (with an English translation) expected sometime next year as well... \n\nThanks to Slashdot reader jjslash for sharing the news.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=New+'The+Witcher+4'+Trailer%3A+Pre-Rendered+on+an+'Unannounced'+NVIDIA+GeForce+RTX+GPU%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F12%2F14%2F233211%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F12%2F14%2F233211%2Fnew-the-witcher-4-trailer-pre-rendered-on-an-unannounced-nvidia-geforce-rtx-gpu%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://games.slashdot.org/story/24/12/14/233211/new-the-witcher-4-trailer-pre-rendered-on-an-unannounced-nvidia-geforce-rtx-gpu?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23551879&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The HackerNoon Newsletter: The $XRP Comeback Was a Long Time Coming (12/15/2024)","url":"https://hackernoon.com/12-15-2024-newsletter?source=rss","date":1734278710,"author":"Noonification","unread":true,"desc":"","content":"\n              \n        <p><strong>How are you, hacker?</strong></p>\n        <br />\n        <p>🪐 What’s happening in tech today, December 15, 2024?</p>\n        <br />\n        <p>\n          The\n          <a href=\"https://hackernoon.com/noonification\" target=\"_blank\" rel=\"noopener\"> HackerNoon Newsletter</a>\n          brings the HackerNoon \n          <a href=\"https://hackernoon.com\" target=\"_blank\" rel=\"noopener\">homepage</a>\n          straight to your inbox.\n          <a href=\"https://hackernoon.com/on-this-day\" target=\"_blank\" rel=\"noopener\">On this day,</a>\n          \n            <strong>Aim Was Discontinued as a Service</strong> in 2017,  <strong>Netscape Launched Navigator</strong> in 1994,  <strong>Google Buzz is Replaced by Google+</strong> in 2011,  <strong>Alta Vista is Launched</strong> in 1995, \n          \n          and  we present you with these top quality stories. \n          \n            From \n        <a href=\"https://hackernoon.com/the-$xrp-comeback-was-a-long-time-coming\" class=\"eventTitle\"><strong>The $XRP Comeback Was a Long Time Coming</strong></a>\n       to \n        <a href=\"https://hackernoon.com/a-pentester-took-apart-a-websites-code-to-prove-it-was-totally-pointless\" class=\"eventTitle\"><strong>A Pentester Took Apart a Website’s Code to Prove It Was Totally Pointless</strong></a>,\n       let’s dive right in.\n          \n        </p>\n      \n              \n          <h2><a href=\"https://hackernoon.com/step-by-step-building-a-rest-api-that-talks-to-hugging-face-models\">Step-by-Step: Building a REST API That Talks to Hugging Face Models</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/pjd36FI6ZeQXpcz7akt590PMQdp1-vjb33jd.png\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/aiforbreakfast\">@aiforbreakfast</a> [ 10 Min read ] Youll learn about the Hugging Face platform, setting up a project, creating an access token, building a Java client, and more! <a href=\"https://hackernoon.com/step-by-step-building-a-rest-api-that-talks-to-hugging-face-models\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/everything-you-need-to-know-about-the-lumoz-token-generation-event\">Everything You Need to Know About the Lumoz Token Generation Event</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/Wls6TtjOLGMbl8aKwQlIbcyfjQF2-wm33zx8.jpeg\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/lumoz\">@lumoz</a> [ 5 Min read ] The modular compute layer  RaaS platform Lumoz will launch its mainnet and conduct the TGE within a week. Find all the details here! <a href=\"https://hackernoon.com/everything-you-need-to-know-about-the-lumoz-token-generation-event\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/lumoz-protocol-mainnet-launch-moz-tokens-and-node-claims-now-open\">Lumoz Protocol Mainnet Launch: MOZ Tokens and Node Claims Now Open!</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/Wls6TtjOLGMbl8aKwQlIbcyfjQF2-1143y7e.png\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/lumoz\">@lumoz</a> [ 4 Min read ] Today, we are proud to announce the official launch of the Lumoz Protocol mainnet!  <a href=\"https://hackernoon.com/lumoz-protocol-mainnet-launch-moz-tokens-and-node-claims-now-open\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/wall-street-probably-doesnt-want-you-to-know-about-duck-code\">Wall Street (Probably) Doesnt Want You to Know About Duck Code</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/0x1fb1816da507a669f56a866db0f7df54cc539209-ftx2zzo.png\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/professor0\">@professor0</a> [ 13 Min read ] The Duck is present in all major financial markets, orchestrating movements on a grand scale. <a href=\"https://hackernoon.com/wall-street-probably-doesnt-want-you-to-know-about-duck-code\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/9-open-source-projects-every-developer-needs-to-bookmark-for-their-workflow\">9 Open Source Projects Every Developer Needs to Bookmark for Their Workflow</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/gaZTNviyRwbJIkQm85R8IxM2vOY2-au030yj.jpeg\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/madzadev\">@madzadev</a> [ 4 Min read ] Discover 9 open-source projects to enhance your cloud workflow, project management, user feedback, automation, and more. <a href=\"https://hackernoon.com/9-open-source-projects-every-developer-needs-to-bookmark-for-their-workflow\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/the-$xrp-comeback-was-a-long-time-coming\">The $XRP Comeback Was a Long Time Coming</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/2jqChkrv03exBUgkLrDzIbfM99q2-ac02txj.jpeg\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/gleams\">@gleams</a> [ 8 Min read ] Here are the four things I spotted Ripple doing right, even when every one was sleeping on the cryptocurrency. <a href=\"https://hackernoon.com/the-$xrp-comeback-was-a-long-time-coming\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/the-top-ten-open-source-boilerplates-of-2024\">The Top Ten Open Source Boilerplates of 2024</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/N0ENUd29UdNJCFcl7GnmZHdk2fA2-ay039uz.png\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/sadekirfan3\">@sadekirfan3</a> [ 2 Min read ] A curated list of open source boilerplates to kickstart you next project in react, nextjs, nodejs, mobile development, backend frameworks, and more. <a href=\"https://hackernoon.com/the-top-ten-open-source-boilerplates-of-2024\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/a-pentester-took-apart-a-websites-code-to-prove-it-was-totally-pointless\">A Pentester Took Apart a Website’s Code to Prove It Was Totally Pointless</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/TYJUMtiClUZJ10sVuaeuHOy548K2-mg1832pt.png\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/vognik\">@vognik</a> [ 16 Min read ] In this article, Ill walk you through how to reverse-engineer Javascript code and show you how to write my Burp Suite extension in practice. <a href=\"https://hackernoon.com/a-pentester-took-apart-a-websites-code-to-prove-it-was-totally-pointless\">Read More.</a></p>\n        \n              \n        <br />\n        <p>🧑‍💻 What happened in your world this week?</p>\n        <p>\n          It's been said that\n          <a href=\"https://hackernoon.com/developers-the-why-and-how-to-writing-technical-articles-54e824789ef6\">writing can help consolidate technical knowledge</a>,\n          <a href=\"https://hackernoon.com/how-can-non-writers-become-effective-bloggers-1pq32wd\">establish credibility</a>,\n          <a href=\"https://hackernoon.com/how-can-non-writers-become-effective-bloggers-1pq32wd\"> and contribute to emerging community standards</a>.\n          Feeling stuck? We got you covered ⬇️⬇️⬇️\n        </p>\n        <br />\n        <p>\n          <a href=\"https://app.hackernoon.com/mobile/lZx3fmlPdlPJpVBIdble\">ANSWER THESE GREATEST INTERVIEW QUESTIONS OF ALL TIME</a>\n        </p>\n        <br />\n        <p>We hope you enjoy this worth of free reading material. Feel free to forward this email to a nerdy friend who'll love you for it.See you on Planet Internet! With love, \n The HackerNoon Team ✌️</p>\n        <br />\n        <p><img src=\"https://cdn.hackernoon.com/images/the-hackernoon-newsletter-footer.png\" alt /></p>\n      \n            ","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Single Crystal Lithium-Ion Batteries Last 8x Longer, Researchers Show","url":"https://hardware.slashdot.org/story/24/12/14/2350202/single-crystal-lithium-ion-batteries-last-8x-longer-researchers-show?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1734280440,"author":"EditorDavid","unread":true,"desc":"","content":"Researchers used Canada's national synchrotron light source facility \"to analyze a new type of lithium-ion battery material &mdash; called a single-crystal electrode &mdash; that's been charging and discharging non-stop in a Halifax lab for more than six years,\" reports Tech Xplore. \n\nThe results? The battery material \"lasted more than 20,000 cycles before it hit the 80% capacity cutoff,\" which they say is equivalent to driving 8 million kms (nearly 5 million miles). That's more than eight times the life of a regular lithium-ion battery that lasted 2,400 cycles before reaching the 80% cutoff &mdash; and \"When the researchers looked at the single crystal electrode battery, they saw next to no evidence of this mechanical stress.\" (One says the material \"looked very much like a brand-new cell.\"\n\n\nToby Bond [a senior scientist at the CLS, who conducted the research for his Ph.D.] attributes the near absence of degradation in the new style battery to the difference in the shape and behavior of the particles that make up the battery electrodes... The single crystal is, as its name implies, one big crystal: it's more like an ice cube. \"If you have a snowball in one hand, and an ice cube in the other, it's a lot easier to crush the snowball,\" says Bond. \"The ice cube is much more resistant to mechanical stress and strain.\" While researchers have for some time known that this new battery type resists the micro cracking that lithium-ion batteries are so susceptible to, this is the first time anyone has studied a cell that's been cycled for so long... \n\nBond says what's most exciting about the research is that it suggests we may be near the point where the battery is no longer the limiting component in an EV &mdash; as it may outlast the other parts of the car. The new batteries are already being produced commercially, says Bond, and their use should ramp up significantly within the next couple of years. \"I think work like this just helps underscore how reliable they are, and it should help companies that are manufacturing and using these batteries to plan for the long term.\" \nThanks to long-time Slashdot reader schwit1 for sharing the news.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Single+Crystal+Lithium-Ion+Batteries+Last+8x+Longer%2C+Researchers+Show%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F12%2F14%2F2350202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F12%2F14%2F2350202%2Fsingle-crystal-lithium-ion-batteries-last-8x-longer-researchers-show%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://hardware.slashdot.org/story/24/12/14/2350202/single-crystal-lithium-ion-batteries-last-8x-longer-researchers-show?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23551905&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Are People Starting to Love Self-Driving Robotaxis?","url":"https://tech.slashdot.org/story/24/12/14/0634207/are-people-starting-to-love-self-driving-robotaxis?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1734284040,"author":"EditorDavid","unread":true,"desc":"","content":"\"In a tiny handful of places...\" Wired wrote last month, \"you can find yourself flanked by taxis with no one in the drivers' seats.\" But they added that \"Granted, practically everyone has been numbed by the hype cycle.\" \n\nWired's response? \"[P]ile a few of us into an old-fashioned, human-piloted hired car, then follow a single Waymo robotaxi wherever it goes for a whole workday\" to \"study its movements, its relationship to life on the streets, its whole self-driving gestalt. We'll interview as many of its passengers as will speak to us, and observe it through the eyes of the kind of human driver it's designed to replace.\" \n\nThis week Wired senior editor John Gravios discussed the experience on the business-news radio show Marketplace (with Marketplace host Kai Ryssdal):\n\n\n\nRyssdal: What kinds of reactions did you get from people once you track them down, what did they say about their experience in this driverless car? \n\nGravios:It was pretty uniform and impressive how much people just love it. They just like the experience of the drive, I guess it's a little bit less herky-jerky than a human driver, but I think a lot of it just comes down to people are just kind of relieved not to have to talk to somebody else, as as sad as that is... \n\nRyssdal: Tell me about Gabe, your Uber driver, and his thoughts on this whole thing, because that was super interesting. \n\nGravios: So Gabe, this is a guy whose labor is directly at stake. You know, he's a guy whose labor is going to be replaced by a Waymo. He's had 30 years of experience as a professional driver, first as a taxi driver. He even organized a taxi driver strike in the days before Uber. His first, I think his prejudice with Waymo is having shared the road with them sort of sporadically, he thought of them as kind of dopey, rule-following, frustrating vehicles to share the road with. But over the course of the day, he started to recognize that the Waymo was driving a lot like a taxi driver. The Waymo was doing things that were aggressive, that are exactly the kinds of things that a taxi driver is trained to be aggressive with and doing things that were cautious that are exactly the kinds of things that taxi drivers are trained to be cautious with. \n\nRyssdal: Can we talk unit economics here? According to the math from a study you guys' cite, Waymo is not making a whole lot of money per vehicle, right? And eventually they're going to scale, and it's going to work out, but for the moment, even though they've gotten 11 billion-something-dollars, they're not turning a whole lot of profit here. \nGravios: Yeah, that's a big question, and the math is, even that study, based on a lot of guesswork. It's really hard to say what the unit economics are. What we can say is that the ridership rates are going up so fast that that study is already well out of date. When we were doing our chase, I think the monthly ridership for Waymo was 100,000 rides a month. By October, it was already 150,000 rides a month. So, the economics are just shifting under our feet a lot.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Are+People+Starting+to+Love+Self-Driving+Robotaxis%3F%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F14%2F0634207%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F14%2F0634207%2Fare-people-starting-to-love-self-driving-robotaxis%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://tech.slashdot.org/story/24/12/14/0634207/are-people-starting-to-love-self-driving-robotaxis?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23551415&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Apple reportedly developing foldable iPhone and iPad","url":"https://techcrunch.com/2024/12/15/apple-reportedly-developing-foldable-iphone-and-ipad/","date":1734285118,"author":"Anthony Ha","unread":true,"desc":"","content":"<p>The next big upgrade to Apple’s mobile devices could be foldability, according to multiple reports published Sunday. According to The Wall Street Journal, Apple is aiming to launch two foldable devices in the next few years. There’s a larger model with a 19-inch screen that could compete with desktop monitors, as well as a smaller [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Let's Encrypt Announces New-Certificate-Every-6-Days Offering","url":"https://it.slashdot.org/story/24/12/15/0059216/lets-encrypt-announces-new-certificate-every-6-days-offering?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1734287640,"author":"EditorDavid","unread":true,"desc":"","content":"The non-profit, free certificate authority Let's Encrypt shared some news from their executive director as they approach their 10th anniversary in 2025:\n\nInternally things have changed dramatically from what they looked like ten years ago, but outwardly our service hasn't changed much since launch. That's because the vision we had for how best to do our job remains as powerful today as it ever was: free 90-day TLS certificates via an automated API. Pretty much as many as you need. More than 500,000,000 websites benefit from this offering today, and the vast majority of the web is encrypted. \n\nOur longstanding offering won't fundamentally change next year, but we are going to introduce a new offering that's a big shift from anything we've done before &mdash; short-lived certificates. Specifically, certificates with a lifetime of six days. This is a big upgrade for the security of the TLS ecosystem because it minimizes exposure time during a key compromise event. \n\nBecause we've done so much to encourage automation over the past decade, most of our subscribers aren't going to have to do much in order to switch to shorter lived certificates. We, on the other hand, are going to have to think about the possibility that we will need to issue 20x as many certificates as we do now. It's not inconceivable that at some point in our next decade we may need to be prepared to issue 100,000,000 certificates per day. That sounds sort of nuts to me today, but issuing 5,000,000 certificates per day would have sounded crazy to me ten years ago... It was hard to build Let's Encrypt. It was difficult to scale it to serve half a billion websites... \n\nCharitable contributions from people like you and organizations around the world make this stuff possible. Since 2015, tens of thousands of people have donated. They've made a case for corporate sponsorship, given through their Donor-Advised Funds, or set up recurring donations, sometimes to give $3 a month. That's all added up to millions of dollars that we've used to change the Internet for nearly everyone using it. \nThanks to long-time Slashdot reader rastos1 for sharing the news.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Let's+Encrypt+Announces+New-Certificate-Every-6-Days+Offering%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F12%2F15%2F0059216%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F12%2F15%2F0059216%2Flets-encrypt-announces-new-certificate-every-6-days-offering%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://it.slashdot.org/story/24/12/15/0059216/lets-encrypt-announces-new-certificate-every-6-days-offering?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23551955&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""}]}