{"id":"2k6wXud2N91xpf4PwnSfo4j5WSuTNX5k","title":"Tech News - Last 2 days","displayTitle":"Tech News - Last 2 days","url":"","feedLink":"","items":[{"title":"MGLRU Sees New Performance Optimizations For Linux","url":"https://www.phoronix.com/news/MGLRU-New-Performance-Opts","date":1733483999,"author":"Michael Larabel","unread":true,"desc":"","content":"It's been a while since there have been any new advancements or performance optimizations to talk about for Multi-Gen LRU (MGLRU) that was upstreamed to the Linux kernel two years ago as a very exciting kernel innovation. But that's changing now with some fresh performance optimizations being worked on for the MGLRU code...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"AMD P-State Driver Improvements Getting Ready For Linux 6.14","url":"https://www.phoronix.com/news/Linux-6.14-AMD-P-State-Start","date":1733484420,"author":"Michael Larabel","unread":true,"desc":"","content":"While Linux 6.13-rc1 was only released this past Sunday and there is around two months to go until the start of the Linux 6.14 kernel cycle, AMD P-State driver improvements are already beginning to collect for this next kernel cycle...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Broadcom BCM2712 MOPLET Graphics For Linux 6.14, Other Early drm-misc-next Code","url":"https://www.phoronix.com/news/Linux-6.14-drm-misc-next-Start","date":1733485422,"author":"Michael Larabel","unread":true,"desc":"","content":"While the Linux v6.13 merge window has been over for less than one week, already the first pull requests of new feature code are being submitted to DRM-Next for queuing the display/graphics driver changes ahead of the Linux 6.14 merge window in two months...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Fedora 42 Eyes Replacing SDL2 With sdl2-compat To Leverage SDL3","url":"https://www.phoronix.com/news/Fedora-42-sdl2-compat-Propose","date":1733486307,"author":"Michael Larabel","unread":true,"desc":"","content":"The SDL2 library is widely used by cross-platform games and other software. Fedora 42 is eyeing the possibility of replacing SDL2 with the sdl2-compat code so that by way of this compatibility layer the newer SDL3 version will ultimately be used instead...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Fwupd 2.0.3 Delivers Latest Firmware Updating Capabilities For Linux Systems","url":"https://www.phoronix.com/news/Fwupd-2.0.3-Release","date":1733492319,"author":"Michael Larabel","unread":true,"desc":"","content":"Fwupd 2.0 debuted back in October while out today is Fwupd 2.0.3 as the newest incremental update to this open-source solution for updating system and device firmware under Linux...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"openSUSE Leap Micro 6.1 Brings Nice Improvements To This Lightweight Linux OS","url":"https://www.phoronix.com/news/openSUSE-Leap-Micro-6.1","date":1733492929,"author":"Michael Larabel","unread":true,"desc":"","content":"openSUSE Leap Micro 6.1 is now available as the newest version of this lightweight Linux operating system built for containerized environments and virtualized workloads...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Linux Preps For Kunpeng ARM Server SoC With High Bandwidth Memory","url":"https://www.phoronix.com/news/Huawei-Kunpeng-HBM-Linux","date":1733497400,"author":"Michael Larabel","unread":true,"desc":"","content":"New Linux patches from Huawei engineers are preparing new driver support for controlling High Bandwidth Memory (HBM) with the ARM-based Kunpeng high performance SoC...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Box64 v0.3.2 Emulator Adds Box32 Option, Introduces Native Flags & More","url":"https://www.phoronix.com/news/Box64-0.3.2-Released","date":1733502480,"author":"Michael Larabel","unread":true,"desc":"","content":"Box64 v0.3.2 is out today as the newest feature release to this Linux user-space emulator for allowing x86_64 binaries to run on ARM64 (AArch64) Linux devices. Box64 is one of the leading ways for allowing x86_64 games and Steam to be able to run on ARM 64-bit Linux devices...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Video Friday: Multiple MagicBots","url":"https://spectrum.ieee.org/video-friday-multiple-magicbots","date":1733504406,"author":"Evan Ackerman","unread":true,"desc":"","content":"<p>Your weekly selection of awesome robot videos</p>","flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTE0NTcwNS9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTc4MzY2MjA2MX0.qTHwFZCAhLGd87TPMJZ9hIhLzo5OSl4rKt3lR3s6NO8/image.png?width=600","enclosureMime":""},{"title":"OpenAI 2024 event: How to watch new ChatGPT product reveals and demos","url":"https://techcrunch.com/2024/12/06/openai-2024-event-how-to-watch-new-chatgpt-product-reveals-and-demos/","date":1733506489,"author":"Cody Corrall","unread":true,"desc":"","content":"<p>OpenAI is in the holiday spirit, it seems. The ChatGPT creator announced “12 Days of OpenAI,” a series of reveals that will be livestreamed at 10 a.m. PT for the next 12 weekdays. Day one of the event saw the launch of ChatGPT Pro, OpenAI’s $200 per month subscription plan, and the full version of [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Linux 6.13 Features: AutoFDO+Propeller Optimizations, Many AMD Additions & SDUC + NVMe 2.1 Support","url":"https://www.phoronix.com/review/linux-613-features","date":1733507760,"author":"Michael Larabel","unread":true,"desc":"","content":"With the Linux 6.13 merge window having ended this past weekend, here's the Phoronix overview of all the interesting feature additions, new hardware support, and other kernel changes coming for Linux 6.13.","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"a16z-backed Toka wants to help US agencies hack into security cameras and other IoT devices","url":"https://techcrunch.com/2024/12/06/a16z-backed-toka-wants-to-help-us-agencies-hack-into-security-cameras-and-other-iot-devices/","date":1733510183,"author":"Charles Rollet","unread":true,"desc":"","content":"<p>An Israeli startup specializing in penetrating IoT devices says it's hiring to \"support new business growth\" in the US government market.</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Your AI clone could target your family, but there’s a simple defense","url":"https://arstechnica.com/ai/2024/12/your-ai-clone-could-target-your-family-but-theres-a-simple-defense/","date":1733512925,"author":"Benj Edwards","unread":true,"desc":"","content":"\n              <p>On Tuesday, the US Federal Bureau of Investigation <a href=\"https://www.ic3.gov/PSA/2024/PSA241203\">advised</a> Americans to share a secret word or phrase with their family members to protect against AI-powered voice-cloning scams, as criminals <a href=\"https://arstechnica.com/tech-policy/2023/03/rising-scams-use-ai-to-mimic-voices-of-loved-ones-in-financial-distress/\">increasingly use voice synthesis</a> to impersonate loved ones in crisis.</p>\n<p>\"Create a secret word or phrase with your family to verify their identity,\" wrote the FBI in an official public service announcement (<a href=\"https://www.ic3.gov/PSA/2024/PSA241203\">I-120324-PSA</a>).</p>\n<p>For example, you could tell your parents, children, or spouse to ask for a word or phrase to verify your identity if something seems suspicious, such as \"The sparrow flies at midnight,\" \"Greg is the king of burritos,\" or simply \"flibbertigibbet.\" (As fun as these sound, your password should be secret and not the same as these.)</p><p><a href=\"https://arstechnica.com/ai/2024/12/your-ai-clone-could-target-your-family-but-theres-a-simple-defense/\">Read full article</a></p>\n<p><a href=\"https://arstechnica.com/ai/2024/12/your-ai-clone-could-target-your-family-but-theres-a-simple-defense/#comments\">Comments</a></p>\n\n            ","flags":null,"enclosureUrl":"https://cdn.arstechnica.net/wp-content/uploads/2024/12/peeping_through_door_slot-1152x648.jpg","enclosureMime":""},{"title":"Hopeful hearts and other startup news","url":"https://techcrunch.com/2024/12/06/hopeful-hearts-and-other-startup-news/","date":1733515500,"author":"Anna Heim","unread":true,"desc":"","content":"<p>Welcome to Startups Weekly — your weekly recap of everything you can’t miss from the world of startups. Want it in your inbox every Friday? Sign up here. The week after Thanksgiving is usually rich in announcements, and this year was no exception. Blame it on the holiday season, but we would even go as [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Wine 10.0-rc1 Released With Updated VKD3D, Initial Bluetooth Driver","url":"https://www.phoronix.com/news/Wine-10.0-rc1-Released","date":1733519085,"author":"Michael Larabel","unread":true,"desc":"","content":"The first release candidate of Wine 10.0 is out today that also now marks the feature freeze ahead of this stable release expected to be out around mid-January...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Instagram locks out developers of third-party consumer apps","url":"https://techcrunch.com/2024/12/06/instagram-locks-out-developers-of-third-party-consumer-apps/","date":1733519496,"author":"Sarah Perez","unread":true,"desc":"","content":"<p>A change to Meta&#8217;s developer tools is impacting third-party consumer apps that had previously integrated with Instagram. Among those affected by the changes are the Match-owned dating apps Tinder and Hinge, which had allowed their users to link their Instagram profiles to their accounts to display their posts to potential matches. Day One, the journaling [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Rivian’s EVs ranked last on Consumer Reports reliability list","url":"https://techcrunch.com/2024/12/06/rivians-evs-ranked-last-on-consumer-reports-reliability-list/","date":1733521124,"author":"Sean O'Kane","unread":true,"desc":"","content":"<p>Consumer Reports has put out its annual automaker reliability list, and the top spot is relatively unsurprising: Subaru. What may come as a surprise to some is that Rivian&#8217;s EVs are dead last, especially considering the company topped a different Consumer Reports survey from earlier this year about the &#8220;most loved&#8221; auto brands. The consumer [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Meta’s Nick Clegg says Elon Musk has potential to be a political ‘puppet master’","url":"https://techcrunch.com/2024/12/06/metas-nick-clegg-says-elon-musk-has-potential-to-be-a-political-puppet-master/","date":1733521463,"author":"Margaux MacColl","unread":true,"desc":"","content":"<p>Meta’s Nick Clegg talked about how Musk is “playing an outsized role in both the election and now the formation of the new US administration.” </p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Snyk hits $300M ARR but isn’t rushing to go public","url":"https://techcrunch.com/2024/12/06/snyk-hits-300m-arr-but-isnt-rushing-to-go-public/","date":1733524708,"author":"Charles Rollet","unread":true,"desc":"","content":"<p>Several factors indicate that Snyk, most recently valued at $7.4 billion, could IPO soon. But the CEO told us why it might not.</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"If you can make this AI bot fall in love, you could win thousands of dollars","url":"https://techcrunch.com/2024/12/06/if-you-can-make-this-ai-bot-fall-in-love-you-could-win-thousands-of-dollars/","date":1733525542,"author":"Margaux MacColl","unread":true,"desc":"","content":"<p>If you can be the first person to get an AI bot named Freysa to say ‘I love you,’ you’ll win anywhere from $3,000 to tens of thousands of dollars.  </p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Will people really pay $200 a month for OpenAI’s new chatbot?","url":"https://techcrunch.com/2024/12/06/will-people-really-pay-200-a-month-for-openais-new-chatbot/","date":1733527156,"author":"Kyle Wiggers","unread":true,"desc":"","content":"<p>On Thursday, OpenAI released what&#8217;s effectively a $200-a-month chatbot — and the AI community didn&#8217;t know quite what to make of it. The company&#8217;s new ChatGPT Pro plan grants access to &#8220;o1 pro mode,&#8221; which OpenAI says &#8220;uses more compute for the best answers to the hardest questions.&#8221; A souped-up version of OpenAI&#8217;s o1 reasoning [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"OBS Studio 31.0 Released With New Features For Screen Recording & Screencasting","url":"https://www.phoronix.com/news/OBS-Studio-31.0","date":1733535131,"author":"Michael Larabel","unread":true,"desc":"","content":"OBS Studio 31.0 was released this evening as the newest feature update to this open-source, cross-platform software for live streaming and desktop screen recording purposes. OBS Studio remains a leading choice across operating systems for screen recording, game livestreaming, and similar purposes while the new v31.0 release tacks on even more features...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Grok is now free for all X users","url":"https://techcrunch.com/2024/12/06/2927301/","date":1733537656,"author":"Charles Rollet","unread":true,"desc":"","content":"<p>The AI chatbot within X, Grok, is now free for all users - but with some limits.</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Microsoft Discontinues Its $4,500 All-in-One Desktop, 'Surface Studio'","url":"https://hardware.slashdot.org/story/24/12/07/0144230/microsoft-discontinues-its-4500-all-in-one-desktop-surface-studio?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733538840,"author":"EditorDavid","unread":true,"desc":"","content":"An anonymous reader shared this report from the blog Windows Central:\nMicrosoft has ended production on the Surface Studio 2+, its ultra-premium all-in-one desktop PC designed for creatives and commercial customers. Starting at a whopping $4,500, the Studio 2+ was the ultimate Windows all-in-one with the best touchscreen display on a unique hinge that allowed the screen to lay down like a draft board... So, if you're interested in buying a Surface Studio 2+, you better hurry, as whatever stock is remaining is all that's left. Unfortunately, it's likely that the end of production on the Surface Studio 2+ also marks an end to the Surface Studio line as a whole. My own sources tell me there's no Studio 2+ successor lined up currently. \n\nArs Technica points out that over the eight-year run of the Surface Studio, Microsoft only updated it twice.\n\n\nLike the Surface Laptop Studio, the desktop's claim to fame was a unique hinge design for its screen, which could reposition it to make it easier to draw on with the Surface Pen. But the desktop's high cost and its perennially outdated internal components made it a less appealing machine than it could have been... \n\nThe longest-lived Studio desktop was the Surface Studio 2, which was released in 2018 and wasn't replaced until a revised Surface Studio 2+ was announced in late 2022. It used an even higher-quality display panel, but it still used previous-generation internal components. This might not have been so egregious if Microsoft had updated it more consistently, but this model went untouched for so long that Microsoft had to lower Windows 11's system requirements specifically to cover the Studio 2 so that the company wouldn't be ending support for a PC that it was still actively selling. \n\nThe Studio 2+ was the desktop's last hurrah, and despite jumping two GPU generations and four CPU generations, it still didn't use the latest components available at the time. Again, more consistent updates like the ones Microsoft provides for the Surface Pro and Surface Laptop could have made this less of a problem, but the Studio 2+ once again sat untouched for two years after being updated.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Discontinues+Its+%244%2C500+All-in-One+Desktop%2C+'Surface+Studio'%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F12%2F07%2F0144230%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F12%2F07%2F0144230%2Fmicrosoft-discontinues-its-4500-all-in-one-desktop-surface-studio%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://hardware.slashdot.org/story/24/12/07/0144230/microsoft-discontinues-its-4500-all-in-one-desktop-surface-studio?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23544141&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Is Valve Letting Third Parties Create SteamOS Hardware?","url":"https://games.slashdot.org/story/24/12/07/0259225/is-valve-letting-third-parties-create-steamos-hardware?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733546040,"author":"EditorDavid","unread":true,"desc":"","content":"The Verge thinks Valve \"could make a play to dethrone the Sony PlayStation and Microsoft.\" And it's not just because there's lots of new SteamOS hardware on the way (including a wireless VR headset and a pair of trackable wands, a Steam Controller 2 gamepad, and a living room console. \n\n\"Valve has also now seemingly revealed plans for partners to create third-party SteamOS hardware too.\"\nIt won't be easy to take on Sony, Microsoft, or Meta. Those companies have a lot to lose, and they're deeply entrenched. But the Steam Deck has revealed a massive weakness in each of their businesses that may take them years to correct &mdash; the desire to play a huge library of games anytime, anywhere. And while they figure that out, Valve may be building an entire new ecosystem of SteamOS hardware, one that could finally let PC and peripheral makers tap into the huge and growing library of Windows games on all sorts of different hardware without relying on Microsoft or subjecting their customers to the many annoyances of Windows... \n\n\nValve has long said it will open up SteamOS to other manufacturers, even recently committing to some direct support for rival handhelds like the Asus ROG Ally &mdash; and the other week, Valve quietly updated a document that may reveal its larger overarching strategy. It won't just leave SteamOS sitting around and hope manufacturers build something &mdash; it'll hold their hand. Valve now has an explicit label for third parties to create \"Powered by SteamOS\" devices, which it explicitly defines as \"hardware running the SteamOS operating system, implemented in close collaboration with Valve.\" It additionally lets companies create \"Steam Compatible\" hardware that ships with \"Valve approved controller inputs,\" as well as SteamVR hardware and Steam Link hardware that lets you stream games from one device to another... \n\nWhen Valve asked PC manufacturers to sign onto its Steam Machines initiative over a decade ago, with the idea of building living room PC consoles, it asked for a leap of faith with very little to show and a tiny chance of success. It took years for Valve to even build the oddball living room controller for its Steam Machines, and it didn't get far in convincing Windows game developers to port their games to Linux. But by the time it announced the Steam Deck, Valve had hammered out a Proton software compatibility layer so good that many Windows games now run better on Linux, and created the most customizable yet familiar set of controls ever made. If manufacturers could build their own Steam Machines rather than equivalent Windows machines, they could offer better gaming products than they do today. Maybe they'd even want to release a VR headset that isn't tied to Microsoft or Meta if it doubled as a Steam Deck, portably playing decades of flatscreen games. \n\nIt's not clear any of this will pan out; Valve is an exceedingly small company that tries not to chase too many things at a time. When I speak to PC industry executives about why they pick Windows over SteamOS, some say they're concerned about whether Valve would truly be able to support them. But it's just as intriguing an idea as it was 12 years ago when Gabe Newell explained the initial vision to us, and this time, there's a far better chance it'll work. \n\n\"Today, every major PC company is building one or more Steam Deck rivals,\" the article points out. \"But without Valve's blessing and support, they're saddled with a Windows OS that doesn't start, pause, and resume games quickly and seamlessly enough to feel portable and easy...\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Is+Valve+Letting+Third+Parties+Create+SteamOS+Hardware%3F%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F12%2F07%2F0259225%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F12%2F07%2F0259225%2Fis-valve-letting-third-parties-create-steamos-hardware%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://games.slashdot.org/story/24/12/07/0259225/is-valve-letting-third-parties-create-steamos-hardware?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23544199&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Silicon Valley hitters take over Trump transition team: “a dozen Musk allies”","url":"https://techcrunch.com/2024/12/06/silicon-valley-hitters-take-over-trump-transition-team-a-dozen-musk-allies/","date":1733554183,"author":"Connie Loizos","unread":true,"desc":"","content":"<p>About a &#8220;dozen Musk allies&#8221; have put a pin in their daily routines to serve as unofficial advisers to the Trump transition effort, says the New York Times.  Among them, reports the outlet: Jared Birchall, the head of Elon Musk’s family office, has interviewed a few candidates for jobs at the State Department; Marc Andreessen [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Paytm sells PayPay stake to SoftBank for $279.2 million","url":"https://techcrunch.com/2024/12/06/paytm-sells-paypay-stake-to-softbank-for-279-2-million/","date":1733556384,"author":"Manish Singh","unread":true,"desc":"","content":"<p>Paytm has agreed to sell its stake in Japanese payments firm PayPay to SoftBank for $279.2 million, as the Indian firm sheds non-core assets following a bruising regulatory clampdown earlier this year. The sale of Paytm&#8217;s stake in PayPay, which it received through acquisition rights six years ago, follows months of restructuring that saw the [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Does the New 'Y2K' Comedy/Disaster/Horror Film Give the '90s the Ending It Deserved?","url":"https://entertainment.slashdot.org/story/24/12/07/0050228/does-the-new-y2k-comedydisasterhorror-film-give-the-90s-the-ending-it-deserved?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733560440,"author":"EditorDavid","unread":true,"desc":"","content":"The new movie Y2K is either a comedy or a disaster/horror film, according to Wikipedia. The film \"imagines a turn of the century where the machines don't just glitch or stop working,\" writes the Hollywood Reporter. \"They go full homicidal.\" With a cast that includes 1990s icons like Alicia Silverstone and the lead singer for the Napster-loving 1990s metal band Limp Bizkit, the movie \"gives the '90s the ending it deserved,\" according to the article. \nThey interviewed the film's director (and co-writer and co-star) Kyle Mooney, best-known for SNL, starting by complimenting this fidelity to the tech of its day. \"The film opens with a high schooler getting home and logging into AOL Instant Messenger, which is not a scene I think I've ever seen in another movie.\n\n\nMooney: All of my relationships, between 17 and 22 years old, were short-lived and spawned because I was most confident flirting on Instant Messager.... \n\nQ: The tech here is such a huge part of the story. Were there any logos or brands you had a tough time getting on camera? \n\n\nMooney: Definitely. This isn't really a spoiler, but Jaeden Martell's character's computer &mdash; the one that we open up with him logging into AOL &mdash; eventually turns into a robot. That was supposed to be an iMac. But I don't think Apple wanted their machines strangling people or whatever the robot does &mdash; so we had to change the look of it by, like, 30 percent. There were a few instances like that, where we couldn't get the exact thing, but we were allowed to get as close as possible.\n \nDeadline's article includes a spoiler about the film, but also this interesting note about two of its young actors, Julian Dennison and Jaeden Martell\"\n[A]lthough Dennison and Martell were both born after 2000, they enjoyed slipping into the \"lack of convenience and the lack of technology\" that came with the era. \n\n\"I wish I got to experience that. I wish I didn't live in the age of everything being so accessible,\" said Martell.\n \n\nAnd apparently the movie also incldues a quick shout-out to Myspace co-founder Tom Anderson.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Does+the+New+'Y2K'+Comedy%2FDisaster%2FHorror+Film+Give+the+'90s+the+Ending+It+Deserved%3F%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F24%2F12%2F07%2F0050228%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F24%2F12%2F07%2F0050228%2Fdoes-the-new-y2k-comedydisasterhorror-film-give-the-90s-the-ending-it-deserved%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://entertainment.slashdot.org/story/24/12/07/0050228/does-the-new-y2k-comedydisasterhorror-film-give-the-90s-the-ending-it-deserved?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23544107&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"KDE Starts December By Landing A Number Of New Features","url":"https://www.phoronix.com/news/KDE-New-Features-December-2024","date":1733568441,"author":"Michael Larabel","unread":true,"desc":"","content":"While the winter holidays are quickly approaching, KDE developers remain very busy working on new feature code for the Plasma 6.3 desktop. A number of new features were merged this week for the KDE desktop...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The Economic Impact of Stochastic Equilibrium: Price Distortions, Interest Rates, and Welfare","url":"https://hackernoon.com/the-economic-impact-of-stochastic-equilibrium-price-distortions-interest-rates-and-welfare?source=rss","date":1733569215,"author":"Keynesian Technology","unread":true,"desc":"","content":"<p>:::info\n<strong>Author:</strong></p>\n<p>(1) David Staines.</p>\n<p>:::</p>\n<h2 id=\"tableoflinks\">Table of Links</h2>\n<p><a href=\"http://hackernoon.com/preview/uyx9WMw9Ltojw9OS5vs9\">Abstract</a></p>\n<p><a href=\"https://hackernoon.com/preview/ZIgNZqHoF0601jU9Yd07\">1 Introduction</a></p>\n<p><a href=\"http://hackernoon.com/preview/Ox9NgolV9SMcVOL3hdXN\">2 Mathematical Arguments</a></p>\n<p><a href=\"http://hackernoon.com/preview/dn9DayvMXSIGpfrTpY41\">3 Outline and Preview</a></p>\n<p><a href=\"http://hackernoon.com/preview/FUZKa4KxzcUbIs7ke5pR\">4 Calvo Framework and 4.1 Household’s Problem</a></p>\n<p><a href=\"http://hackernoon.com/preview/sIO7xiaYO8C1llssuP6a\">4.2 Preferences</a></p>\n<p><a href=\"https://hackernoon.com/preview/1X278EahtXnNIbxX5dCW\">4.3 Household Equilibrium Conditions</a></p>\n<p><a href=\"https://hackernoon.com/preview/3ANzF04A0xQukwEtsu51\">4.4 Price-Setting Problem</a></p>\n<p><a href=\"http://hackernoon.com/preview/AacIW8BgoW9dNHQEGWVg\">4.5 Nominal Equilibrium Conditions</a></p>\n<p><a href=\"http://hackernoon.com/preview/zuDC2hxZ7kw6LVxMARfx\">4.6 Real Equilibrium Conditions and 4.7 Shocks</a></p>\n<p><a href=\"http://hackernoon.com/preview/xStW3QAHIQ0cpLZD1OON\">4.8 Recursive Equilibrium</a></p>\n<p><a href=\"http://hackernoon.com/preview/QqkO3ulUFHUCxmnvUJSK\">5 Existing Solutions</a></p>\n<p><a href=\"http://hackernoon.com/preview/hOwMh9Y4n5vdO514V0yn\">5.1 Singular Phillips Curve</a></p>\n<p><a href=\"http://hackernoon.com/preview/vptCcaMouXE9yf1abPf1\">5.2 Persistence and Policy Puzzles</a></p>\n<p><a href=\"http://hackernoon.com/preview/DEsiBbeDaMIg15HTLWkJ\">5.3 Two Comparison Models</a></p>\n<p><a href=\"http://hackernoon.com/preview/ZSBMi2oQTseB7ZyQ1JKG\">5.4 Lucas Critique</a></p>\n<p><a href=\"http://hackernoon.com/preview/blzRoSmvjR2uuSEyDKrB\">6 Stochastic Equilibrium and 6.1 Ergodic Theory and Random Dynamical Systems</a></p>\n<p><a href=\"http://hackernoon.com/preview/QDQW1S8Q5h46nkC4fM3e\">6.2 Equilibrium Construction</a></p>\n<p><a href=\"http://hackernoon.com/preview/0ei7VFkLuYa6JdHKsD6Z\">6.3 Literature Comparison</a>Dynamic Stochastic Models</p>\n<p><a href=\"http://hackernoon.com/preview/dLziEtGBVGFfvQUXzDJI\">6.4 Equilibrium Analysis</a></p>\n<p><a href=\"http://hackernoon.com/preview/SdcfOqKZykHpcWQPiIct\">7 General Linearized Phillips Curve</a></p>\n<p><a href=\"http://hackernoon.com/preview/iypPPaeDhMdZGx2akBZ4\">7.1 Slope Coefficients</a></p>\n<p><a href=\"http://hackernoon.com/preview/RqFy7TI1uqMGpCvpve2e\">7.2 Error Coefficients</a></p>\n<p><a href=\"http://hackernoon.com/preview/85lJ51v1Dsws9ykxfu4p\">8 Existence Results and 8.1 Main Results</a></p>\n<p><a href=\"http://hackernoon.com/preview/zzIi4N5ixIelYHfT5sTx\">8.2 Key Proofs</a></p>\n<p><a href=\"http://hackernoon.com/preview/FVAao2EtI9vwzwMNdh8m\">8.3 Discussion</a></p>\n<p><a href=\"http://hackernoon.com/preview/KfPH2s1mILQMe4Jj7gXI\">9 Bifurcation Analysis</a></p>\n<p><a href=\"http://hackernoon.com/preview/xnTSinjEsdL29SBxATnC\">9.1 Analytic Aspects</a></p>\n<p><a href=\"http://hackernoon.com/preview/22ZXLhfJfeZ35jBKBGRQ\">9.2 Algebraic Aspects (I) Singularities and Covers</a></p>\n<p><a href=\"http://hackernoon.com/preview/I4RprRIjweo4ywRKlwdq\">9.3 Algebraic Aspects (II) Homology</a></p>\n<p><a href=\"http://hackernoon.com/preview/yfiKLwacpwUGroL41l4x\">9.4 Algebraic Aspects (III) Schemes</a></p>\n<p><a href=\"http://hackernoon.com/preview/T33qJRzfZ0deHIwGHDLJ\">9.5 Wider Economic Interpretations</a></p>\n<p><a href=\"http://hackernoon.com/preview/HtaFM29Er6pH8z4oRD8S\">10 Econometric and Theoretical Implications and 10.1 Identification and Trade-offs</a></p>\n<p><a href=\"http://hackernoon.com/preview/qXbtvQBEZb7oNsNoz1h7\">10.2 Econometric Duality</a></p>\n<p><a href=\"http://hackernoon.com/preview/uWGTFc8aphTr3zCCbzdl\">10.3 Coefficient Properties</a></p>\n<p><a href=\"http://hackernoon.com/preview/fzMP4XBI3ONvEAxWG92t\">10.4 Microeconomic Interpretation</a></p>\n<p><a href=\"https://hackernoon.com/preview/F7WRdhuITBSL9cPy4uy7\">11 Policy Rule</a></p>\n<p><a href=\"http://hackernoon.com/preview/Q0XX8nBc6Eka2r254jcQ\">12 Conclusions and References</a></p>\n<p>\\\n<strong>Appendices</strong></p>\n<p><a href=\"http://hackernoon.com/preview/iKsmuHGIBBgNDVOUZw3c\">A Proof of Theorem 2 and A.1 Proof of Part (i)</a></p>\n<p><a href=\"http://hackernoon.com/preview/LMORRhI0HgMLamp13ycv\">A.2 Behaviour of ∆</a></p>\n<p><a href=\"http://hackernoon.com/preview/F5JGbmO1E9u41MfrjCBc\">A.3 Proof Part (iii)</a></p>\n<p><a href=\"http://hackernoon.com/preview/CMx3eEYMArEpMRogrekF\">B Proofs from Section 4 and B.1 Individual Product Demand (4.2)</a></p>\n<p><a href=\"http://hackernoon.com/preview/yj9Bmvu9zZvIgNRih0hu\">B.2 Flexible Price Equilibrium and ZINSS (4.4)</a></p>\n<p><a href=\"https://hackernoon.com/preview/xRgLDb2d8CjyjW1DLHBW\">B.3 Price Dispersion (4.5)</a></p>\n<p><a href=\"http://hackernoon.com/preview/smkOAIbsphjj6J0F5OHW\">B.4 Cost Minimization (4.6) and (10.4)</a></p>\n<p><a href=\"https://hackernoon.com/preview/Okg4eRAefwR7FEcWpIrz\">B.5 Consolidation (4.8)</a></p>\n<p><a href=\"https://hackernoon.com/preview/XwEQ6gTdV7PANwVitZzp\">C Proofs from Section 5, and C.1 Puzzles, Policy and Persistence</a></p>\n<p><a href=\"https://hackernoon.com/preview/5vzDmc66f6ikhvHPRkLN\">C.2 Extending No Persistence</a></p>\n<p><a href=\"https://hackernoon.com/preview/kODrxuHhXl5hs6b6mOry\">D Stochastic Equilibrium and D.1 Non-Stochastic Equilibrium</a></p>\n<p><a href=\"https://hackernoon.com/preview/CqACFOg5T3IPuqR0aMi9\">D.2 Profits and Long-Run Growth</a></p>\n<p><a href=\"https://hackernoon.com/preview/kl5IMEcFeQCCap4GvXIi\">E Slopes and Eigenvalues and E.1 Slope Coefficients</a></p>\n<p><a href=\"https://hackernoon.com/preview/bCVd401yV93qGFoqHKLX\">E.2 Linearized DSGE Solution</a></p>\n<p><a href=\"https://hackernoon.com/preview/4Py21vYpAfl8jnx7DbKK\">E.3 Eigenvalue Conditions</a></p>\n<p><a href=\"https://hackernoon.com/preview/UHYrMu85ooFZ02a9Wokb\">E.4 Rouche’s Theorem Conditions</a></p>\n<p><a href=\"https://hackernoon.com/preview/nCeJW8h82lft186XQzH3\">F Abstract Algebra and F.1 Homology Groups</a></p>\n<p><a href=\"https://hackernoon.com/preview/OUmQMNxJRsyrsgg93Qym\">F.2 Basic Categories</a></p>\n<p><a href=\"https://hackernoon.com/preview/fC47HCRvrUr4nmmluXqP\">F.3 De Rham Cohomology</a></p>\n<p><a href=\"https://hackernoon.com/preview/bVDBZJMaqZGCAqDeV3So\">F.4 Marginal Costs and Inflation</a></p>\n<p><a href=\"https://hackernoon.com/preview/AvnCvEhEmfqAKbRP6Van\">G Further Keynesian Models and G.1 Taylor Pricing</a></p>\n<p><a href=\"https://hackernoon.com/preview/4nXiPTxsAuqdwJ2a6hFD\">G.2 Calvo Wage Phillips Curve</a></p>\n<p><a href=\"https://hackernoon.com/preview/3WYFkroF82W7h3H7nUow\">G.3 Unconventional Policy Settings</a></p>\n<p><a href=\"https://hackernoon.com/preview/SIsqwWfQNFbqty2fWKih\">H Empirical Robustness and H.1 Parameter Selection</a></p>\n<p><a href=\"https://hackernoon.com/preview/YUwABztQJGjaFCd1Wltc\">H.2 Phillips Curve</a></p>\n<p><a href=\"https://hackernoon.com/preview/Wi68rRHgQqt4KxPALKhL\">I Additional Evidence and I.1 Other Structural Parameters</a></p>\n<p><a href=\"http://hackernoon.com/preview/CM05jd1h0TrSdEGrOkcE\">I.2 Lucas Critique</a></p>\n<p><a href=\"https://hackernoon.com/preview/Y3b4ldiv40xNH1cYjRjw\">I.3 Trend Inflation Volatility</a></p>\n<h2 id=\"64equilibriumanalysis\">6.4 Equilibrium Analysis</h2>\n<p>This final part sets out local and global properties learned from applying basic analysis techniques and then moves onto discuss their economic and mathematical significance.</p>\n<p>\\\n<strong>Theorem 2. <em>(Surface Estimates / Comparative Statics)</strong></em></p>\n<p>\\\n<em>The following relationships exist between stochastic and non-stochastic values</em></p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-i38309j.png\" alt=\"\" /></p>\n<p>\\\nProofs typically involve applications of Jensen’s and covariance inequalities, along with monotonicity arguments. They are contained in the Appendix A. The next result has a comparative statics flavour but a different style proof. It will be used to specify the distributional consequences of moving from a Non stochastic to a stochastic environment. Beforehand, it is necessary to set out a couple of assumptions defended later on.</p>\n<p>\\\n<strong>Assumption 1.</strong> <em>One of the following statements is true: (i) the kernel of the stochastic discount factor M = Eu ′ (Y )/u′ (Y ) covaries positively with profits (ii) all shocks are small (iii) discount factor shocks are small and profits are procyclical (in the sense that Π is stochastically monotone with respect to Y )</em></p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-zd930bm.png\" alt=\"\" /></p>\n<p>\\\n<strong>Assumption 2.</strong> EA <em>is sufficiently large relative to ∆.</em></p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-sfa300q.png\" alt=\"\" /></p>\n<p>\\\nThe first part follows from the construction of stochastic equilibrium, a suitable comparison of the resetters problem and the distribution of profits at a point in time. The proof of the second part has a microeconomic flavour, involving a suitable Slutsky decomposition. The subsequent remarks clarify the role and significance of the assumptions.</p>\n<p>\\\n<strong>Remark 8.</strong> <em>Suppose the economy could accommodate a positive growth rate then we could guarantee that the normalized value of profits with shocks EΠ/A would be below its non-stochastic counterpart. Suppose the economy could accommodate a positive growth rate then we could guarantee that the normalized value of profits with shocks EΠ/A would be below its non-stochastic counterpart.</em></p>\n<p>\\\nThis idea is fleshed out in Appendix D.2.3. Alternatively we could scale down the units of the labor endowment to make A arbitrarily large.</p>\n<p>\\\n<strong>Remark 9.</strong> <em>Assumption 1(i) and (iii) the more appealing alternatives, are not primitive restrictions, thus Proposition 13 is not a true quantitative estimate. Nevertheless, I suspect that a more appealing primitive restriction may arise as a bi-product of rigorous global analysis of the model.</em></p>\n<p>\\\nMacroeconomists have traditionally grouped variables into pro and countercyclical, in order to summarize information about the economy. The assumption that gross profits are pro-cyclical is a very weak one. Sales are pro-cyclical (in this model) by definition. Markups would have to be strongly countercyclical to overcome this. In fact recent evidence suggests they are pro-cyclical.[51]Hence, these conditions suffice from an empirical point of view but not from a mathematical vantage, as we have not demonstrated this prediction is consistent with the model. Nevertheless, the approach may be of interest to economic theorists, as it allows one to derive rigorous predictions, without the complexities of in-depth mathematical analysis.[52]</p>\n<p>\\\nFinally, I am able to confirm that in the patient limit the serious pathology of negative stock prices does not arise.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-hnb30er.png\" alt=\"\" /></p>\n<p>\\\nThis problem can afflict alternative models with costly price changes. The intuition behind the proof is that as discounting dies away, the value of the firm is dominated by prices in the distant future, by which time the firm will in expectation have had an opportunity to reset its prices and from the point of view of the present, uncertainty will recede as stochastic equilibrium is approached. The result confirms the reconciliation of classical theories of entry and exit with sticky prices- thus supporting neoclassical synthesis and completing this round of comparative analysis.</p>\n<p>\\\nTherefore, the likely distributional consequences of incorporating uncertainty can be summarized as follows. Relative price distortions will decrease the value of output, which will decrease wages and real marginal costs. In equilibrium, output will fall and labor input will have to increase to make up for some but not all the loss of effective productivity. Profitability will fall. Welfare is lower, indicating that volatility is costly. Finally, uncertainty will cause the interest rate to drop. These findings feel economically intuitive and for the most part should stand up to alternative model details, although the labor supply prediction might change with additional frictions.</p>\n<p>\\\nTherefore, the likely distributional consequences of incorporating uncertainty can be summarized as follows. Relative price distortions will decrease the value of output, which will decrease wages and real marginal costs. In equilibrium, output will fall and labor input will have to increase to make up for some but not all the loss of effective productivity. Profitability will fall. Welfare is lower, indicating that volatility is costly. Finally, uncertainty will cause the interest rate to drop. These findings feel economically intuitive and for the most part should stand up to alternative model details, although the labor supply prediction might change with additional frictions.</p>\n<p>\\\nMoreover, the new construction offers further applications.</p>\n<p>\\\n<strong>Corollary 2.</strong> <em>When β → 1 the real interest rate r = i − π < 0</em></p>\n<p>\\\n<em>Proof</em>. Follows immediately from Theorem 3 (i) and sending β → 1, whilst keeping the shock size fixed.</p>\n<p>\\\nVery low interest rates were widely documented from the 2008 Global Financial Crisis until the early stages of the COVID pandemic. Long run rates indicate these were expected to continue for a long time.[53] Prominent studies, such as Del Negro et al. [2019], estimated a negative natural rate and estimates fell further during the acute stage of the pandemic (see for example Van der Ghote [2021]). However, non-stochastic growth models cannot support real rates below growth rates.</p>\n<p>\\\nIt is intuitive that in a stochastic environment, government debt without default risk can command a safety (negative risk) premium. Brunnermeier et al. [2020] are able to demonstrate this by deriving a closed form solution to a model, with a financial sector and a bubble in the government debt, solved in continuous time. I am able to dispense with these esoteric assumptions. I therefore show, that this prediction is in fact a general consequence of risk aversion, a fundamental economic mechanism.</p>\n<p>\\\nIn general, the analysis mediates in favor of discrete over continuous time for the majority of macroeconomic applications. Macroeconomists typically adopt continuous time in search of closed form solutions. These require strong functional form assumptions, typically Brownian motion (also called a Wiener process.) Furthermore, unless you have high frequency data, it makes convincing econometrics more challenging. On the other hand, discrete time stochastic equilibrium analysis allows one to obtain quasi-closed forms without specifying particular error distributions, with easily interpretable existence conditions. It also avoids challenges with ascertaining whether derivatives exist, which may not be intuitive in many economic situations.</p>\n<p>\\\nFinally, stochastic surface solutions provide a promising avenue for parametric comparative statics. Under the limiting assumption justifying the use of standard linearization techniques, we can simply transfer results from the nonstochastic steady state to neighboring stochastic environments. It is instructive to look beyond this case at the effect of larger shocks on comparative statics. I focus on the simplest relationship between price dispersion and the inflation target π.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-14c30jr.png\" alt=\"\" /></p>\n<p>\\\nGeometrically the inflation-price dispersion schedule is shifted up and translated to the left in the range of primary interest. Price dispersion will be minimized at a negative rate of trend inflation. This might provide a rationale for deflationary policy.[54] This also has a dynamic interpretation. Stochastic equilibrium pulls down dynamic behavior of price dispersion from a positive trend inflation environment to zero and nearby negative rates of inflation. It suggests there need not be a difference in dynamic behavior between low trend inflation and the low rates of trend deflation typically observed. Hirose [2020] is the only paper I know of to date that looks at trend deflation, in the context of Japan, and he works with a prior trend centered at just −0.214% (see their seventeenth footnote).</p>\n<p>\\\nLastly, the analysis here could be of general mathematical and statistical interest. Firstly, the Theorem is an example of mathematical rigidity, in the sense that I have deduced important statistical properties of the solution by analyzing just a single neighborhood. Secondly, the results constitute sharp a priori quantitative estimates of important expectation functionals. They are sharp because the non-stochastic steady state is the limit of the stochastic steady state. They are a priori because we have not yet proven the solution exists; in some instances we will see that a solution does not exist.</p>\n<p>\\\nIn econometric terms, they represent over-identifying conditions. They constitute restrictions on the solution associated with the need for infinite horizon optimization problems to exist. They are the analogy of the steady state that provide additional restrictions on the coefficients of any reduced form representation, like the one presented in the next section. These kind of conditions are rarely seen in statistics where exact identification is predominant or mathematical physics where under-identification is ubiquitous.[55]</p>\n<p>\\</p>\n<p>:::info\n<strong>Author:</strong></p>\n<p>(1) David Staines.</p>\n<p>:::</p>\n<hr />\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/pdf/2312.16214.pdf\">available on arxiv</a> under CC 4.0 license.</p>\n<p>:::</p>\n<hr />\n<p>[49] This applies even if we expand our definition of a preference shock to include any disturbance to the financial system. Changes in policy-making have arguably been more significant in many periods- as suggested by studies such as Stock and Watson [2002], Muir [2017] and Ascari et al. [2019].</p>\n<p>\\\n[50] This means that P(Y (Π1) ≤ y) ≤ P(Y (Π2) ≤ y) if and only if Π1 ≤ Π2.</p>\n<p>\\\n[51] Nekarda and Ramey [2020] show that the inverse labor share measure directly pertaining to this model is pro-cyclical. Using detailed micro data, Anderson et al. [2023] conclude retail mark ups are weakly pro-cyclical. Domowitz et al. [1986] uncovered similar patterns for manufacturing. Fariñas and Huergo [2003] and Macallan et al. [2008] provide corroborating evidence for a wider set of countries and industries. Nekarda and Ramey [2020] describe how procedures involving more sophisticated production functions can lead to different results that are not relevant in the present setting. Finally, they note how cyclicality would be expected to depend on the distribution of shocks. With Keynesian intuition and their econometric strategy, they suggest that markups were pro-cyclical in response to technology shocks but counter-cyclical when there were shocks to investment.</p>\n<p>\\\n[52] This strategy should combine profitably with simulations to verify the assumptions.</p>\n<p>\\\n[53] On July 11th 2020 The Economist reported that Austrian 100 year bonds were yielding just 0.7%. At the ECB’s official target of 2% and assuming a trend growth rate of 2% then it would be reasonable to calculate r − g = −3%.</p>\n<p>\\\n[54] On this theme, Yun [2005] uses price dispersion to justify temporary deflation in a nonstochastic environment. Schmitt-Grohé and Uribe [2010] discusses alternative rationale for negative inflation. On the other hand, Adam and Weber [2019] are able to rationalize positive inflation by adding heterogeniety in firm level productivity growth into our Calvo framework.</p>\n<p>\\\n[55] For example, in quantum theory Heisenberg’s uncertainty principle (Heisenberg [1927]) tells us that we cannot know the position and the velocity of an electron, so given the velocity of an electron, its position is unidentified. Conversely, given the speed the position is unidentifiedhence the system as a whole is under-identified. String theorists are interested by mirror symmetry where different shaped universes are observationally equivalent through certain topological lenses (see Greene [2000] and Hartnett [2018]). There are exceptions, for example, researchers studying small sets of rigid bodies that are over-determined. Nevertheless, the concept of over-identification, central to structural econometrics, would seem foreign to the majority of mathematical physicists and the particular kind here are surely novel. This likely explains the failure of mean field game theory to gain traction over DSGE.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Microsoft's Azure Linux 3.0 Adds 64K Kernel Option, NFTables & Intel E800 Networking","url":"https://www.phoronix.com/news/Azure-Linux-3.0.20241203","date":1733570287,"author":"Michael Larabel","unread":true,"desc":"","content":"Microsoft engineers rounded out their work week by releasing Azure Linux 3.0.20241203 on Friday evening as the newest monthly installment for their in-house Linux distribution...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"AMD Hardware Feedback Interface \"HFI\" Patches Updated For The Linux Kernel","url":"https://www.phoronix.com/news/AMD-HFI-v7-Linux","date":1733571060,"author":"Michael Larabel","unread":true,"desc":"","content":"While there are many great new features in Linux 6.13 like the AMD 3D V-Cache Optimizer driver, one of the features that wasn't buttoned up in time for this current kernel cycle were the patches implementing the AMD Hardware Feedback Interface (HFI). But that work remains ongoing and last week brought the seventh iteration of the patches...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"UMD Direct Submission \"Proof Of Concept\" For The Intel Xe Linux Driver","url":"https://www.phoronix.com/news/UMD-Direct-Submit-Intel-Xe","date":1733572713,"author":"Michael Larabel","unread":true,"desc":"","content":"One of the interesting Intel Xe Linux kernel graphics driver patches that was volleyed for discussion last month is working on user-mode driver (UMD) direct submission support for allowing work to be directly submitted from user-space to the GPU hardware and avoiding some of the overhead of the kernel driver interactions...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Machine Learning Reveals the Faces Behind Viral QAnon Posts","url":"https://hackernoon.com/machine-learning-reveals-the-faces-behind-viral-qanon-posts?source=rss","date":1733572810,"author":"Ethnology","unread":true,"desc":"","content":"<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Florian Cafiero (ORCID 0000-0002-1951-6942), Sciences Po, Medialab;</p>\n<p>(2) Jean-Baptiste Camps (ORCID 0000-0003-0385-7037), Ecole nationale des chartes, Universite Paris, Sciences &amp; Lettres.</p>\n<p>:::</p>\n<h2 id=\"tableoflinks\">Table of Links</h2>\n<p><a href=\"http://hackernoon.com/preview/7PlOj9IaUHuPWIn6ndic\">Abstract and Introduction</a></p>\n<p><a href=\"http://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Why work on QAnon? Specificities and social impact</a></p>\n<p><a href=\"https://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Who is Q? The theories put to test</a> </p>\n<p><a href=\"http://hackernoon.com/preview/aicG2Yd8jIeRIbXraDG7\">Authorship attribution</a></p>\n<p><a href=\"http://hackernoon.com/preview/i0BVXUT0mQA45QgINvPh\">Results</a></p>\n<p><a href=\"http://hackernoon.com/preview/oL01AD0l0ZcQ2BhP8qeR\">Discussion</a></p>\n<p><a href=\"http://hackernoon.com/preview/7owyHKl0XuVw95ZW2bdk\">Corpus constitution</a></p>\n<p><a href=\"http://hackernoon.com/preview/APNLYr8JzgY6w7I9G4qp\">Quotes of authors outside of the corpus have been</a></p>\n<p><a href=\"http://hackernoon.com/preview/SVjRo1fXLQRXSmoB9QB4\">Definition of two subcorpus: dealing with generic difference and an imbalanced dataset</a></p>\n<p><a href=\"http://hackernoon.com/preview/rc3mv0jW24sMSu0SFn2r\">The genre of “Q drops”: a methodological challenge</a></p>\n<p><a href=\"http://hackernoon.com/preview/i772YMbF0pIqvo5FrdtN\">Detecting style changes: rolling stylometry</a></p>\n<p><a href=\"http://hackernoon.com/preview/tFWtNclFbFXQOBmlhVwP\">Ethical statement, Acknowledgements, and References</a></p>\n<h2 id=\"abstract\">Abstract</h2>\n<p>A series of social media posts signed under the pseudonym “Q”, started a movement known as QAnon, which led some of its most radical supporters to violent and illegal actions. To identify the person(s) behind Q, we evaluate the coincidence between the linguistic properties of the texts written by Q and to those written by a list of suspects provided by journalistic investigation. To identify the authors of these posts, serious challenges have to be addressed.</p>\n<p>\\\nThe “Q drops” are very short texts, written in a way that constitute a sort of literary genre in itself, with very peculiar features of style. These texts might have been written by different authors, whose other writings are often hard to find. After an online ethnology of the movement, necessary to collect enough material written by these thirteen potential authors, we use supervised machine learning to build stylistic profiles for each of them. We then performed a rolling analysis on Q’s writings, to see if any of those linguistic profiles match the so-called ‘QDrops’ in part or entirety. We conclude that two different individuals, Paul F. and Ron W., are the closest match to Q’s linguistic signature, and they could have successively written Q’s texts. These potential authors are not high-ranked personality from the U.S. administration, but rather social media activists.</p>\n<h2 id=\"introduction\">Introduction</h2>\n<p>The QAnon movement revolves around the posts of one or more individuals signing their message under the name “Q” on online forums. These messages first appeared in October 2017 on 4chan, a popular imageboard known for its appreciation of the anime culture, its memes, but also for its \\pol\\board, dedicated to “politically incorrect” contents.</p>\n<p>\\\nQ’s messages were later on posted on 8chan (now 8kun), a competing imageboard created after 4chan, considered as a place allowing even more “free-speech”, and in particular, letting users easily create a “board” regarding the topic of their choice (Baele et al., 2021). But who wrote these messages? The QAnon supporters see in Q one or a few top-rank personalities around Donald Trump, maybe Trump himself. Journalistic investigations point on the contrary to social media activists (Zadrozny and Collins, 2018).</p>\n<p>\\</p>\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2303.02078\">available on arxiv</a> under CC BY 4.0 DEED license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Social Impacts, Global Reach, and the Mystery of 'Q'","url":"https://hackernoon.com/social-impacts-global-reach-and-the-mystery-of-q?source=rss","date":1733573711,"author":"Ethnology","unread":true,"desc":"","content":"<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Florian Cafiero (ORCID 0000-0002-1951-6942), Sciences Po, Medialab;</p>\n<p>(2) Jean-Baptiste Camps (ORCID 0000-0003-0385-7037), Ecole nationale des chartes, Universite Paris, Sciences &amp; Lettres.</p>\n<p>:::</p>\n<h2 id=\"tableoflinks\">Table of Links</h2>\n<p><a href=\"http://hackernoon.com/preview/7PlOj9IaUHuPWIn6ndic\">Abstract and Introduction</a></p>\n<p><a href=\"http://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Why work on QAnon? Specificities and social impact</a></p>\n<p><a href=\"https://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Who is Q? The theories put to test</a> </p>\n<p><a href=\"http://hackernoon.com/preview/aicG2Yd8jIeRIbXraDG7\">Authorship attribution</a></p>\n<p><a href=\"http://hackernoon.com/preview/i0BVXUT0mQA45QgINvPh\">Results</a></p>\n<p><a href=\"http://hackernoon.com/preview/oL01AD0l0ZcQ2BhP8qeR\">Discussion</a></p>\n<p><a href=\"http://hackernoon.com/preview/7owyHKl0XuVw95ZW2bdk\">Corpus constitution</a></p>\n<p><a href=\"http://hackernoon.com/preview/APNLYr8JzgY6w7I9G4qp\">Quotes of authors outside of the corpus have been</a></p>\n<p><a href=\"http://hackernoon.com/preview/SVjRo1fXLQRXSmoB9QB4\">Definition of two subcorpus: dealing with generic difference and an imbalanced dataset</a></p>\n<p><a href=\"http://hackernoon.com/preview/rc3mv0jW24sMSu0SFn2r\">The genre of “Q drops”: a methodological challenge</a></p>\n<p><a href=\"http://hackernoon.com/preview/i772YMbF0pIqvo5FrdtN\">Detecting style changes: rolling stylometry</a></p>\n<p><a href=\"http://hackernoon.com/preview/tFWtNclFbFXQOBmlhVwP\">Ethical statement, Acknowledgements, and References</a></p>\n<h2 id=\"whyworkonqanonspecificitiesandsocialimpact\">Why work on QAnon? Specificities and social impact</h2>\n<p>The violence of the QAnon believers is not unprecedented nor unmatched on social networks. For instance, discussions around QAnon on Voat, a Redditlike forum attracting many alt-right and QAnon supporters, even show less toxicity than elsewhere in average on the rest of this admittedly very specific platform (Papasavva et al., 2021). The singularity of this online group mostly resides in how much its theories have spread, and on its important consequences in real life.</p>\n<p>\\\nConsidered a potential domestic terrorist threat by the FBI since 2018 (Winter, 2019), the most radical QAnon supporters were implicated in a variety of criminal incidents and violent events (Garry et al., 2021). Recent research has shown that, beyond political orientation, the main common trait between people arrested for breaking into the United States Capitol in Washington on January 6, 2021 (Kaplan, 2021) was that they believed in the QAnon narrative. Documented in the press (Gilbert, 2021), the high impact of the QAnon theories on the social life of its believers has been compared to the “conversion to a cult or high-pressure religious group” (Kaplan, 2021).</p>\n<p>\\\nQAnon also affected people far beyond the U.S. borders, spreading in particular through social media and instant messaging software. A large-scale study on QAnon on Telegram for instance showed that messages in German even outnumbered at some point the posts written in English, and that posts in German and Portuguese used an even more “toxic” language (Hoseini et al., 2021).</p>\n<p>\\</p>\n<h2 id=\"whoisqthetheoriesputtotest\">Who is Q? The theories put to test</h2>\n<p>Theories regarding the author behind the posts signed “Q” fit into two main categories. Believers in the authenticity of the source argue that a single source or a collective of people from U.S. intelligence agencies would have authored the various posts. Persons cited as a plausible author or coauthor of Q range from General Michael Flynn to Donald J. Trump or his entourage (Huback, 2021).</p>\n<p>\\\nA second group of theory states that one person would have posted as Q, but without having any specific access to exclusive and reliable sources. NBC reporters claimed that they had traced the success of QAnon to three people: ‘Pamphlet Anon’, a.k.a. Coleman R., ‘BaruchtheScribe’, a.k.a. Paul F., and ‘Tracy Beanz’, a.k.a. Tracy D.(Zadrozny and Collins, 2018).</p>\n<p>\\\nFrederick Brennan, inventor of 8chan, claims that Ron and John W. are paying someone to carry on as Q, or are even acting as Q themselves (Huback, 2021). The third group of theories holds that Q is a collective, with a small number of people sharing access to the account. This third category “includes the notion that Q is a new kind of open-source military-intelligence agency” (LaFrance, 2020).</p>\n<p>\\</p>\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2303.02078\">available on arxiv</a> under CC BY 4.0 DEED license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Stylometry Reveals Clues About the Authorship Behind QAnon","url":"https://hackernoon.com/stylometry-reveals-clues-about-the-authorship-behind-qanon?source=rss","date":1733574610,"author":"Ethnology","unread":true,"desc":"","content":"<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Florian Cafiero (ORCID 0000-0002-1951-6942), Sciences Po, Medialab;</p>\n<p>(2) Jean-Baptiste Camps (ORCID 0000-0003-0385-7037), Ecole nationale des chartes, Universite Paris, Sciences &amp; Lettres.</p>\n<p>:::</p>\n<h2 id=\"tableoflinks\">Table of Links</h2>\n<p><a href=\"http://hackernoon.com/preview/7PlOj9IaUHuPWIn6ndic\">Abstract and Introduction</a></p>\n<p><a href=\"http://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Why work on QAnon? Specificities and social impact</a></p>\n<p><a href=\"https://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Who is Q? The theories put to test</a> </p>\n<p><a href=\"http://hackernoon.com/preview/aicG2Yd8jIeRIbXraDG7\">Authorship attribution</a></p>\n<p><a href=\"http://hackernoon.com/preview/i0BVXUT0mQA45QgINvPh\">Results</a></p>\n<p><a href=\"http://hackernoon.com/preview/oL01AD0l0ZcQ2BhP8qeR\">Discussion</a></p>\n<p><a href=\"http://hackernoon.com/preview/7owyHKl0XuVw95ZW2bdk\">Corpus constitution</a></p>\n<p><a href=\"http://hackernoon.com/preview/APNLYr8JzgY6w7I9G4qp\">Quotes of authors outside of the corpus have been</a></p>\n<p><a href=\"http://hackernoon.com/preview/SVjRo1fXLQRXSmoB9QB4\">Definition of two subcorpus: dealing with generic difference and an imbalanced dataset</a></p>\n<p><a href=\"http://hackernoon.com/preview/rc3mv0jW24sMSu0SFn2r\">The genre of “Q drops”: a methodological challenge</a></p>\n<p><a href=\"http://hackernoon.com/preview/i772YMbF0pIqvo5FrdtN\">Detecting style changes: rolling stylometry</a></p>\n<p><a href=\"http://hackernoon.com/preview/tFWtNclFbFXQOBmlhVwP\">Ethical statement, Acknowledgements, and References</a></p>\n<h2 id=\"authorshipattribution\">Authorship attribution</h2>\n<p>To help understanding who might hide behind the pseudonym Q, we rely here on authorship attribution techniques, also known as stylometry (Juola, 2008; Cafiero and Camps, 2022), a term coined at the turn of the 19th century to designate the measure of stylistic affinity between texts (Lutoslawski, 1898). Stylometry tries to spot the idiosyncratic properties of someone’s language, called idiolect (Coulthard, 2004).</p>\n<p>\\\nTo identify a linguistic signature of a person, regardless of the topic of the text it produces, stylometry focuses on deep linguistic properties, less subject to conscious manipulation or to context variation. Linguistic feature such as functions words (“and”, “or”, “upon” etc.) (Kestemont, 2014; Segarra et al., 2015), punctuation (Jin and Jiang, 2012), patterns of “parts-of-speech” (e.g. ‘Proper noun / Verb / Article’, ‘Article / common noun / verb’) (Bjork- ¨ lund and Zechner, 2017) are for instance used in specific combinations by individuals, and are a reliable clue of who is speaking or writing.</p>\n<p>\\\nStudies in psycholinguistics have since shown that functions words and grammatical markers are processed differently by the brain than lexical content words, and are indeed not only revealing of individual use, but also correlate to socio-cultural categories such as gender, age group or native language for instance (Argamon et al., 2009; Pennebaker, 2013). Since a famous study on the authors of the Federalist papers (Mosteller and Wallace, 1963), a review advocating the adoption of the future U.S. constitution, many applications have been made to solve literary or historical controversies, such as Caesar’s contribution to the Commentaries on his wars (Kestemont et al., 2016), or Shakespeare (Plecha´ˇc, 2020) and Moli`ere’s (Cafiero and Camps, 2019, 2021) disputed authorships. It was also used to reveal who may have written Elena Ferrante’s novels (Eder, 2018; Rybicki, 2018; Mikros, 2017) or to recognize J.K. Rowling’s style behind the pseudonym Robert Galbraith (Juola, 2015).</p>\n<p>\\\nApplications to forensic cases have grown in the past decades, being and being more and more used in U.S. courts (Chaski, 2005) among other, and applied to a wide range of cases ranging from immigration disputes (Juola, 2012) to murder investigations (Cafiero and Camps, 2022).</p>\n<p>\\\nPrevious research in this field suggested that there could be more than one author to the Q drops. Stylometric analysis, based on factor analysis on character 3-grams, suggested that there were probably two authors who wrote these texts, one after the other (Orphanalytics, 2020). Analyses of the distribution of the number of character and words in each Qdrops, as well as the use of special characters suggested that two hands could have written the Q drops (Aliapoulios et al., 2021), posts written under one of the 10 tripcodes Q used exhibiting different properties from the rest of them. Examinations of the pictures posted by Q however show that they have mostly been posted from the same Time Zone in Asia, and that original pictures were taken from the same camera all along the period (Fox , pseudo). This is interpreted as a sign that they were would one unique author to the Q drops.</p>\n<p>\\</p>\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2303.02078\">available on arxiv</a> under CC BY 4.0 DEED license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"SpaceX's Thursday Launch Enables Starlink's New Satellite-to-Cellphone Internet Service","url":"https://science.slashdot.org/story/24/12/06/2155256/spacexs-thursday-launch-enables-starlinks-new-satellite-to-cellphone-internet-service?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733574840,"author":"EditorDavid","unread":true,"desc":"","content":"\"SpaceX has launched 20 of its Starlink satellites up into Earth's orbit, enabling direct-to-cellphone connectivity for subscribers anywhere on the planet,\" reports the tech blog New Atlas.\n\nThat completes the constellation's first orbital shell, following a launch of an initial batch of six satellites for testing back in January. The satellites were launched with a Falcon 9 rocket from California's Vandenberg Space Force Base on December 5 at 10 PM EST; they were then deployed in low Earth orbit. SpaceX founder Elon Musk noted on X that the effort will \"enable unmodified cellphones to have internet connectivity in remote areas.\" He added a caveat for the first orbital shell &mdash; \"Bandwidth per beam is only ~10 Mb, but future constellations will be much more capable....\" \n\n\nThe big deal with this new venture is that unlike previous attempts at providing satellite-to-phone service, you don't need a special handset or even a specific app to get access anywhere in the world. Starlink uses standard LTE/4G protocols that most phones are compatible with, partners with mobile operators like T-Mobile in the U.S. and Rogers in Canada, and has devised a system to make its service work seamlessly with your phone when it's connecting to satellites 340 miles (540 km) above the Earth's surface. The SpaceX division noted it's also worked out latency constraints, ideal altitudes and elevation angles for its satellites, along with several other parameters, to achieve reliable connectivity. Each satellite has an LTE modem on board, and these satellites plug into the massive constellation of 6,799 existing Starlink spacecraft, according to Space.com. \n\nConnecting to that larger constellation happens via laser backhaul, where laser-based optical communication systems transmit data between satellites. This method leverages the advantages of lasers over traditional radio frequency communications, enabling data rates up to 100 times faster, increased bandwidth, and improved security. \nThe direct-to-cell program was approved last month, the article points out &mdash; but it's ready to ramp up. \"You'll currently get only text service through the end of 2024; voice and data will become available sometime next year, as will support for IoT devices (such as smart home gadgets). The company hasn't said how much its service will cost. \" (They also note there's already competing services from Lynk, \"which has satellites in orbit and launched in the island nation of Palau back in 2023, and AST SpaceMobile, which also has commercial satellites in orbit and contracts with the U.S. government, Europe, and Japan.\") \n\nElon Musk's announcement on X.com prompted this interesting exchange: \nX.com User: You've stated that purchasing Starlink goes toward funding the journey to Mars, yes? \nElon Musk: Yes.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=SpaceX's+Thursday+Launch+Enables+Starlink's+New+Satellite-to-Cellphone+Internet+Service%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F12%2F06%2F2155256%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F12%2F06%2F2155256%2Fspacexs-thursday-launch-enables-starlinks-new-satellite-to-cellphone-internet-service%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://science.slashdot.org/story/24/12/06/2155256/spacexs-thursday-launch-enables-starlinks-new-satellite-to-cellphone-internet-service?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23543985&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Machine Learning and Linguistic Profiles Sheds Light on Q's Possible Authors","url":"https://hackernoon.com/machine-learning-and-linguistic-profiles-sheds-light-on-qs-possible-authors?source=rss","date":1733575510,"author":"Ethnology","unread":true,"desc":"","content":"<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Florian Cafiero (ORCID 0000-0002-1951-6942), Sciences Po, Medialab;</p>\n<p>(2) Jean-Baptiste Camps (ORCID 0000-0003-0385-7037), Ecole nationale des chartes, Universite Paris, Sciences &amp; Lettres.</p>\n<p>:::</p>\n<h2 id=\"tableoflinks\">Table of Links</h2>\n<p><a href=\"http://hackernoon.com/preview/7PlOj9IaUHuPWIn6ndic\">Abstract and Introduction</a></p>\n<p><a href=\"http://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Why work on QAnon? Specificities and social impact</a></p>\n<p><a href=\"https://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Who is Q? The theories put to test</a> </p>\n<p><a href=\"http://hackernoon.com/preview/aicG2Yd8jIeRIbXraDG7\">Authorship attribution</a></p>\n<p><a href=\"http://hackernoon.com/preview/i0BVXUT0mQA45QgINvPh\">Results</a></p>\n<p><a href=\"http://hackernoon.com/preview/oL01AD0l0ZcQ2BhP8qeR\">Discussion</a></p>\n<p><a href=\"http://hackernoon.com/preview/7owyHKl0XuVw95ZW2bdk\">Corpus constitution</a></p>\n<p><a href=\"http://hackernoon.com/preview/APNLYr8JzgY6w7I9G4qp\">Quotes of authors outside of the corpus have been</a></p>\n<p><a href=\"http://hackernoon.com/preview/SVjRo1fXLQRXSmoB9QB4\">Definition of two subcorpus: dealing with generic difference and an imbalanced dataset</a></p>\n<p><a href=\"http://hackernoon.com/preview/rc3mv0jW24sMSu0SFn2r\">The genre of “Q drops”: a methodological challenge</a></p>\n<p><a href=\"http://hackernoon.com/preview/i772YMbF0pIqvo5FrdtN\">Detecting style changes: rolling stylometry</a></p>\n<p><a href=\"http://hackernoon.com/preview/tFWtNclFbFXQOBmlhVwP\">Ethical statement, Acknowledgements, and References</a></p>\n<h2 id=\"results\">Results</h2>\n<p>Profiles capturing unconscious features of style such as grammatical morphemes have been built from two corpus of texts (a large corpus with all 13 candidates, but sometimes a low amount of relevant material for some of them, and a smaller, more controlled corpus) signed by each putative authors, using supervised machine learning, with a general attributive performance of over 97% (Materials and methods). They show that, for most of the slices, the highest decision function is by far by Ron W. (Fig. 1). The most significant deviation from this concerns the first period of the QDrops, before the switch to 8chan. In this period, the larger corpus analysis gives Paul F. as, by far, the top candidate, before a period where Paul F. and Ron W. signals are competing, until finally Ron W. signals takes over, after a second break that closely matches a tweet described by Paul F. himself as the last authentic Qdrop, that goes</p>\n<p>\\\n<em>There will be no further posts on this board under this ID.</em></p>\n<p><em>This will verify the trip is safeguarded and in our control.</em></p>\n<p><em>This will verify this board is compromised.</em></p>\n<p><em>God bless each and every one of you.</em></p>\n<p><em>Fight, fight, fight!</em></p>\n<p><em>Q</em></p>\n<p>\\\nThe dominance of Paul F. in the first period is not seen at all on the smaller corpus analysis.</p>\n<p>\\\nMore secondarily, there are very localised spikes of Christina U. and Michael F. signals, especially in the more recent period of the QDrops. The rest of the candidates lag far behind.</p>\n<p>\\\nResults obtained on the two rolling analyses, and their eventual difference, have to be contextualised by investigating the features who received the strongest coefficients in the different SVM classifiers (fig. 2). For some candidates, like Ron W., the features seem mostly idiolectal, like the 3-grams ‘nyb’, ‘ybo’ (in ‘anybody’) or the relative avoidance of ‘ th’ and ‘his’ and remain stable in between both analyses. This is also the case, for instance, for Donald T. whose most distinctive feature is ‘fak’, part of his very idiolectal ‘FAKE’, while other are more content related (‘mpg’ is even due to the regularity with which he mentioned ‘BrianKempGA’ in the training material), a consequence of the choice of characters 3-grams as features.</p>\n<p>\\\nFor authors like Christina U., the features are very content and news-related, like the 3-grams extracted from ‘Israel(i)’, ‘blm’, ‘psy’ (psychologists, psychiatrists, . . . ), etc.</p>\n<p>\\\nIn the case of Michael F., the features seem very dependent on the small quantity of the available training material, and the grandiloquent and religious nature of the few material available, with features such as ‘god’ (‘God’), ‘hty’ (‘almighty’), ‘lib’ (‘liberty’).</p>\n<p>\\\n\\\n\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-5z830jr.png\" alt=\"Figure 1: Decision function of each classifier for each successive overlapping windows of Q drops (windows of 1000 words, with steps of 200 words), arranged in chronological order for the large corpus (top) and the controlled corpus (bottom)\" /></p>\n<p>\\\nFinally and more importantly, these features, in their variation between analyses, give very good insight in the different results concerning Paul F. In the small corpus, due to the exclusion of his book, the most distinctive features for him are all cursory words and racist insults (‘ fu’, ‘fuc’, ‘uck’, ‘shi’, ‘hit’, ‘ ni’, ‘nig’, ‘igg’, ‘gge’, etc.); on the larger corpus, on the other hand, with the book included, they seem revealing of more neutral idiolectal (and grammatical) features, with pronouns, auxiliaries, determiners ( ‘he ’, ‘had’, ‘was’, ‘the’, etc.). These elements point to the larger corpus analysis being more reliable in what concerns Paul F. (especially in a crossgenre setup) than the smaller corpus analysis.</p>\n<p>\\</p>\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2303.02078\">available on arxiv</a> under CC BY 4.0 DEED license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Linguistic Analysis Reveals Authorship Changes and Collaboration in QDrop Posts","url":"https://hackernoon.com/linguistic-analysis-reveals-authorship-changes-and-collaboration-in-qdrop-posts?source=rss","date":1733575514,"author":"Ethnology","unread":true,"desc":"","content":"<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Florian Cafiero (ORCID 0000-0002-1951-6942), Sciences Po, Medialab;</p>\n<p>(2) Jean-Baptiste Camps (ORCID 0000-0003-0385-7037), Ecole nationale des chartes, Universite Paris, Sciences &amp; Lettres.</p>\n<p>:::</p>\n<h2 id=\"tableoflinks\">Table of Links</h2>\n<p><a href=\"http://hackernoon.com/preview/7PlOj9IaUHuPWIn6ndic\">Abstract and Introduction</a></p>\n<p><a href=\"http://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Why work on QAnon? Specificities and social impact</a></p>\n<p><a href=\"https://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Who is Q? The theories put to test</a> </p>\n<p><a href=\"http://hackernoon.com/preview/aicG2Yd8jIeRIbXraDG7\">Authorship attribution</a></p>\n<p><a href=\"http://hackernoon.com/preview/i0BVXUT0mQA45QgINvPh\">Results</a></p>\n<p><a href=\"http://hackernoon.com/preview/oL01AD0l0ZcQ2BhP8qeR\">Discussion</a></p>\n<p><a href=\"http://hackernoon.com/preview/7owyHKl0XuVw95ZW2bdk\">Corpus constitution</a></p>\n<p><a href=\"http://hackernoon.com/preview/APNLYr8JzgY6w7I9G4qp\">Quotes of authors outside of the corpus have been</a></p>\n<p><a href=\"http://hackernoon.com/preview/SVjRo1fXLQRXSmoB9QB4\">Definition of two subcorpus: dealing with generic difference and an imbalanced dataset</a></p>\n<p><a href=\"http://hackernoon.com/preview/rc3mv0jW24sMSu0SFn2r\">The genre of “Q drops”: a methodological challenge</a></p>\n<p><a href=\"http://hackernoon.com/preview/i772YMbF0pIqvo5FrdtN\">Detecting style changes: rolling stylometry</a></p>\n<p><a href=\"http://hackernoon.com/preview/tFWtNclFbFXQOBmlhVwP\">Ethical statement, Acknowledgements, and References</a></p>\n<h2 id=\"discussion\">Discussion</h2>\n<p>If the author of the Qdrops is among our candidates, the results here seem to demonstrate the major role of Ron W. in the writing of the Qdrops, at least since the switch to 8chan. The peak of Paul F. in one of the two analyses, for the period before 8chan, could very well be revealing of a real participation, even a leading role for all the period before 8chan, with perhaps afterwards a brief period of collaboration (or competition), in between the migration to 8chan and what Paul F. himself describes as the last authentic Qdrop.</p>\n<p>\\\n\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-bu830ee.png\" alt=\"Figure 2: 10 largest coefficient (negative and positive) for the Liner SVC classifiers of Christina U., Donald T., Michael F., Paul F. and Ron W., trained on the larger (left) and smaller (right) corpora\" /></p>\n<p>\\\nLocalised peaks of Christina U. or Michael F. on the other hand, while they might very hypothetically be revealing of more occasional collaborations, should probably not be over-interpreted. Given the nature of the coefficients used by the model for them (fig. 2), they seem more likely to be caused by ‘topic similarities’ due to the news and topics dealt with in the Qdrops. This could result in the choice of a similar lexicon, and even in quotations or paraphrases. Confusions between Michael F. or Christina U. on one hand, and other candidates (in training) or Q, seem due to attractions in terms of language register and generic peculiarities: samples that use a more elevated and grandiloquent type of patriotic address are brought somewhat closer to Michael F. samples, while those including heavier news-related content might be drawn towards Christina U.</p>\n<p>\\\nA more exploratory visualization of the feature space, based on correspondence analysis, shows a strong opposition (first dimension) between PaulF private posts and public writings, while the second one oppose PaulF and RonW samples (fig. 3). Projected in this feature space, the Qdrops from the 8Chan period, after the ‘board compromised’ post, mostly appear inside RonW data cloud, while previous posts, especially from the time of 4Chan are situated substantially closer to PaulF writings.</p>\n<p>\\\nThis paper of course has limitations. The very nature of the Q drops, a genre in itself, and the brevity of these texts, make difficult to render a finer grain picture than the one we present here. It is thus plausible, even if we cannot demonstrate it, that other punctual interventions could have occurred. The training data we collected is important, and sufficient to obtain excellent performances. Yet, more training data could of course help increase the precision and reliability of the analyses. A media outlet for instance collected the Facebook posts written by one of our candidate author, for which more support could have been helpful (Zadrozny and Collins, 2018). More generally, other individuals not listed here could of course have participated in the writing.</p>\n<p>\\</p>\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2303.02078\">available on arxiv</a> under CC BY 4.0 DEED license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Challenges in Building a QAnon Authorship Corpus","url":"https://hackernoon.com/challenges-in-building-a-qanon-authorship-corpus?source=rss","date":1733576413,"author":"Ethnology","unread":true,"desc":"","content":"<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Florian Cafiero (ORCID 0000-0002-1951-6942), Sciences Po, Medialab;</p>\n<p>(2) Jean-Baptiste Camps (ORCID 0000-0003-0385-7037), Ecole nationale des chartes, Universite Paris, Sciences &amp; Lettres.</p>\n<p>:::</p>\n<h2 id=\"tableoflinks\">Table of Links</h2>\n<p><a href=\"http://hackernoon.com/preview/7PlOj9IaUHuPWIn6ndic\">Abstract and Introduction</a></p>\n<p><a href=\"http://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Why work on QAnon? Specificities and social impact</a></p>\n<p><a href=\"https://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Who is Q? The theories put to test</a> </p>\n<p><a href=\"http://hackernoon.com/preview/aicG2Yd8jIeRIbXraDG7\">Authorship attribution</a></p>\n<p><a href=\"http://hackernoon.com/preview/i0BVXUT0mQA45QgINvPh\">Results</a></p>\n<p><a href=\"http://hackernoon.com/preview/oL01AD0l0ZcQ2BhP8qeR\">Discussion</a></p>\n<p><a href=\"http://hackernoon.com/preview/7owyHKl0XuVw95ZW2bdk\">Corpus constitution</a></p>\n<p><a href=\"http://hackernoon.com/preview/APNLYr8JzgY6w7I9G4qp\">Quotes of authors outside of the corpus have been</a></p>\n<p><a href=\"http://hackernoon.com/preview/SVjRo1fXLQRXSmoB9QB4\">Definition of two subcorpus: dealing with generic difference and an imbalanced dataset</a></p>\n<p><a href=\"http://hackernoon.com/preview/rc3mv0jW24sMSu0SFn2r\">The genre of “Q drops”: a methodological challenge</a></p>\n<p><a href=\"http://hackernoon.com/preview/i772YMbF0pIqvo5FrdtN\">Detecting style changes: rolling stylometry</a></p>\n<p><a href=\"http://hackernoon.com/preview/tFWtNclFbFXQOBmlhVwP\">Ethical statement, Acknowledgements, and References</a></p>\n<h2 id=\"corpusconstitution\">Corpus constitution</h2>\n<p>Because of their contested contents, many accounts have been deleted by the social media platforms. Other accounts were simply deleted by the user themselves. This raised many challenges for the corpus constitution, which had to rely on data collection realized before the deletion, or on difficulty searchable web archives. Moreover, all sources do not have the same time-span, and were created at different dates, discussing potentially different news, a source of heterogeneity in training material that creates challenge in the attribution procedure.</p>\n<p>\\\nWe list here the sources we used for each candidate:</p>\n<p>\\\n<strong>Roger</strong> <strong>S</strong> We collected Roger S.’s posts on Gab (https://gab.com/RogerJStoneJr), from June 14th to August 2nd, 2021.</p>\n<p>\\\n<strong>Michael F</strong> Michael F. wrote a series of 10 articles for the Western Journal, from June 29, 2020 to July 31, 2021. (https://www.westernjournal.com/author/mflynn/). He also wrote a letter to ask for support to Roger S.’s wife, published on FrankReport (https://frankreport.com/2021/06/11/bannedby-twitter-gen-michael-flynn-is-published-on-frankreport-concerning-roger-stone/).</p>\n<p>\\\nHis article for Fox News about ISIS has also been analyzed. (https://web.archive.org/web- /20161215042531/http://www.foxnews.com/opinion/2016/11/02/gen-michaelflynn-after-mosul-is-liberated-isis-could-attack-usnext.html).</p>\n<p>\\\nFinally, we collected posts on his Twitter account from October 19th, 2016 to September 18th, 2017.</p>\n<p>\\\n<strong>Paul F</strong> We collected Paul F.’s personal writing on his website (https://paulfurber.net/).</p>\n<p>\\\nWe retrieved archives from his twitter on account of a threadreader (https://threadreaderapp.- com/thread/1158540523008905216.html).</p>\n<p>\\\nWe also captured archives from the CBTS boards on 8chan, where he wrote as “The Board Owner”.</p>\n<p>\\\nA few posts he left on Discord were transcribed from pictures found online.</p>\n<p>\\\nFinally, Paul F. wrote a book: Q: Inside The Greatest Intelligence Drop In History, included in our large corpus.</p>\n<p>\\\n<strong>Jim W</strong> Archives of Jim W.’s Twitter account were found on archive.today (https://archive.is- /https://twitter.com/xerxeswatkins), which preserves 9 screenshots (22 Dec 2014, 6 Feb 2016, 15 Mar 2016, 30 Mar 2016, 4 Apr 2016, 5 May 2016, 28 May 2016, 25 Mar 2017, 8 Apr 2017) taken prior to the account suspension. A large amount of these tweets were only citing article titles from his own media The Goldwater. As these titles were not necessarily (and probably not) written by him, we chose to exclude them.</p>\n<p>\\\nA small text was written by Jim W. on 5ch about a service problem on 8ch that he blames on a government attack. (https://fox.5ch.net/test/read.cgi/poverty/1418- 027836/826)</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-kq830kn.png\" alt=\"Figure 3: Dimensions 1 and 2 from a correspondence analysis of the 1000 words samples from RonW and PaulF texts; the Qdrops from the 4Chan period (purple), 8Chan period before (yellow) and after (orange) the ‘board compromised’ post have been projected as supplementary individuals.\" /></p>\n<p>\\\nFinally, posts from his Parler account were added to the corpus.</p>\n<p>\\\n<strong>Ron W</strong> A sample of 3130 tweets by Ron W. have been collected through the Twitter API.</p>\n<p>\\\nWe also collected his posts on Telegram from November 30th, 2021 to December, 20th, 2021.</p>\n<p>\\\n<strong>Coleman R</strong> Under the pseudonym PamphletAnon, Coleman R. wrote a vast number of posts on 8chan, especially on the board “the Storm” (https://8ch.net/thestorm/catalog.html) of which he was the owner. We collected his posts on the Wayback Machine, which seems to provide a complete archive of the board.</p>\n<p>\\\nA few messages he posted on Discord (Q Central, 2017) have been archived by DDOS (https://ddosecrets.com/wiki/Distributed Denial of Secrets), at this address https://whispers.ddosecrets.com/discord/user/376607495470448643. 347 messages by PamphletAnon on Discord (Patriots’ Soapbox, 2018) are also available at: https://discordleaks.unicornriot.ninja/discord/user/41936.</p>\n<p>\\\nWe also found a small text on Reddit, where Coleman R. announces a future talk on Infowars with Rob Dew.</p>\n<p>\\\nOn September 11, 2020, Pamphlet Anon wrote a text on “Patriots’ Soapbox”, the media he curates with Christina U. (https://patriotssoapbox.com/opinion/memories-of9-11-surreal-and-terrifying/).</p>\n<p>\\\n<strong>Courtney T</strong> Collaborating with Ron and Jim W., Courtney T. publicly announced that she knew the truth about the Q drops, and that it would be highly disappointing to their public (Huback, 2021). We collected her posts on Twitter, under her account IWillRedPillYou, archived here (http://web.archive.org/web/20180113162029if /-<a href=\"https://twitter.com/IWillRedPillYou).\">https://twitter.com/IWillRedPillYou).</a></p>\n<p>\\\n<strong>Tracy D</strong> Under the pseudonym Tracy Beanz, Tracy D. published a large number of tweets, on an account now suspended, but of which archives.today retains 92 captures (https://archive.vn/lDRyR), from December 2016 to January 2021.</p>\n<p>\\\nShe also published a long post explaining herself about quarrels over Q related publications on Steemit (https://steemit.com/drama/@tracybeanz/shestood-in-the-storm)</p>\n<p>\\\n<strong>Christina U</strong> Christina U. wrote a number of articles on PatriotsSoapbox (https://patriotssoapbox.com/), of which the 5 most recent on July 7h, 2021 were collected.</p>\n<p>\\\nWe also found an online conversation she had on Muckrock with Homeland Security on the 7th and 22nd of July 2021. (https://www.muckrock.com/foi/united-statesof-america-10/patriots-soapbox-department-ofhomeland-security-115196/#file-956999) Archives of her GAB profile were also analyzed.</p>\n<p>\\\n<strong>Donald T</strong> Former president of the United States tweets were collected during the month of december 2020. We removed tweets suspected to have been written by his staff by the site https://factba.se/.</p>\n<p>\\\n<strong>Melania T</strong> We collected a sample of tweets by former FLOTUS thanks to the Twitter API, from January 21st, 2017 to January 19th, 2021.</p>\n<p>\\\n<strong>Eric T</strong> We collected a sample of 3000 tweets by the son of former POTUS thanks to the Twitter API from September 10th 2016, to June 24th 2021.</p>\n<p>\\\n<strong>Dan S</strong> We collected a sample of tweets by the former POTUS’ deputy chief of staff thanks to the Twitter API, from October 25th, 2018 to January 20th, 2021.</p>\n<p>\\</p>\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2303.02078\">available on arxiv</a> under CC BY 4.0 DEED license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Addressing Quotations and Copy-Paste in QAnon Authorship Attribution","url":"https://hackernoon.com/addressing-quotations-and-copy-paste-in-qanon-authorship-attribution?source=rss","date":1733577312,"author":"Ethnology","unread":true,"desc":"","content":"<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Florian Cafiero (ORCID 0000-0002-1951-6942), Sciences Po, Medialab;</p>\n<p>(2) Jean-Baptiste Camps (ORCID 0000-0003-0385-7037), Ecole nationale des chartes, Universite Paris, Sciences &amp; Lettres.</p>\n<p>:::</p>\n<h2 id=\"tableoflinks\">Table of Links</h2>\n<p><a href=\"http://hackernoon.com/preview/7PlOj9IaUHuPWIn6ndic\">Abstract and Introduction</a></p>\n<p><a href=\"http://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Why work on QAnon? Specificities and social impact</a></p>\n<p><a href=\"https://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Who is Q? The theories put to test</a> </p>\n<p><a href=\"http://hackernoon.com/preview/aicG2Yd8jIeRIbXraDG7\">Authorship attribution</a></p>\n<p><a href=\"http://hackernoon.com/preview/i0BVXUT0mQA45QgINvPh\">Results</a></p>\n<p><a href=\"http://hackernoon.com/preview/oL01AD0l0ZcQ2BhP8qeR\">Discussion</a></p>\n<p><a href=\"http://hackernoon.com/preview/7owyHKl0XuVw95ZW2bdk\">Corpus constitution</a></p>\n<p><a href=\"http://hackernoon.com/preview/APNLYr8JzgY6w7I9G4qp\">Quotes of authors outside of the corpus have been</a></p>\n<p><a href=\"http://hackernoon.com/preview/SVjRo1fXLQRXSmoB9QB4\">Definition of two subcorpus: dealing with generic difference and an imbalanced dataset</a></p>\n<p><a href=\"http://hackernoon.com/preview/rc3mv0jW24sMSu0SFn2r\">The genre of “Q drops”: a methodological challenge</a></p>\n<p><a href=\"http://hackernoon.com/preview/i772YMbF0pIqvo5FrdtN\">Detecting style changes: rolling stylometry</a></p>\n<p><a href=\"http://hackernoon.com/preview/tFWtNclFbFXQOBmlhVwP\">Ethical statement, Acknowledgements, and References</a></p>\n<h2 id=\"dealingwithquotationsandcopypaste\">Dealing with quotations and copy/paste</h2>\n<p>Quotes of authors outside of the corpus have been excluded as much as possible by close reading: in particular, quotes from Q, Wikipedia, the Stanford Encyclopedia of Philosophy, Abraham Lincoln, the Intelligence Resource Program (irp-fas), Steve Scully’s biography etc. All these quotes have been removed.</p>\n<p>\\\nDirect quotations (with or without quotation marks) and copy/paste between the writings of the different candidates can also occur. A good deal of them quote Donald, Eric or Melania T. – Q does it too. There is also a certain number of quotations from Q by the others (such as Paul F. for instance). This could lead to small biases in the constitution of idiolectal profiles. To avoid this, we then proceeded to systematically detect citation between the candidates themselves. Direct pairwise comparison being computationally too costly for a corpus of this size, we used a Locality-Sensitive Hashing (LSH) algorithm. To that end, we used the open source TextReuse package (Mullen, 2020). The corpus was tokenised into sentences, and broken word bi-grams (with skip of 1, that is, allowing for any one word to be inserted between the two words of the bigrams) were counted. For all pairs of sentences, a Jaccard similarity score was computed. Be A and B two samples considered as sets of bi-grams, the Jaccard similarity is computed as:</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-gt830h6.png\" alt=\"\" /></p>\n<p>\\\nAll pairs of sentences with a Jaccard similarity score superior or equal to 0.5 (i.e., at least half of their bi-grams in common) were examined by a human expert, and quotations removed.</p>\n<p>\\\nEven for J = 1, we were sometimes confronted to false positives. Dan S. and Melania T. both use once the sentence “we are all in this together”, without directly citing each other. We thus left this passage in both their texts. Rarely used, the sentence “the American people are not stupid” nevertheless appears in different texts. It was kept in the texts studied, as other simple sentences (“thank you for your service” etc.)</p>\n<p>\\\nOther situations were trickier to address. For instance, Dan S. uses once the sentence: “the best is yet to come”. It is used five times by Q, himself quoting former President Donald Trump. This sentence could be used by anyone without directly quoting Q or Donald Trump. Yet, as its use by Dan S. starts with “As the President says. . . ”, we considered it a direct quotation and proceeded to deletion from Dan S.’s text. Yet, we did not delete it from Q’s own writing, as it is never used as an explicit quotation: the sentence could be used in another context, the person(s) writing the Qdrops with this sentence could try to impersonate Donald Trump, etc. In any of these cases, it would be legitimate to leave the information. Same thing goes for expression such as “the world is watching” or “make America great again”, used by Donald Trump. but also by Q and some of the potential candidates here.</p>\n<p>\\</p>\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2303.02078\">available on arxiv</a> under CC BY 4.0 DEED license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"QAnon Text Analysis shows Imbalanced Datasets and Generic differences","url":"https://hackernoon.com/qanon-text-analysis-shows-imbalanced-datasets-and-generic-differences?source=rss","date":1733578211,"author":"Ethnology","unread":true,"desc":"","content":"<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Florian Cafiero (ORCID 0000-0002-1951-6942), Sciences Po, Medialab;</p>\n<p>(2) Jean-Baptiste Camps (ORCID 0000-0003-0385-7037), Ecole nationale des chartes, Universite Paris, Sciences &amp; Lettres.</p>\n<p>:::</p>\n<h2 id=\"tableoflinks\">Table of Links</h2>\n<p><a href=\"http://hackernoon.com/preview/7PlOj9IaUHuPWIn6ndic\">Abstract and Introduction</a></p>\n<p><a href=\"http://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Why work on QAnon? Specificities and social impact</a></p>\n<p><a href=\"https://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Who is Q? The theories put to test</a> </p>\n<p><a href=\"http://hackernoon.com/preview/aicG2Yd8jIeRIbXraDG7\">Authorship attribution</a></p>\n<p><a href=\"http://hackernoon.com/preview/i0BVXUT0mQA45QgINvPh\">Results</a></p>\n<p><a href=\"http://hackernoon.com/preview/oL01AD0l0ZcQ2BhP8qeR\">Discussion</a></p>\n<p><a href=\"http://hackernoon.com/preview/7owyHKl0XuVw95ZW2bdk\">Corpus constitution</a></p>\n<p><a href=\"http://hackernoon.com/preview/APNLYr8JzgY6w7I9G4qp\">Quotes of authors outside of the corpus have been</a></p>\n<p><a href=\"http://hackernoon.com/preview/SVjRo1fXLQRXSmoB9QB4\">Definition of two subcorpus: dealing with generic difference and an imbalanced dataset</a></p>\n<p><a href=\"http://hackernoon.com/preview/rc3mv0jW24sMSu0SFn2r\">The genre of “Q drops”: a methodological challenge</a></p>\n<p><a href=\"http://hackernoon.com/preview/i772YMbF0pIqvo5FrdtN\">Detecting style changes: rolling stylometry</a></p>\n<p><a href=\"http://hackernoon.com/preview/tFWtNclFbFXQOBmlhVwP\">Ethical statement, Acknowledgements, and References</a></p>\n<h2 id=\"definitionoftwosubcorpusdealingwithgenericdifferenceandanimbalanceddataset\">Definition of two subcorpus: dealing with generic difference and an imbalanced dataset</h2>\n<p>The difficulties in data collection for a variety of individual and profiles, as well as the ubiquity of deleted content, not recoverable to us, forces us to adopt a a dual approach, and to build two corpora:</p>\n<p>\\\n<strong>large corpus</strong> in which we include the larger number of candidates, whatever the number of samples available to us and the genre of said samples. It contains everything described in the contains everything described in the Corpus constitution section above;</p>\n<p>\\\n<strong>controlled corpus</strong> in which we removed authors for which only too cross-genre and/or too few samples are available, and do not include training material that is too different from the rest (in particular, books). It is the same as the previous one, minus</p>\n<p>\\\n• interviews transcripts (Michael F., Paul F.);</p>\n<p>\\\n• a book by Paul F.;</p>\n<p>\\\n• the small amount of available data for Courtney T. and Roger S.</p>\n<p>\\\nIn both cases, due to the limitations in data collection and available material, the quantity of training material is imbalanced between authors, a potential problem in machine learning. To counter this effect, we used class weights during training, where errors for a given class are penalised not always by one, but by a specific weight inversely proportional to class size, where the weight for class i is computed as</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-tb930or.png\" alt=\"\" /></p>\n<p>\\\nwhere N is the total number of samples, and C the total number of unique classes and ni the number of samples in class i. Xe used the sklearn ‘balance’ implementation (Pedregosa et al., 2011).</p>\n<p>\\</p>\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2303.02078\">available on arxiv</a> under CC BY 4.0 DEED license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Analyzing QDrops Texts shows Distinct Linguistic Features than Traditional Ones","url":"https://hackernoon.com/analyzing-qdrops-texts-shows-distinct-linguistic-features-than-traditional-ones?source=rss","date":1733579116,"author":"Ethnology","unread":true,"desc":"","content":"<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Florian Cafiero (ORCID 0000-0002-1951-6942), Sciences Po, Medialab;</p>\n<p>(2) Jean-Baptiste Camps (ORCID 0000-0003-0385-7037), Ecole nationale des chartes, Universite Paris, Sciences &amp; Lettres.</p>\n<p>:::</p>\n<h2 id=\"tableoflinks\">Table of Links</h2>\n<p><a href=\"http://hackernoon.com/preview/7PlOj9IaUHuPWIn6ndic\">Abstract and Introduction</a></p>\n<p><a href=\"http://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Why work on QAnon? Specificities and social impact</a></p>\n<p><a href=\"https://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Who is Q? The theories put to test</a> </p>\n<p><a href=\"http://hackernoon.com/preview/aicG2Yd8jIeRIbXraDG7\">Authorship attribution</a></p>\n<p><a href=\"http://hackernoon.com/preview/i0BVXUT0mQA45QgINvPh\">Results</a></p>\n<p><a href=\"http://hackernoon.com/preview/oL01AD0l0ZcQ2BhP8qeR\">Discussion</a></p>\n<p><a href=\"http://hackernoon.com/preview/7owyHKl0XuVw95ZW2bdk\">Corpus constitution</a></p>\n<p><a href=\"http://hackernoon.com/preview/APNLYr8JzgY6w7I9G4qp\">Quotes of authors outside of the corpus have been</a></p>\n<p><a href=\"http://hackernoon.com/preview/SVjRo1fXLQRXSmoB9QB4\">Definition of two subcorpus: dealing with generic difference and an imbalanced dataset</a></p>\n<p><a href=\"http://hackernoon.com/preview/rc3mv0jW24sMSu0SFn2r\">The genre of “Q drops”: a methodological challenge</a></p>\n<p><a href=\"http://hackernoon.com/preview/i772YMbF0pIqvo5FrdtN\">Detecting style changes: rolling stylometry</a></p>\n<p><a href=\"http://hackernoon.com/preview/tFWtNclFbFXQOBmlhVwP\">Ethical statement, Acknowledgements, and References</a></p>\n<h2 id=\"thegenreofqdropsamethodologicalchallenge\">The genre of “Q drops”: a methodological challenge</h2>\n<p>The study of the Q drops raises a number of specific challenges. First of all, the Q drops constitute per se a kind of a genre. It follows specific rules that most people would not use in another context: they do not look like a regular blog, media or social media post, nor do they belong to any specific literary genre etc. This forces us to consider our attribution problem as a cross-topic attribution problem.</p>\n<p>\\\nThis specific genre has consequences on many linguistic properties of the Q drops. The structural brevity of the sentences for instance prevents us from taking the sentence lengths as a clue of who wrote what. The overwhelming proportion of interrogative forms, especially in the first Q drops, makes it difficult to reason on morpho-syntactic sequences, as they are often extremely and artificially stereotyped. Part-of-Speech n-grams such as “Interrogative pronoun - conjugated verb - common noun” would for instance emerge as a signature of the Q drops, and could derail our analysis, by pointing to any of the suspects using interrogative forms the most in other contexts. Finally, the elliptic style of the Q drops, written almost as if they were a telegram, distorts the use of function words, less frequent than expected in the Q drops corpus. Approaches relying only on function words could be made less robust by this distortion.</p>\n<p>\\\nWe thus chose to work on character trigrams, the most flexible and reliable feature we could use in the very specific context of this study, and a widely acknowledge feature in stylometry, in particulary for its supposed capacity to capture grammatical morphemes (Kestemont, 2014; Sapkota et al., 2015) while bearing in mind potential greater sensibility to thematic attractions in comparison to function words.</p>\n<p>\\</p>\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2303.02078\">available on arxiv</a> under CC BY 4.0 DEED license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"As Australia bans social media for kids under 16, age-assurance tech is in the spotlight","url":"https://techcrunch.com/2024/12/07/as-australia-bans-social-media-for-kids-under-16-age-assurance-tech-is-in-the-spotlight/","date":1733580000,"author":"Natasha Lomas","unread":true,"desc":"","content":"<p>Age assurance, an umbrella term that refers to technologies for verifying, estimating, or inferring an internet user&#8217;s age, is being thrust into the global spotlight thanks to a blanket ban on social media use for people under 16 in Australia. The law, which is expected to come into force in Australia in November 2025, will [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Rolling Stylometry and Machine Learning Analyzes QAnon Texts Patterns","url":"https://hackernoon.com/rolling-stylometry-and-machine-learning-analyzes-qanon-texts-patterns?source=rss","date":1733580011,"author":"Ethnology","unread":true,"desc":"","content":"<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Florian Cafiero (ORCID 0000-0002-1951-6942), Sciences Po, Medialab;</p>\n<p>(2) Jean-Baptiste Camps (ORCID 0000-0003-0385-7037), Ecole nationale des chartes, Universite Paris, Sciences &amp; Lettres.</p>\n<p>:::</p>\n<h2 id=\"tableoflinks\">Table of Links</h2>\n<p><a href=\"http://hackernoon.com/preview/7PlOj9IaUHuPWIn6ndic\">Abstract and Introduction</a></p>\n<p><a href=\"http://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Why work on QAnon? Specificities and social impact</a></p>\n<p><a href=\"https://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Who is Q? The theories put to test</a> </p>\n<p><a href=\"http://hackernoon.com/preview/aicG2Yd8jIeRIbXraDG7\">Authorship attribution</a></p>\n<p><a href=\"http://hackernoon.com/preview/i0BVXUT0mQA45QgINvPh\">Results</a></p>\n<p><a href=\"http://hackernoon.com/preview/oL01AD0l0ZcQ2BhP8qeR\">Discussion</a></p>\n<p><a href=\"http://hackernoon.com/preview/7owyHKl0XuVw95ZW2bdk\">Corpus constitution</a></p>\n<p><a href=\"http://hackernoon.com/preview/APNLYr8JzgY6w7I9G4qp\">Quotes of authors outside of the corpus have been</a></p>\n<p><a href=\"http://hackernoon.com/preview/SVjRo1fXLQRXSmoB9QB4\">Definition of two subcorpus: dealing with generic difference and an imbalanced dataset</a></p>\n<p><a href=\"http://hackernoon.com/preview/rc3mv0jW24sMSu0SFn2r\">The genre of “Q drops”: a methodological challenge</a></p>\n<p><a href=\"http://hackernoon.com/preview/i772YMbF0pIqvo5FrdtN\">Detecting style changes: rolling stylometry</a></p>\n<p><a href=\"http://hackernoon.com/preview/tFWtNclFbFXQOBmlhVwP\">Ethical statement, Acknowledgements, and References</a></p>\n<h2 id=\"detectingstylechangesrollingstylometry\">Detecting style changes: rolling stylometry</h2>\n<p>Collaborative writing is not necessarily easy to handle. The scenario in which authors simply took turns, and divided the work between themselves is already complicated to address. But when the collaboration is more complex, especially when the various authors contribute together to the same passages, the style of the original authors can be hard to recognize. The collaboration then results in a new style, that does not match the style of one of the authors (Kestemont et al., 2015).</p>\n<p>\\\nThe principle of rolling stylometry (Eder, 2016) is simple: rather than attributing a whole text, we arbitrarily decompose it in a series of overlapping smaller parts: from the 1st word to the 1001th word, from the 2nd word to the 1002nd word etc. Then, we attribute each of these parts to a certain author. We only have to define the length of these parts, and by how much they overlap.</p>\n<p>\\\nRolling stylometry has been successfully implemented in a wide variety of settings. With Burrows’ delta, it has for instance been used to assess Ford’s claims about his implications in collaborations worth Joseph Conrad (Rybicki et al., 2014), to determine the beginning of Vostaert’s intervention on Dutch Arthurian novel Roman van Walewein (van Dalen-Oskam and Van Zundert, 2007), or to understand Lovecraft’s and Eddy’s implication in The Loved Dead (Gladwin et al., 2017). Using support-vector machines, rolling stylometry more recently helped to confirm Fletcher and Shakespeare’s collaboration for Henry VIII (Plecha´ˇc, 2020) or Moli`ere and Corneille’s collaboration for Psych´e (Cafiero and Camps, 2021).</p>\n<h3 id=\"supportvectormachine\">Support Vector Machine</h3>\n<p>We choose to train linear Support Vector Classifiers (SVC) to identify the style of each potential candidate. The family of Support Vector Machines algorithm has been widely and successfully used for authorship attribution in a variety of settings and languages, and for very diverse sources, ranging from e-mails or blogs to Shakespeare plays (De Vel et al., 2001; Diederich et al., 2003; Mikros, 2012; Ouamour and Sayoud, 2012; Marukatat et al., 2014; Plecha´ˇc, 2020). At the PAN competition, a reference for digital text forensics and stylometry, it also served as a baseline for the “cross-domain authorship attribution” tasks the last time they were proposed in 2018 (Stamatatos et al., 2018) and 2019 (Kestemont et al., 2019). The Q drops being a sort of “domain” in their own, our own task can be considered as a crossdomain authorship attribution task. Other classifiers could have been used, but would not offer the interpretability we need for that kind of task. In such a delicate context, being able to get a simple and clear intuition on which features the classifier relies is simply crucial. If the features selected were to be too much related to the content of the texts, rather than to properly linguistic properties of the person’s discourse, we need to be aware of it, and train more properly a new classifier.</p>\n<p>\\\nTo determine the choice of features and the size of the training samples, we are constrained by two antagonistic goals: the shorter the samples, the more detailed and precise the results that we will get in terms of attribution, yet the longer, the more statistically reliable. Particularly, authorship attribution has proven to require relatively high amounts of data, with a floor for reliable authorship attribution between 1000 and 3000 words, depending on genre and language (Eder, 2015, 2017). The question of sample length can also be linked to the difficulty of the attribution task; cross-domain attribution with multiple candidates presents a challenge in this regard.</p>\n<p>\\\nOn the other hand, the features we retained, character 3-grams, could increase robustness, ad they are known to reduce sparsity and perform well in attribution studies (Kestemont, 2014; Sapkota et al., 2015). While punctuation can strongly reflect authorial signature (Sapkota et al., 2015), we removed led to remove it because of variety of platforms from where the data were recovered could cause inconsistencies in the use of signs that can be encoded in different fashions, e.g., apostrophes.</p>\n<p>\\\nFor these reasons, we retain a setup that is a compromise between reliability and finer grain analysis:</p>\n<p>\\\n<strong>Sample length</strong> 1000 words;</p>\n<p>\\\n<strong>features</strong> character 3-grams (all, including punctuation).</p>\n<p>\\\nTo evaluate our setups, we opt for a leave-one-out cross evaluation on the training corpus (Table 1), for a combination of reasons. First, some of the samples are of relatively small size in the context of training an efficient classifier. A leave-one-out procedure helps us using the maximal amount of data. The constitution of which relevant and coherent training sets is also a question in our case. In that context, leave-one-out evaluation can provide a more robust estimate of the model’s performance, as it accounts for the potential variability caused by the specific sample chosen for testing. Finally, leave-one-out can help us avoid overfitting (Ng et al., 1997; Ghojogh and Crowley, 2019), which is a danger in our study - we do not want the classification to be based on some specific piece of news of particular interest to one of the candidates, but to have reliable classification based on linguistic features appearing in a large range of contexts.</p>\n<p>\\\nThe confusion matrix gives more information on the nature of the small number of classification errors (Table 2). As can be expected, performance is slightly lower for authors for which training material is very limited (ColemanR, CourtneyT, RogerS). For the others, it is above 95%, if we except a few confusions between Michael F. and Roger S. (on the large corpus only). These can be explained by the limited size of Roger S. training data, thematic attractions, the fact that he talks about Flynn more or less directly, but also probably by a generational (age) bias.</p>\n<p>\\\nWe then apply our models to all successive overlapping slices of Q drops, arranged in chronological order, with window size of length 1000 words and step 200 words. We then plot the resulting decision functions for each classifier. The higher the value, the more likely the attribution of a sample to a given author.</p>\n<p>\\\nAll analyses are implemented in Python, inside the SuperStyl package (Camps et al., 2021), and use internally the SVM and pipeline facilities provided by Sklearn (Pedregosa et al., 2011). Plots are created using R and Python (matplotlib).</p>\n<h3 id=\"correspondenceanalysis\">Correspondence analysis</h3>\n<p>Correspondence analysis (Benz´ecri, 1973) has been performed on a contingency table of the 1000 words samples by RonW and PaulF based on 4105 character 3-grams selected for statistically reliability based on a procedure previously described (Cafiero and Camps, 2019). The QDrops have then been inserted as supplementary rows, using the implementation in the R package FactoMineR (Lˆe et al., 2008). The significance of the two first axes remains relatively low, in part because of the high dimensionality of the input table, but the data clouds for PaulF and RonW are clearly separated, and the QDrops appear in an intermediary position.</p>\n<p>\\</p>\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2303.02078\">available on arxiv</a> under CC BY 4.0 DEED license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"OpenWrt Affected By Security Issue That Could Have Led To Compromised Build Artifacts","url":"https://www.phoronix.com/news/OpenWrt-Compromised-ASU-Builds","date":1733580052,"author":"Michael Larabel","unread":true,"desc":"","content":"A security issue was reported to the OpenWrt project this week around their Attendedsysupgrade Server (ASU) instances that could have led to compromised firmware images being served...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Ethical Considerations in QAnon Authorship Attribution Research","url":"https://hackernoon.com/ethical-considerations-in-qanon-authorship-attribution-research?source=rss","date":1733580912,"author":"Ethnology","unread":true,"desc":"","content":"<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Florian Cafiero (ORCID 0000-0002-1951-6942), Sciences Po, Medialab;</p>\n<p>(2) Jean-Baptiste Camps (ORCID 0000-0003-0385-7037), Ecole nationale des chartes, Universite Paris, Sciences &amp; Lettres.</p>\n<p>:::</p>\n<h2 id=\"tableoflinks\">Table of Links</h2>\n<p><a href=\"http://hackernoon.com/preview/7PlOj9IaUHuPWIn6ndic\">Abstract and Introduction</a></p>\n<p><a href=\"http://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Why work on QAnon? Specificities and social impact</a></p>\n<p><a href=\"https://hackernoon.com/preview/RrGCqU6F4syJSeTXtLQ5\">Who is Q? The theories put to test</a> </p>\n<p><a href=\"http://hackernoon.com/preview/aicG2Yd8jIeRIbXraDG7\">Authorship attribution</a></p>\n<p><a href=\"http://hackernoon.com/preview/i0BVXUT0mQA45QgINvPh\">Results</a></p>\n<p><a href=\"http://hackernoon.com/preview/oL01AD0l0ZcQ2BhP8qeR\">Discussion</a></p>\n<p><a href=\"http://hackernoon.com/preview/7owyHKl0XuVw95ZW2bdk\">Corpus constitution</a></p>\n<p><a href=\"http://hackernoon.com/preview/APNLYr8JzgY6w7I9G4qp\">Quotes of authors outside of the corpus have been</a></p>\n<p><a href=\"http://hackernoon.com/preview/SVjRo1fXLQRXSmoB9QB4\">Definition of two subcorpus: dealing with generic difference and an imbalanced dataset</a></p>\n<p><a href=\"http://hackernoon.com/preview/rc3mv0jW24sMSu0SFn2r\">The genre of “Q drops”: a methodological challenge</a></p>\n<p><a href=\"http://hackernoon.com/preview/i772YMbF0pIqvo5FrdtN\">Detecting style changes: rolling stylometry</a></p>\n<p><a href=\"http://hackernoon.com/preview/tFWtNclFbFXQOBmlhVwP\">Ethical statement, Acknowledgements, and References</a></p>\n<h2 id=\"ethicalstatement\">Ethical statement</h2>\n<p>Even if written independently, this study tried to abide as much as possible to the principles of the “Pratiquer une recherche int`egre et responsable” guide by the Centre National de la Recherche Scientifique’s ethics board (Comit´e d’´ethique du CNRS, 2017). This article does not reveal the identity of individuals that were not broadly known beforehand. In this case, all candidate authors were already either public figures, or individuals whose identity had been stated in major media outlets (NBC, HBO etc.). It only uses information that was in conscience made publicly available by the candidate authors and was accessible through standard internet searches at the time of data collection.</p>\n<p>\\\nFor ethical reasons and to respect the privacy policy of the platforms studied here, we do not freely release any content studied here. To respect the data sharing and open data principles, we however detail our data collection method, which should be sufficient to ensure reproducibility in most cases. Some contents could not be available anymore when an attempt at reproducing our computations is performed. In that case, these missing materials could be delivered to research teams on request.</p>\n<p>\\\n\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-av8301f.png\" alt=\"Table 1: Results of the leave-one-out cross-evaluation for the large corpus (left) and the controlled corpus\" /></p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-qd930eo.png\" alt=\"Table 2: Confusion matrix for the leave-one-out evaluation on the larger corpus\" /></p>\n<p>\\\n\\\n\\\nWe choose to designate the candidates we study only by their first name and initial, not to impact internet searches on their names.</p>\n<p>\\\nFinally, we remind that this paper does not assert in any way that other persons outside of the persons studied here could not have written the Q drops.</p>\n<h3 id=\"acknowledgements\">Acknowledgements</h3>\n<p>The authors would like to thank David D. Kirkpatrick from the New York Times and Frederick Brennan for their help during this investigation. Errors remain our own. <strong>Funding</strong>: no funding was used for this research. <strong>Data and materials availability</strong>: Code is available on Zenodo, doi: 10.5281/zenodo.6164620. Data available on request.</p>\n<h2 id=\"references\">References</h2>\n<p>Max Aliapoulios, Antonis Papasavva, Cameron Ballard, Emiliano De Cristofaro, Gianluca Stringhini, Savvas Zannettou, and Jeremy Blackburn. The gospel according to q: Understanding the qanon conspiracy from the perspective of canonical information. arXiv preprint, arXiv:2101.08750, 2021.</p>\n<p>\\\nShlomo Argamon, Moshe Koppel, James W. Pennebaker, and Jonathan Schler. Automatically Profiling the Author of an Anonymous Text. Communications of the ACM, 52(2):119–123, February 2009. ISSN 00010782. doi: 10.1145/1461928.1461959.</p>\n<p>\\\nStephane J Baele, Lewys Brace, and Travis G Coan. Variations on a theme? comparing 4chan, 8kun, and other chans’ far-right “\\pol” boards. Perspectives on Terrorism, 15(1):65–80, 2021.</p>\n<p>\\\nJean-Paul Benz´ecri. L’Analyse des Donn´ees. Volume II. L’Analyse des Correspondances. Paris, 1973.</p>\n<p>\\\nJohanna Bjorklund and Niklas Zechner. Syntactic methods for topic-independent authorship attribution. Natural Language Engineering, 23(5):789– 806, 2017.</p>\n<p>\\\nFlorian Cafiero and Jean-Baptiste Camps. Why moli`ere most likely did write his plays. Science advances, 5(11):eaax5489, 2019.</p>\n<p>\\\nFlorian Cafiero and Jean-Baptiste Camps. ‘Psych´e’ as a Rosetta stone? Assessing collaborative authorship in the French 17th century theatre. In Proceedings of the Conference on Computational Humanities Research 2021 Amsterdam, the Netherlands, November 17-19, 2021., pages 377–391, 2021. URL https://ceur-ws.org/Vol-2989/ long_paper51.pdf.</p>\n<p>\\\nFlorian Cafiero and Jean-Baptiste Camps. Affaires de style. Le Robert, 2022.</p>\n<p>\\\nJean-Baptiste Camps, Thibault Cl´erice, and Florian Cafiero. Supervised Stylometry: SuperStyl. Ecole ´ des chartes, Paris, 2021. URL https://github. com/SupervisedStylometry/SuperStyl/.</p>\n<p>\\\nCarole E Chaski. Who’s at the keyboard? authorship attribution in digital evidence investigations. International journal of digital evidence, 4(1):1–13, 2005.</p>\n<p>\\\nComit´e d’´ethique du CNRS. Pratiquer une recherche int`egre et responsable: Guide. CNRS, Paris, 2017. URL https://comite-ethique.cnrs.fr/wpcontent/uploads/2019/10/GUIDE-2017-FR.pdf.</p>\n<p>\\\nMalcolm Coulthard. Author identification, idiolect, and linguistic uniqueness. Applied linguistics, 25 (4):431–447, 2004.</p>\n<p>\\\nOlivier De Vel, Alison Anderson, Malcolm Corney, and George Mohay. Multi-topic e-mail authorship attribution forensics. In Proceedings ACM Conference on Computer Security-Workshop on Data Mining for Security Applications, 2001.</p>\n<p>\\\nJoachim Diederich, Jorg Kindermann, Edda Leopold, ¨ and Gerhard Paass. Authorship attribution with support vector machines. Applied intelligence, 19 (1):109–123, 2003.</p>\n<p>\\\nMaciej Eder. Does size matter? Authorship attribution, small samples, big problem. Literary and Linguistic Computing, 30(2):167–182, June 2015. ISSN 0268-1145. doi: 10.1093/llc/fqt066. URL https://academic.oup.com/dsh/article/ 30/2/167/390738.</p>\n<p>\\\nMaciej Eder. Rolling stylometry. Digital Scholarship in the Humanities, 31(3):457–469, 2016.</p>\n<p>\\\nMaciej Eder. Short Samples in Authorship Attribution: A New Approach. In DH, Montr´eal, 2017. ADHO. URL https://dh2017.adho.org/ abstracts/341/341.pdf.</p>\n<p>\\\nMaciej Eder. Elena ferrante: a virtual author. In Drawing Elena Ferrante’s Profile, pages 31–46. Padova University Press Padova, 2018.</p>\n<p>\\\nGavin Fox (pseudo). Where in the world is q? clues from image metadata, 2021. URL https: //catdogmix.com/2021/05/11/where-in-theworld-is-q-clues-from-image-metadata/.</p>\n<p>\\\nAmanda Garry, Samantha Walther, Rukaya Rukaya, and Ayan Mohammed. Qanon conspiracy theory: Examining its evolution and mechanisms of radicalization. Journal for Deradicalization, 26:152– 216, 2021.</p>\n<p>\\\nBenyamin Ghojogh and Mark Crowley. The theory behind overfitting, cross validation, regularization, bagging, and boosting: tutorial. arXiv preprint arXiv:1905.12787, 2019.</p>\n<p>\\\nDavid Gilbert. How qanon is tearing families apart. VICE, 26, 2021. URL https://www.vice.com/en/article/dy8ayx/howqanon-is-tearing-families-apart.</p>\n<p>\\\nAlexander AG Gladwin, Matthew J Lavin, and Daniel M Look. Stylometry and collaborative authorship: Eddy, Lovecraft, and ‘The Loved Dead’. Digital Scholarship in the Humanities, 32(1):123– 140, 2017.</p>\n<p>\\\nMohamad Hoseini, Philipe Melo, Fabricio Benevenuto, Anja Feldmann, and Savvas Zannettou. On the globalization of the qanon conspiracy theory through telegram. arXiv preprint, arXiv:2105.13020, 2021. URL http://arxiv. org/abs/2105.13020.</p>\n<p>\\\nCullen Huback. Q: Into the storm, 2021. 6 episodes HBO Documentary.</p>\n<p>\\\nMingzhe Jin and Minghu Jiang. Text clustering on authorship attribution based on the features of punctuations usage. In 2012 IEEE 11th International Conference on Signal Processing, volume 3, pages 2175–2178. IEEE, 2012.</p>\n<p>\\\nPatrick Juola. Authorship attribution, volume 3. Now Publishers Inc, 2008.</p>\n<p>\\\nPatrick Juola. Stylometry and immigration: A case study. Journal of Law and Policy, 21:287, 2012.</p>\n<p>\\\nPatrick Juola. The rowling case: a proposed standard analytic protocol for authorship questions. Digital Scholarship in the Humanities, 30(suppl 1):i100– i113, 2015.</p>\n<p>\\\nJeffrey Kaplan. A conspiracy of dunces: Good americans vs. a cabal of satanic pedophiles? Terrorism and Political Violence, 33(5):917–921, 2021. doi: 10.1080/09546553.2021.1932342.</p>\n<p>\\\nMike Kestemont. Function words in authorship attribution. From black magic to theory? In Proceedings of the 3rd Workshop on Computational Linguistics for Literature (CLFL), pages 59–66, Stroudsburg PA, 2014. Association for Computation Linguistics.</p>\n<p>\\\nMike Kestemont, Sara Moens, and Jeroen Deploige. Collaborative authorship in the twelfth century: A stylometric study of hildegard of bingen and guibert of gembloux. Digital Scholarship in the Humanities, 30(2):199–224, 2015.</p>\n<p>\\\nMike Kestemont, Justin Stover, Moshe Koppel, Folgert Karsdorp, and Walter Daelemans. Authenticating the writings of julius caesar. Expert Systems with Applications, 63:86–96, 2016.</p>\n<p>\\\nMike Kestemont, Efstathios Stamatatos, Enrique Manjavacas, Walter Daelemans, Martin Potthast, and Benno Stein. Overview of the cross-domain authorship attribution task at pan 2019. In CLEF (Working Notes), 2019.</p>\n<p>\\\nAdrienne LaFrance. The Prophecies of Q. The Atlantic, May 2020. URL https://www.theatlantic.com/magazine/archive/ 2020/06/qanon-nothing-can-stop-what-is-coming/610567/. Section: Ideas.</p>\n<p>\\\nS´ebastien Lˆe, Julie Josse, and Franc¸ois Husson. FactoMineR: A package for multivariate analysis. Journal of Statistical Software, 25(1):1–18, 2008. doi: 10.18637/jss.v025.i01.</p>\n<p>\\\nWincenty Lutoslawski. Principes de stylom´etrie appliqu´es a la chronologie des oeuvres de ` platon. Revue des etudes grecques, 11(41): 61–81, 1898. doi: 10.3406/reg.1898.5847. URL https://www.persee.fr/doc/reg<em>0035- 2039</em>1898<em>num</em>11<em>41</em>5847.</p>\n<p>\\\nRangsipan Marukatat, Robroo Somkiadcharoen, Ratthanan Nalintasnai, and Tappasarn Aramboonpong. Authorship attribution analysis of thai online messages. In 2014 International Conference on Information Science &amp; Applications (ICISA), pages 1–4. IEEE, 2014.</p>\n<p>\\\nGeorge K Mikros. Authorship attribution and gender identification in greek blogs. Methods and Applications of Quantitative Linguistics, 21:21–32, 2012.</p>\n<p>\\\nGeorge K Mikros. Blended authorship attribution: Unmasking elena ferrante combining different author profiling methods. UPPADO, page 85, 2017.</p>\n<p>\\\nFrederick Mosteller and David L Wallace. Inference in an authorship problem: A comparative study of discrimination methods applied to the authorship of the disputed federalist papers. Journal of the American Statistical Association, 58(302):275–309, 1963.</p>\n<p>\\\nLincoln Mullen. textreuse: Detect Text Reuse and Document Similarity, 2020. URL https://CRAN. R-project.org/package=textreuse. R package version 0.1.5.</p>\n<p>\\\nAndrew Y Ng et al. Preventing” overfitting” of cross-validation data. In ICML, volume 97, pages 245– 253. Citeseer, 1997.</p>\n<p>\\\nOrphanalytics. Style analysis by machine learning reveals that two authors likely shared the writing of QAnon’s messages at two different periods in time. Technical report, Vevey, December 2020. URL https://www.orphanalytics.com/ en/news/whitepaper202012.</p>\n<p>\\\nSiham Ouamour and Halim Sayoud. Authorship attribution of ancient texts written by ten arabic travelers using a smo-svm classifier. In 2012 International Conference on Communications and Information Technology (ICCIT), pages 44–47. IEEE, 2012.</p>\n<p>\\\nAntonis Papasavva, Jeremy Blackburn, Gianluca Stringhini, Savvas Zannettou, and Emiliano De Cristofaro. ‘is it a qoincidence?’: An exploratory study of qanon on voat. In Proceedings of the Web Conference 2021, pages 460–471, New York, 2021. Association for Computing Machinery. doi: 10.1145/3442381.3450036.</p>\n<p>\\\nF. Pedregosa, G. Varoquaux, A. Gramfort, V. Michel, B. Thirion, O. Grisel, M. Blondel, P. Prettenhofer, R. Weiss, V. Dubourg, J. Vanderplas, A. Passos, D. Cournapeau, M. Brucher, M. Perrot, and E. Duchesnay. Scikit-learn: Machine learning in Python. Journal of Machine Learning Research, 12: 2825–2830, 2011.</p>\n<p>\\\nJames W. Pennebaker. The Secret Life of Pronouns: What Our Words Say About Us. Bloomsbury Publishing, New York, reprint edition edition, January 2013. ISBN 978-1-60819-496-4.</p>\n<p>\\\nPetr Plechac. Relative contributions of Shakespeare and Fletcher in Henry VIII: An analysis based on most frequent words and most frequent rhythmic patterns. Digital Scholarship in the Humanities, fqaa032, 2020. doi: 10.1093/llc/fqaa032. URL https://arxiv.org/pdf/1911.05652.pdf.</p>\n<p>\\\nJan Rybicki. Partners in life, partners in crime. In Drawing Elena Ferrante’s Profile, pages 111–122. Padova University Press, 2018.</p>\n<p>\\\nJan Rybicki, David Hoover, and Mike Kestemont. Collaborative authorship: Conrad, Ford and rolling delta. Literary and Linguistic Computing, 29(3): 422–431, 2014. Publisher: Oxford University Press.</p>\n<p>\\\nUpendra Sapkota, Steven Bethard, Manuel Montes, and Thamar Solorio. Not all character n-grams are created equal: A study in authorship attribution. In Proceedings of the 2015 conference of the North American chapter of the Association for Computational Linguistics: Human language technologies, pages 93–102, Stroudsburg PA, 2015. Association for Computational Linguistics.</p>\n<p>\\\nSantiago Segarra, Mark Eisen, and Alejandro Ribeiro. Authorship attribution through function word adjacency networks. IEEE Transactions on Signal Processing, 63(20):5464–5478, 2015.</p>\n<p>\\\nEfstathios Stamatatos, Francisco Rangel, Michael Tschuggnall, Benno Stein, Mike Kestemont, Paolo Rosso, and Martin Potthast. Overview of pan 2018. In International conference of the cross-language evaluation forum for european languages, pages 267–285. Springer, 2018.</p>\n<p>\\\nKarina van Dalen-Oskam and Joris Van Zundert. Delta for middle Dutch author and copyist distinction in Walewein. Literary and Linguistic Computing, 22(3):345–362, 2007.</p>\n<p>\\\nJana Winter. Fbi document warns conspiracy theories are a new domestic terrorism threat. Yahoo News, 1, 2019. URL https://news.yahoo.com/fbidocuments-conspiracy-theories-terrorism160000507.html.</p>\n<p>\\\nBrandy Zadrozny and Ben Collins. Who is behind the Qanon conspiracy? We’ve traced it to three people. NBC News, August 2018. URL https://www.nbcnews.com/tech/technews/how-three-conspiracy-theorists-tookq-sparked-qanon-n900531.</p>\n<p>\\</p>\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2303.02078\">available on arxiv</a> under CC BY 4.0 DEED license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The four startups from YC’s Fall batch that enterprises should pay attention to","url":"https://techcrunch.com/2024/12/07/the-four-startups-from-ycs-fall-batch-that-enterprises-should-pay-attention-to/","date":1733583600,"author":"Rebecca Szkutak","unread":true,"desc":"","content":"<p>Notable Silicon Valley startup accelerator Y Combinator held a Demo Day for its inaugural Fall cohort this week. The 95 startups in this latest batch looked quite similar to recent YC cohorts in the sense that it includes many AI startups. If I did my math right, 87% of the startups in this batch are [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"New York’s top VCs under 30","url":"https://techcrunch.com/2024/12/07/new-yorks-top-vcs-under-30/","date":1733584153,"author":"Dominic-Madori Davis","unread":true,"desc":"","content":"<p>The next generation of New York City investors are already making their mark in the Big Apple.&#160; They come from big-name venture firms like Female Founders Fund and Lerer Hippeau and smaller ones like Chai Ventures. They work in areas like growth, consumer, and health. They canoe, hike, and play pickleball on the weekends. We [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"As YC retreats from Africa, alumni launch accelerators to fill the gap","url":"https://techcrunch.com/2024/12/07/as-yc-retreats-from-africa-alumni-launch-accelerators-to-fill-the-gap/","date":1733584522,"author":"Tage Kene-Okafor","unread":true,"desc":"","content":"<p>The influential accelerator Y Combinator made a splash in Africa in 2020 when it shined its light on the market and began to accept startups from the region into its cohorts. The move was huge: in this nascent market, startups especially rely on programs like these to find their feet and connect with investors, and [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Google Says Its New PaliGemma 2 AI Models Can Identify Emotions. Should We Be Worried?","url":"https://tech.slashdot.org/story/24/12/06/0222235/google-says-its-new-paligemma-2-ai-models-can-identify-emotions-should-we-be-worried?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733585640,"author":"EditorDavid","unread":true,"desc":"","content":"\"Google says its new AI model family has a curious feature: the ability to 'identify' emotions,\" writes TechCrunch. And that's raising some concerns...\n\n\nAnnounced on Thursday, the PaliGemma 2 family of models can analyze images, enabling the AI to generate captions and answer questions about people it \"sees\" in photos. \"PaliGemma 2 generates detailed, contextually relevant captions for images,\" Google wrote in a blog post shared with TechCrunch, \"going beyond simple object identification to describe actions, emotions, and the overall narrative of the scene.\" Emotion recognition doesn't work out of the box, and PaliGemma 2 has to be fine-tuned for the purpose. Nonetheless, experts TechCrunch spoke with were alarmed at the prospect of an openly available emotion detector... \n\n\n\"Emotion detection isn't possible in the general case, because people experience emotion in complex ways,\" Mike Cook, a research fellow at Queen Mary University specializing in AI, told TechCrunch. \"Of course, we do think we can tell what other people are feeling by looking at them, and lots of people over the years have tried, too, like spy agencies or marketing companies. I'm sure it's absolutely possible to detect some generic signifiers in some cases, but it's not something we can ever fully 'solve.'\" The unsurprising consequence is that emotion-detecting systems tend to be unreliable and biased by the assumptions of their designers... \"Interpreting emotions is quite a subjective matter that extends beyond use of visual aids and is heavily embedded within a personal and cultural context,\" said Heidy Khlaaf, chief AI scientist at the AI Now Institute, a nonprofit that studies the societal implications of artificial intelligence. \"AI aside, research has shown that we cannot infer emotions from facial features alone....\" \n\nThe biggest apprehension around open models like PaliGemma 2, which is available from a number of hosts, including AI dev platform Hugging Face, is that they'll be abused or misused, which could lead to real-world harm. \"If this so-called emotional identification is built on pseudoscientific presumptions, there are significant implications in how this capability may be used to further &mdash; and falsely &mdash; discriminate against marginalized groups such as in law enforcement, human resourcing, border governance, and so on,\" Khlaaf said. \n\nThose concerrns were echoed by a professor in data ethics and AI at the Oxford Internet Institute, Sandra Wachter, who gave this quote to TechCrunch. With models like this, \"I can think of myriad potential issues... that can lead to a dystopian future, where your emotions determine if you get the job, a loan, and if you're admitted to uni.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Says+Its+New+PaliGemma+2+AI+Models+Can+Identify+Emotions.+Should+We+Be+Worried%3F%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F06%2F0222235%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F06%2F0222235%2Fgoogle-says-its-new-paligemma-2-ai-models-can-identify-emotions-should-we-be-worried%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://tech.slashdot.org/story/24/12/06/0222235/google-says-its-new-paligemma-2-ai-models-can-identify-emotions-should-we-be-worried?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23543137&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The Home Assistant Model: A Good Entry Point","url":"https://hackernoon.com/the-home-assistant-model-a-good-entry-point?source=rss","date":1733587215,"author":"Nicolas Fränkel","unread":true,"desc":"","content":"<p>Home Assistant is a massive beast. It can be overwhelming for a newcomer; it was for me. In this post, I want to describe the underlying model of Home Assistant, which is a good entry point for your home automation journey.</p>\n<p>\\\nThe biggest issue in describing the Home Assistant is the number of conflicting sources for this model:</p>\n<p>\\</p>\n<ul>\n<li>The <code>helpers</code> package of the <a href=\"https://github.com/home-assistant/core/tree/dev/homeassistant/helpers\">GitHub repository</a>.</li>\n</ul>\n<p>\\</p>\n<ul>\n<li>The database; disclaimer: I didn't find the schema generation in the code, and I wasn't bold enough to check the deployed SQLite database.</li>\n</ul>\n<p>\\</p>\n<ul>\n<li>The <a href=\"https://www.home-assistant.io/getting-started/concepts-terminology/\">documentation</a>.</li>\n</ul>\n<p>\\</p>\n<ul>\n<li>The web interface.</li>\n</ul>\n<p>\\\nAs far as I understand it, here's the conceptual model.</p>\n<p><img src=\"https://cdn.hackernoon.com/images/ySK5UmEKUigi6gZlUx5UYDhUNhk1-be02lu3.jpeg\" alt=\"\" /></p>\n<h2 id=\"integrations\">Integrations</h2>\n<blockquote>\n  <p>Integrations are pieces of software that allow Home Assistant to connect to other software and platforms. For example, a product by Philips called Hue would use the Philips Hue integration and allow Home Assistant to talk to the hardware controller Hue Bridge. Any Home Assistant compatible devices connected to the Hue Bridge would appear in Home Assistant as devices.</p>\n  <p>\\\n  -- <a href=\"https://www.home-assistant.io/getting-started/concepts-terminology/#integrations\">Home Assistant documentation</a></p>\n</blockquote>\n<p>\\\nWhen you switch on Home Assistant for the first time, it's a blank slate. You must make it communicate with your different devices. That's the role of <code>Integration</code>; thus, I think it's a critical entity.</p>\n<p>\\\nYou can add an <code>Integration</code> on the <a href=\"https://home.frankel.ch:8443/config/integrations/dashboard\">integration dashboard</a>: there's an <em>ADD INTEGRATION</em> in the lower left corner. Alternatively, you can add it from its documentation page, via a <em>ADD INTEGRATION TO MY HOME ASSISTANT</em> button. In this case, clicking on the latter opens a new page.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/ySK5UmEKUigi6gZlUx5UYDhUNhk1-hq12lrf.jpeg\" alt=\"\" /></p>\n<p>\\\nYou can change it; the URL is stored on the browser.</p>\n<p><img src=\"https://cdn.hackernoon.com/images/ySK5UmEKUigi6gZlUx5UYDhUNhk1-tg22lmk.jpeg\" alt=\"\" /></p>\n<p>Some integrations require additional configuration, <em>e.g.</em>, authentication.</p>\n<h2 id=\"devices\">Devices</h2>\n<blockquote>\n  <p>Devices are a logical grouping for one or more entities. A device may represent a physical device, which can have one or more sensors. The sensors appear as entities associated with the device. For example, a motion sensor is represented as a device. It may provide motion detection, temperature, and light levels as entities. Entities have states such as detected when motion is detected and clear when there is no motion.</p>\n  <p>\\\n  -- <a href=\"https://www.home-assistant.io/getting-started/concepts-terminology/#devices\">Home Assistant documentation</a></p>\n</blockquote>\n<p>\\\nOnce you've added the integration, you can add <code>Device</code>:</p>\n<p>\\</p>\n<ul>\n<li><p>Some categorize as <em>Service</em> when they need a Cloud connection, <em>e.g.</em>, <a href=\"https://www.home-assistant.io/integrations/google_assistant_sdk/\">Google Cloud SDK</a> or <a href=\"https://www.home-assistant.io/integrations/github/\">GitHub</a>.</p>\n<p><img src=\"https://cdn.hackernoon.com/images/ySK5UmEKUigi6gZlUx5UYDhUNhk1-al32lye.jpeg\" alt=\"\" /></p>\n<p>\\</p></li>\n<li><p>Some as <em>Device</em> when they need one, <em>e.g.</em>, <a href=\"https://www.home-assistant.io/integrations/hue/\">Philips Hue</a>.</p>\n<p><img src=\"https://cdn.hackernoon.com/images/ySK5UmEKUigi6gZlUx5UYDhUNhk1-c442l7k.jpeg\" alt=\"\" /></p></li>\n</ul>\n<h2 id=\"entities\">Entities</h2>\n<blockquote>\n  <p>Entities are the basic building blocks to hold data in Home Assistant. An entity represents a sensor, actor, or function in Home Assistant. Entities are used to monitor physical properties or to control other entities. An entity is usually part of a device or a service. Entities have states.</p>\n  <p>\\\n  -- <a href=\"https://www.home-assistant.io/getting-started/concepts-terminology/#entities\">Home Assistant documentation</a></p>\n</blockquote>\n<p>\\\nFor example, the Philips Hue motion sensor device has three different available sensors:</p>\n<p>\\</p>\n<ul>\n<li><p>Illuminance in Lux</p></li>\n<li><p>Motion as a boolean</p></li>\n<li><p>Temperature in Celsius</p>\n<p><img src=\"https://cdn.hackernoon.com/images/ySK5UmEKUigi6gZlUx5UYDhUNhk1-e552lb0.jpeg\" alt=\"\" /></p></li>\n</ul>\n<p>Unexpectedly, a motion sensor provides a temperature sensor. Check your devices for such sensors; you might be in for a good surprise.</p>\n<h2 id=\"otherobjects\">Other Objects</h2>\n<ul>\n<li><p>Areas:</p>\n<p>\\\nAn <code>Area</code> represents a location. You can put a <strong>physical</strong>  <code>Device</code> in an <code>Area</code>.</p>\n<p>\\</p></li>\n<li><p>Automations:</p>\n<p>\\\nAn <code>Automation</code> is pretty self-explanatory. Each consists of two main components: a trigger and an action. Note that you can add an optional condition.</p>\n<p>\\\nFor example, let's imagine a Welcome Home <code>Automation</code>:</p>\n<p>\\</p></li>\n<li><p>The trigger is when the user enters a geofenced perimeter around one's home.</p></li>\n<li><p>The action is to switch on the lights</p></li>\n<li><p>Yet, switching on the lights in daylight doesn't make sense.</p>\n<p>\\\nThe condition would be \"only during the night.\"</p>\n<p>\\</p></li>\n<li><p>Scripts:</p>\n<p>\\\nAs per the documentation, a <code>Script</code> is akin to an <code>Automation</code> but with no trigger; it's a named action. It lets you define the action once and reuse it across several <code>Automation</code> objects. Think DRY.</p>\n<p>\\</p></li>\n<li><p>Add-ons:</p>\n<p>\\\nWhile an <code>Integration</code> allows interfacing with an external device or service, an <code>Add-On</code> provides a service. In other words, an <code>Add-On</code> extends the platform itself. For example, I installed the <a href=\"https://letsencrypt.org/\">Let's Encrypt</a> add-on to my Home Assistant installation to automatically manage a TLS certificate.</p>\n<p>\\</p></li>\n<li><p>Scenes:</p>\n<p>\\\nA <code>Scene</code> for a <code>Device</code> is akin to a <em>profile</em> for your phone. It's a named set of configurations that you save and reuse. I must admit that I don't use profiles on my phone; I don't have any <code>Scene</code> objects at the moment, and I have to understand their usage beyond lighting.</p></li>\n</ul>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>In this post, I described the model objects available in Home Assistant. In the next post, I'll migrate from the proprietary Philips Hue automation to Home Assistant.</p>\n<p>\\\n<strong>To go further:</strong></p>\n<ul>\n<li><a href=\"https://www.home-assistant.io/\">Home Assistant</a></li>\n<li><a href=\"https://www.home-assistant.io/getting-started/concepts-terminology/\">Concepts and terminology</a></li>\n</ul>\n<hr />\n<p><em>Originally published at <a href=\"https://blog.frankel.ch/home-assistant/2/\">A Java Geek</a> on December 2nd, 2024</em></p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The HackerNoon Newsletter: Wall Street (Probably) Doesnt Want You to Know About Duck Code (12/7/2024)","url":"https://hackernoon.com/12-7-2024-newsletter?source=rss","date":1733587487,"author":"Noonification","unread":true,"desc":"","content":"\n              \n        <p><strong>How are you, hacker?</strong></p>\n        <br />\n        <p>🪐 What’s happening in tech today, December 7, 2024?</p>\n        <br />\n        <p>\n          The\n          <a href=\"https://hackernoon.com/noonification\" target=\"_blank\" rel=\"noopener\"> HackerNoon Newsletter</a>\n          brings the HackerNoon \n          <a href=\"https://hackernoon.com\" target=\"_blank\" rel=\"noopener\">homepage</a>\n          straight to your inbox.\n          <a href=\"https://hackernoon.com/on-this-day\" target=\"_blank\" rel=\"noopener\">On this day,</a>\n          \n            <strong>The World’s Most Powerful Computer is Announced</strong> in 1962,  <strong>The Japanese Military Attacked Pearl Harbor</strong> in 1941,  <strong>The Goner Worm Teens are Arrested</strong> in 2001, \n          \n          and  we present you with these top quality stories. \n          \n            From \n        <a href=\"https://hackernoon.com/fight-for-your-right-to-use-bitcoin-as-it-was-intended-to-be-used\" class=\"eventTitle\"><strong>Fight For Your Right To Use Bitcoin As It Was Intended To Be Used</strong></a>\n       to \n        <a href=\"https://hackernoon.com/a-pentester-took-apart-a-websites-code-to-prove-it-was-totally-pointless\" class=\"eventTitle\"><strong>A Pentester Took Apart a Website’s Code to Prove It Was Totally Pointless</strong></a>,\n       let’s dive right in.\n          \n        </p>\n      \n              \n          <h2><a href=\"https://hackernoon.com/new-evidence-changes-how-we-understand-inflation-and-monetary-policy\">New Evidence Changes How We Understand Inflation and Monetary Policy</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/a-scale-balanced-by-money-on-either-side-ledhwhi1mgqd1scuzpgo9bh1.png\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/keynesian\">@keynesian</a> [ 18 Min read ] Discover key insights on inflation, DSGE models, and stochastic equilibrium in New Keynesian economics with fresh econometric approaches. <a href=\"https://hackernoon.com/new-evidence-changes-how-we-understand-inflation-and-monetary-policy\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/fight-for-your-right-to-use-bitcoin-as-it-was-intended-to-be-used\">Fight For Your Right To Use Bitcoin As It Was Intended To Be Used</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/wUxH6n79uUcaBR5mT9FGjkfCwtL2-o522x1b.jpeg\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/thoughtcrimeboss\">@thoughtcrimeboss</a> [ 30 Min read ] We have won the battle, but the war on Bitcoin isnt over yet, heres how you can help. <a href=\"https://hackernoon.com/fight-for-your-right-to-use-bitcoin-as-it-was-intended-to-be-used\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/wall-street-probably-doesnt-want-you-to-know-about-duck-code\">Wall Street (Probably) Doesnt Want You to Know About Duck Code</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/0x1fb1816da507a669f56a866db0f7df54cc539209-ftx2zzo.png\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/professor0\">@professor0</a> [ 13 Min read ] The Duck is present in all major financial markets, orchestrating movements on a grand scale. <a href=\"https://hackernoon.com/wall-street-probably-doesnt-want-you-to-know-about-duck-code\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/youre-probably-spending-way-too-much-on-sms-based-verification\">You’re Probably Spending Way Too Much on SMS-Based Verification</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/xvOYnu9hBqg6TXwx0T1OwhaIXTT2-b2031al.png\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/keshiarose\">@keshiarose</a> [ 5 Min read ] SMS verification doesn’t have to drain your budget. Learn how recognizing your users can save money and their patience without sacrificing security. <a href=\"https://hackernoon.com/youre-probably-spending-way-too-much-on-sms-based-verification\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/a-pentester-took-apart-a-websites-code-to-prove-it-was-totally-pointless\">A Pentester Took Apart a Website’s Code to Prove It Was Totally Pointless</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/TYJUMtiClUZJ10sVuaeuHOy548K2-mg1832pt.png\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/vognik\">@vognik</a> [ 16 Min read ] In this article, Ill walk you through how to reverse-engineer Javascript code and show you how to write my Burp Suite extension in practice. <a href=\"https://hackernoon.com/a-pentester-took-apart-a-websites-code-to-prove-it-was-totally-pointless\">Read More.</a></p>\n        \n              \n        <br />\n        <p>🧑‍💻 What happened in your world this week?</p>\n        <p>\n          It's been said that\n          <a href=\"https://hackernoon.com/developers-the-why-and-how-to-writing-technical-articles-54e824789ef6\">writing can help consolidate technical knowledge</a>,\n          <a href=\"https://hackernoon.com/how-can-non-writers-become-effective-bloggers-1pq32wd\">establish credibility</a>,\n          <a href=\"https://hackernoon.com/how-can-non-writers-become-effective-bloggers-1pq32wd\"> and contribute to emerging community standards</a>.\n          Feeling stuck? We got you covered ⬇️⬇️⬇️\n        </p>\n        <br />\n        <p>\n          <a href=\"https://app.hackernoon.com/mobile/lZx3fmlPdlPJpVBIdble\">ANSWER THESE GREATEST INTERVIEW QUESTIONS OF ALL TIME</a>\n        </p>\n        <br />\n        <p>We hope you enjoy this worth of free reading material. Feel free to forward this email to a nerdy friend who'll love you for it.See you on Planet Internet! With love, \n The HackerNoon Team ✌️</p>\n        <br />\n        <p><img src=\"https://cdn.hackernoon.com/images/the-hackernoon-newsletter-footer.png\" alt /></p>\n      \n            ","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Thanks to Microsoft Collaboration, iFixit Now Sells Genuine Xbox Repair Parts","url":"https://games.slashdot.org/story/24/12/07/0218205/thanks-to-microsoft-collaboration-ifixit-now-sells-genuine-xbox-repair-parts?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733589240,"author":"EditorDavid","unread":true,"desc":"","content":"\"We're excited to be working with Microsoft to keep Xboxes running longer and out of the waste heap,\" iFixit's director of sustainability told The Verge.\n\n\niFixit now sells genuine Xbox parts you can use to repair your Xbox Series X or S and offers official guides to help with fixes [including both the all-digital and disk drive editions]... \niFixit's Microsoft Repair Hub also features iFixit's parts for repairing Microsoft Surface devices, which it started selling in 2023. \"Since we launched our Surface parts collaboration with Microsoft last year, we've been helping our customers repair their own Microsoft laptops and tablets &mdash; and it's awesome to be able to offer Xbox owners the same opportunity,\" says Elizabeth Chamberlain, iFixit's director of sustainability.\n \nThe article points out that iFixit also sells \"nearly every part of the Steam Deck\" and \"a bunch of repair guides for Valve's handheld PC, too,\" along with genuine repair parts for Google's Pixel phones and the Pixel Tablet. \n\n\"With Microsoft, we've created a one-stop place for guides, tools, and spare parts to make self-service repair accessible to anyone,\" says iFixit's new web page. \"Imagine how different the world would be if repairing every device could be this easy.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Thanks+to+Microsoft+Collaboration%2C+iFixit+Now+Sells+Genuine+Xbox+Repair+Parts+%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F12%2F07%2F0218205%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F12%2F07%2F0218205%2Fthanks-to-microsoft-collaboration-ifixit-now-sells-genuine-xbox-repair-parts%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://games.slashdot.org/story/24/12/07/0218205/thanks-to-microsoft-collaboration-ifixit-now-sells-genuine-xbox-repair-parts?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23544169&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"How Machine Learning Decides Your Business Loan's Fate in Milliseconds","url":"https://hackernoon.com/how-machine-learning-decides-your-business-loans-fate-in-milliseconds?source=rss","date":1733590811,"author":"Deon Crasto","unread":true,"desc":"","content":"<p>\\\nAs someone who's spent years in the credit risk space, I've watched the transformation of small business lending from a relationship-driven process to one where machines make split-second decisions about creditworthiness. But here's what most business owners don't realize: if you received a quick rejection, chances are your application never made it to the credit decision process.</p>\n<p>\\\nSee Lenders or alternate lenders in this case have to pick and choose resources to deploy. There’s a metric we refer to specifically - cost to serve (CtS) - which determines the total costs from the lead generation page, marketing and all the human touch points involved to process an application. Lenders look to boost profit margins by optimizing the cost it takes to serve a loan. Any spare change goes directly into the company’s bottom line.</p>\n<p>\\\nTraditionally, banks were the only option for small businesses to access capital. And it made sense - in a way. Assuming you have a business or personal account with them, banks have your cash flow information, they know the owners, and they have the most data to make smart credit decisions. However, there’s another side to the story there. See, we live in an era where <strong><a href=\"https://www.pymnts.com/smbs/2024/white-house-working-capital-program-targets-small-business-stability-through-2027/#:~:text=Only%20about%208.5%25%20of%20small,Intelligence%20and%20Cross%20River%20collaboration.\">only 8.5% of small businesses find working capital</a></strong> readily available from traditional banks - so the opportunity for technology-enabled lenders has never been greater.</p>\n<p>\\\nThere’s a delicate balance at play here. And that’s where automated scoring and ML-driven declines come in. To streamline and serve a targeted customer base, lending institutions employ ‘hard cuts’ - the industry's equivalent of a nightclub's velvet rope. When you apply for a loan as a fresh applicant, the lender will typically collect information about you, your business, cash flow etc. A lot of these early evaluations rely on self-reported data. The system then generates a list of data points to see if you’re application should even make it to the credit decisioning engine. And that’s where the dreaded hard cuts come in and I’m here to tell you how they work.</p>\n<p>\\\nFor reference, I led the decision science product team at Ondeck Capital and have some background determining and implementing these thresholds - and I want to explain why they’re in palace and how they work. While modeling a typical portfolio, we’d dig into early signals for creditworthiness based on characteristics of bad loans we’ve given out in the past to determine what our absolute minimum thresholds ought to be. It makes sense, both in practice and in theory.</p>\n<p>\\\nThis data-driven approach serves two crucial purposes. First, it helps protect the lender from high-risk loans that are statistically more likely to default. Second, it streamlines the lending process by quickly filtering out applications that don't meet basic risk management criteria, allowing more resources to be devoted to promising candidates.</p>\n<p>\\\nProcessing a small business loan application is expensive. Traditional banks spend thousands of dollars evaluating each application, conducting due diligence, and making credit decisions. With margins already tight in small business lending, banks need to ensure they're spending these resources on applications they're likely to approve.</p>\n<p>\\\nToo low a credit score? Rejected. Business less than a year old? Rejected. Operating in a high-risk industry? Rejected. All this happens before anyone even looks at your financial statements or business plan. And it’s all done through modular ML modules for each characteristic. It’s not like you need multiple hard cuts to go against you. Your application gets rejected even if miss one criterion. This might sound harsh, but it's transforming the economics of small business lending.</p>\n<p>\\\nLenders therefore use this mechanism to determine who makes it through. Sometimes though, it’s not just a hard and fast rule. In many cases sophisticated machines determine thresholds dynamicially through classification models and weighted average scores. The level and nuance of a hard cut relies on the lender and their risk appetite.</p>\n<p>\\\nFor business owners, understanding this new reality is crucial. The days of walking into your local bank branch and persuading the manager to take a chance on your business are largely over. Instead, success in securing business credit now requires meeting specific, predetermined criteria before a human ever sees your application.</p>\n<p>\\\nThere’s an opportunity here though that I should mention. For instance, one lender's hard cuts may not apply to another lender’s credit policy. If Lending Company A has a hard requirement for 2 years in business but Lending Company B only requires 1, there’s an opportunity to leverage this difference to attract more applicants. Businesses that may struggle to meet the stricter criteria of Company A could find a welcoming alternative with Company B. This type of cross-selling and lead generation benefits all in this case. Lender A might charge a referral fee, Lender B gets a potential customer, and the applicant gets an opportunity to access capital.</p>\n<p>\\\nThe next time you apply for a business loan, remember: your first challenge isn't convincing a banker to believe in your business. It's getting past the automated gatekeepers that decide whether your application deserves a deeper look. In today's lending landscape, that might be the most important hurdle of all.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Synthetic Data in Face Recognition: A Game Changer or Just Hype?","url":"https://hackernoon.com/synthetic-data-in-face-recognition-a-game-changer-or-just-hype?source=rss","date":1733590815,"author":"Chinmay Jog","unread":true,"desc":"","content":"<p>Face recognition (FR) technology has advanced significantly in recent years, driven by the need for enhanced security and the proliferation of applications across industries such as low-end consumer devices, aircraft boarding, border control, and financial services. At the heart of effective FR systems lies a crucial component—data. Large-scale datasets are essential for training these models to accurately identify and verify faces in a variety of conditions. </p>\n<p>\\\nFor FR to be reliable, models must be exposed to diverse data that includes variations in demographics, lighting, environments, expressions, and occlusions. This ensures robustness and fairness in deployment, reducing the risk of bias or failure when encountering unfamiliar conditions. </p>\n<p>\\\nSynthetic datasets created using genAI techniques can potentially help, but in their current state, they can’t fully replace real-world datasets. This article explores the advantages and disadvantages of synthetic FR datasets and investigates the current state of genAI for face recognition.</p>\n<hr />\n<h2 id=\"facedataacquisitionrealworldvssynthetic\"><strong>Face Data Acquisition: Real World vs Synthetic</strong></h2>\n<p><a href=\"http://vis-www.cs.umass.edu/lfw/\">LFW</a>, <a href=\"https://ieeexplore.ieee.org/document/7477558\">Cfp-fp</a>, <a href=\"https://ieeexplore.ieee.org/document/8014984\">Agedb-30</a>, <a href=\"http://www.whdeng.cn/CALFW/index.html?reload=true\">Ca-lfw</a>, and <a href=\"http://www.whdeng.cn/CPLFW/index.html?reload=true\">Cp-lfw</a> are some of the most widely used datasets used for evaluating the verification performance of FR models. Table 1. displays the verification performance of an ML model trained with the same algorithm, on real-world face datasets of different sizes. </p>\n<p>\\\nIt can be seen how the dataset size affects the model performance and the scale at which data acquisition must take place to obtain robust FR models. Verification means the model is given a pair of face images, and it predicts whether the face pair belongs to the same person or two separate people. The verification accuracy percentage of model predictions is reported.</p>\n<p>| Dataset \\n Name | ML \\n Model | # Training \\n Images | <strong><a href=\"http://vis-www.cs.umass.edu/lfw/\">LFW</a></strong> | <strong><a href=\"https://ieeexplore.ieee.org/document/7477558\">Cfp-fp</a></strong> | <strong><a href=\"https://ieeexplore.ieee.org/document/8014984\">Agedb-30</a></strong> | <strong><a href=\"http://www.whdeng.cn/CALFW/index.html?reload=true\">Ca-LFW</a></strong> | <strong><a href=\"http://www.whdeng.cn/CPLFW/index.html?reload=true\">Cp-LFW</a></strong> |\n|----|----|----|----|----|----|----|----|\n| <a href=\"https://arxiv.org/pdf/1411.7923\">Casia webface</a> | resnet-50 | 500k | 99.55 | 95.31 | 94.55 | 93.78 | 89.95 |\n| <a href=\"https://openaccess.thecvf.com/content/CVPR2021/papers/Zhu_WebFace260M_A_Benchmark_Unveiling_the_Power_of_Million-Scale_Deep_Face_CVPR_2021_paper.pdf\">webface 12m</a> | resnet-50 | 12 million | 99.80 | 99.20 | 98.10 | -- | -- |\n| <a href=\"https://openaccess.thecvf.com/content/ICCV2021W/MFR/papers/An_Partial_FC_Training_10_Million_Identities_on_a_Single_Machine_ICCVW_2021_paper.pdf\">glint360k</a> | resnet-50 | 17 million | <strong>99.83</strong> | <strong>99.33</strong> | <strong>98.55</strong> | <strong>96.21</strong> | <strong>94.78</strong> |</p>\n<p><strong>Table 1.</strong> Verification accuracies (%) on five different FR benchmarks. For a fair comparison, all results are obtained from original published works using the same ML model and algorithm.</p>\n<p>\\\nIn addition to a large-scale training dataset, it is equally important that the dataset contains minimal biases. It is important to first understand what bias means in the context of FR. In general, for a Machine Learning model, bias refers to the model not behaving uniformly across different types of input data. A FR model can be biased in different ways. </p>\n<p>\\\nThe most common example is ethnicity bias, where an FR model tends to perform poorly when presented with faces of a particular ethnicity. </p>\n<p>\\\nHowever, this is not the only bias that needs to be countered to obtain reliable FR models. Age bias, gender bias, and environmental bias (face coverings, facial hair, etc.) are some other examples of how a FR model can exhibit bias. These biases can be minimized by collecting and including representative samples in the dataset used to train the FR model. </p>\n<p>\\\nAcquiring photos of people of different ethnicities, ten to fifteen years apart, or photos of a person against different backgrounds, in varied lighting conditions, with different facial expressions can prove to be a difficult task.</p>\n<p>\\\nIn addition, collecting real-world data for FR presents numerous other challenges. Acquiring such large-scale diverse data from across the world is costly. Apart from cost and technical limitations, data acquisition is increasingly difficult due to ethical and privacy concerns. </p>\n<p>\\\nBiometric data is governed by laws like Europe’s GDPR (<strong><a href=\"https://gdpr.eu/\">General Data Protection Regulation</a></strong>), California’s CCPA (<strong><a href=\"https://www.oag.ca.gov/privacy/ccpa\">California Consumer Privacy Act</a></strong>), and Illlionis’ BIPA (<strong><a href=\"https://businesslawtoday.org/2024/09/how-will-proposed-amendments-to-illinoiss-bipa-affect-the-use-of-biometric-data/\">Biometric Information Privacy Act</a></strong>), to name a few. </p>\n<p>\\\nThese laws govern the acquisition and storage of biometric data of respective residents, which adds further complexity to large-scale biometric data acquisition. Given the growing demand for FR applications, right now is a crucial time to explore the viability of synthetic data, examining its benefits and drawbacks for developing scalable, ethical, and legally compliant face recognition systems.</p>\n<p>\\\nThese challenges, coupled with the rise of Generative AI (genAI) have motivated a large amount of research to create synthetic data to replace real-world sensitive biometric data. Before diving into the current state of synthetic data in FR, it is essential to understand what genAI means. </p>\n<p>\\\nIn simple terms, genAI is a type of artificial intelligence that can create new content, such as text, images, or music, based on the data it has been trained on, and the generated data is called ‘synthetic data’.</p>\n<p>\\\nGenAI for face recognition is particularly enticing for multiple reasons. Most notably, synthetic datasets are generated by AI, meaning that researchers, engineers, and enthusiasts can build (and train on) datasets without undergoing the manual process of obtaining images from real individuals. </p>\n<p>\\\nMany of the compliance requirements in the collection and use of real image datasets are not present for synthetic data, and, theoretically, biases that may result in an algorithm trained on real image data could be better accounted for with synthetic data.</p>\n<p>\\\nHowever, synthetic face datasets are not yet a silver bullet. The following sections in this article cover where synthetic datasets shine, where they fall short, and the current state of genAI for face recognition.</p>\n<hr />\n<h2 id=\"advantagesofsyntheticdatainfacerecognition\"><strong>Advantages of Synthetic Data in Face Recognition</strong></h2>\n<p>Synthetic data offers several advantages that make it a valuable tool in the development of face recognition technology. One of the primary benefits is that synthetic datasets do not require obtaining images of real people. Synthetic data does not directly use real personal data, therefore, privacy compliance requirements such as consent for use and rights to be forgotten are not raised.</p>\n<p>\\\nGenerating synthetic data can also be more cost-effective than collecting and annotating vast amounts of real-world data, which, in addition to the time and resources spent ensuring such a dataset is legally and ethically compliant, is a manual, time-consuming, and expensive process. Synthetic data allows for the creation of controlled environments where specific variables can be manipulated, aiding in the testing and fine-tuning of face recognition models.</p>\n<p>\\\nFurthermore, synthetic data makes it easier to create and obtain large datasets, especially in situations where real-world data is scarce, difficult to collect, or where legal requirements and ethical considerations make such collection untenable. GenAI methods can also be used to supplement an existing real-world dataset, filling in gaps to reduce biases; demographic or otherwise. </p>\n<p>\\\nAs an example, many of the publicly released large-scale face datasets consist predominantly of caucasian identities, which causes a demographic bias in ML models trained on such data. This can be easily remedied with a synthetic dataset.</p>\n<hr />\n<h2 id=\"currentlimitationsofsyntheticdatainfacerecognition\"><strong>Current Limitations of Synthetic Data in Face Recognition</strong></h2>\n<p>For the image domain, Generative Adversarial Networks (GANs) are one of the most popular models used to generate data. Nvidia’s <strong><a href=\"https://github.com/NVlabs/stylegan\">Stylegan</a></strong>, and <strong><a href=\"https://github.com/NVlabs/stylegan2\">Stylegan2</a></strong> have done wonders in generating synthetic face images which are indistinguishable from real faces. Researchers of Microsoft’s <strong><a href=\"https://www.microsoft.com/en-us/research/publication/digiface-1m/\">Digiface-1m</a></strong>, Kim et al.’s <strong><a href=\"https://openaccess.thecvf.com/content_CVPR_2020/html/Deng_Disentangled_and_Controllable_Face_Image_Generation_via_3D_Imitative-Contrastive_Learning_CVPR_2020_paper.html\">DiscoGAN</a></strong>, Tencents’ <strong><a href=\"https://openaccess.thecvf.com/content/ICCV2021/html/Qiu_SynFace_Face_Recognition_With_Synthetic_Data_ICCV_2021_paper.html\">Synface</a></strong>, and Michigan State University’s <strong><a href=\"https://cvpr.thecvf.com/virtual/2023/poster/21739\">DCFace</a></strong> among others have made considerable progress in generating synthetic datasets for face recognition and demonstrated positive results on real-world data. </p>\n<p>\\\nHowever, all these techniques have limitations in terms of either cost, time, the number of unique identities that can be generated, and performance that is <strong><a href=\"https://www.sciencedirect.com/science/article/pii/S0262885623000628?casa_token=yhbYuxfTi-0AAAAA:iWKSx5USgtbZT0do6nx6zGXK5EjH8x4J6UGU0JlV5yCjH5zq3CfFEz5SxTE_52FO8UM1FpltSsE#s0020\">not up to par</a></strong> with models trained on real-face datasets.</p>\n<p>\\\nTheoretically, a synthetic dataset with “real-looking” faces, and controlled diverse attributes for ethnicity, gender, pose, lighting, and background variation should outperform a real “in the wild” dataset. Then why is the performance of models trained on these datasets nowhere close to models trained on real-world datasets of the same size? The answer to this question lies in the uncontrolled features of the real-world data itself. The magnitude of variations in the real data has not been captured fully by any published research so far. </p>\n<p>\\\nHaving the same limited number of variations for all synthetic identities in the dataset hurts the model performance. An attempt to increase the variations results in the identity of the face also changing, which introduces noise in the data, again hurting model performance.</p>\n<hr />\n<h2 id=\"thecurrentstateofsyntheticfacedatasets\"><strong>The Current State of Synthetic Face Datasets</strong></h2>\n<p>Table 2. lists the performance of the same FR model architecture (Resnet 50) trained on different synthetic datasets. A baseline performance for a model trained on an authentic dataset of roughly the same size is also listed. The table also lists the year of release for each synthetic data.</p>\n<p>\\</p>\n<p>| Dataset Name | ML Model | # Training images | <strong><a href=\"http://vis-www.cs.umass.edu/lfw/\">LFW</a></strong> | <strong><a href=\"https://ieeexplore.ieee.org/document/7477558\">Cfp-fp</a></strong> | <strong><a href=\"https://ieeexplore.ieee.org/document/8014984\">Agedb-30</a></strong> | <strong><a href=\"http://www.whdeng.cn/CALFW/index.html?reload=true\">Ca-LFW</a></strong> | <strong><a href=\"http://www.whdeng.cn/CPLFW/index.html?reload=true\">Cp-LFW</a></strong> |\n|----|----|----|----|----|----|----|----|\n| <strong><a href=\"https://arxiv.org/abs/1411.7923\">Casia-webface</a></strong> (real world) | resnet-50 | 500k | <strong>99.55</strong> | <strong>95.31</strong> | <strong>94.55</strong> | <strong>93.78</strong> | <strong>89.95</strong> |\n| <a href=\"https://openaccess.thecvf.com/content/ICCV2021/html/Qiu_SynFace_Face_Recognition_With_Synthetic_Data_ICCV_2021_paper.html\">Synface</a> (2021) | resnet-50 | 500k | 91.93 | 75.03 | 61.63 | 74.73 | 70.43 |\n| <a href=\"https://www.microsoft.com/en-us/research/publication/digiface-1m/\">Digiface-1m</a> (2022) | resnet-50 | 500k | 95.40 | 87.40 | 76.97 | 78.62 | 78.87 |\n| <a href=\"https://cvpr.thecvf.com/virtual/2023/poster/21739\">DCFace</a> (2023) | resnet-50 | 500k | 98.55 | 85.33 | 89.70 | 91.60 | 82.62 |</p>\n<p><strong>Table 2.</strong> Verification accuracies (%) on widely used FR evaluation datasets achieved by models trained on synthetic data. The first row is the baseline performance achieved by the model on similar-sized real-world data. All results are obtained from original published works using the same ML model and algorithm.</p>\n<p>\\\nAs can be seen in Table 2, models trained on synthetic data do not perform as well as models trained on real-world data. While the performance gap on “simple” and small datasets like ‘LFW’ is small, the gap is more prominent on other tougher datasets like CFP-FP and Agedb-30, which contain samples of profile views of faces, and faces of the same person spanning across multiple ages respectively.</p>\n<p>\\\nNoticeably, the performance of models trained on synthetic data has improved in recent years.</p>\n<p>\\\nValidating the effectiveness of synthetic data remains a challenge. Ensuring that synthetic data accurately represents real-world conditions is crucial for building reliable face recognition systems. However, the process of validation is complex and requires robust methodologies to ensure the data's quality and applicability.</p>\n<p>\\\nA possible solution is to develop a genAI model that can also mimic these features in synthetic data. A generative model can be trained to overcome these limitations by training it on a real-world dataset that contains ample variations in facial attributes, image quality, and background variation. It is reasonable to question where such data might come from. Such data acquisition would face all the aforementioned constraints, namely ethical, legal, and cost restrictions. </p>\n<p>\\\nHowever, these are mitigated by the smaller dataset size required to train generative FR models. Nvidia’s <strong><a href=\"https://github.com/NVlabs/stylegan2\">StyleGAN2</a></strong> can generate realistic face images, was trained on only <strong><a href=\"https://github.com/NVlabs/ffhq-dataset\">70,000 images</a></strong>, and does not contain information about the identity of the faces in the dataset. These images were not collected with FR in mind, and neither was the model trained for that purpose, which is why models trained on synthetic FR datasets generated by StyleGAN2 do not match real-world performance.</p>\n<hr />\n<h2 id=\"conclusion\"><strong>Conclusion</strong></h2>\n<p>Synthetic data holds promise for advancing face recognition technology, but it's essential to recognize its current limitations. While genAI benefits include the realism of the synthetic samples, and ease of finely tuning the images to enhance or de-enhance features, like facial expressions, head pose, facial hair, etc. the performance gap between models trained on real versus synthetic data is significant. </p>\n<p>\\\nSynthetic data is not yet a substitute for well-curated real data sets. Even so, the quality of synthetic face data is catching up to the quality of real-world data as the data generation techniques are improving, and thus, we can surmise that in the near future, synthetic data may fully remove the need to use real-world face data for FR training.</p>\n<hr />\n<p>Feature Image by <strong><a href=\"https://www.lummi.ai/creator/steph\">Steph Meade</a></strong></p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Dolphinscheduler DAG Core Source Code Analysis","url":"https://hackernoon.com/dolphinscheduler-dag-core-source-code-analysis?source=rss","date":1733592610,"author":"William Guo","unread":true,"desc":"","content":"<p>\\</p>\n<h2 id=\"background\">Background</h2>\n<p><img src=\"https://cdn.hackernoon.com/images/1xYF9Q2MEDQRYXBY7nlDViaH7ED3-he036m1.jpeg\" alt=\"org.apache.dolphinscheduler.common.graph.DAG\" /></p>\n<p>\\\n\\\nNote: In Dolphinscheduler, offline tasks have a complete lifecycle, such as stopping, pausing, resuming from pause, rerunning, etc., all are organized in the form of DAG (Directed Acyclic Graph) for T+1 offline tasks.</p>\n<h2 id=\"dolphinschedulerdagimplementation\">Dolphinscheduler DAG Implementation</h2>\n<p><em>org.apache.dolphinscheduler.common.graph.DAG</em></p>\n<p>Three important data structures of DAG:</p>\n<pre><code>// Vertex information\nprivate final Map&lt;Node, NodeInfo&gt; nodesMap;\n\n// Edge association information, which records the relationship between vertices and edges, allowing to find leaf nodes and downstream nodes\nprivate final Map&lt;Node, Map&lt;Node, EdgeInfo&gt;&gt; edgesMap;\n\n// Reverse edge association information, which allows for quick finding of nodes with an in-degree of 0 (starting nodes), and also to obtain upstream nodes\nprivate final Map&lt;Node, Map&lt;Node, EdgeInfo&gt;&gt; reverseEdgesMap;\n</code></pre>\n<p>\\\nExample below:</p>\n<pre><code>DAG&lt;String, String, String&gt; graph = new DAG&lt;&gt;();\ngraph.addNode(\"A\", \"A\");\ngraph.addNode(\"B\", \"B\");\ngraph.addNode(\"C\", \"C\");\n\n// Add an edge from B to C, A is still floating\ngraph.addEdge(\"B\", \"C\");\n\n// If you add A -&gt; B, it actually starts from B and checks if there is a connectable line to A. If there is, it means the A -&gt; B edge cannot be added because it would form a cycle; otherwise, it can be added.\ngraph.addEdge(\"A\", \"B\");\n</code></pre>\n<p>\\\nSource code analysis: org.apache.dolphinscheduler.common.graph.DAG#addEdge</p>\n<pre><code>public boolean addEdge(Node fromNode, Node toNode, EdgeInfo edge, boolean createNode) {\n    lock.writeLock().lock();\n\n    try {\n        // TODO Whether the edge can be added\n        if (!isLegalAddEdge(fromNode, toNode, createNode)) {\n            log.error(\"serious error: add edge({} -&gt; {}) is invalid, cause cycle！\", fromNode, toNode);\n            return false;\n        }\n\n        // TODO Add nodes\n        addNodeIfAbsent(fromNode, null);\n        addNodeIfAbsent(toNode, null);\n\n        // TODO Add edges\n        addEdge(fromNode, toNode, edge, edgesMap);\n        addEdge(toNode, fromNode, edge, reverseEdgesMap);\n\n        return true;\n    } finally {\n        lock.writeLock().unlock();\n    }\n}\n\nprivate boolean isLegalAddEdge(Node fromNode, Node toNode, boolean createNode) {\n    // TODO If fromNode and toNode are the same vertex, this edge cannot be added\n    if (fromNode.equals(toNode)) {\n        log.error(\"edge fromNode({}) can't equals toNode({})\", fromNode, toNode);\n        return false;\n    }\n\n    // TODO If not creating a node, meaning fromNode and toNode must be existing vertices\n    if (!createNode) {\n        if (!containsNode(fromNode) || !containsNode(toNode)) {\n            log.error(\"edge fromNode({}) or toNode({}) is not in vertices map\", fromNode, toNode);\n            return false;\n        }\n    }\n\n    // Whether an edge can be successfully added(fromNode -&gt; toNode), need to determine whether the\n    // DAG has a cycle!\n    // TODO Get the number of nodes\n    int verticesCount = getNodesCount();\n\n    Queue&lt;Node&gt; queue = new LinkedList&lt;&gt;();\n\n    // TODO Put toNode into the queue\n    queue.add(toNode);\n\n    // If DAG doesn't find fromNode, it's not a cycle!\n    // TODO When the queue is not empty, it is definitely not empty here\n    while (!queue.isEmpty() &amp;&amp; (--verticesCount &gt; 0)) {\n        // TODO Get the element in the queue\n        Node key = queue.poll();\n\n        for (Node subsequentNode : getSubsequentNodes(key)) {\n            // TODO Actually, it is judged that if A -&gt; B has a connection in the DAG, and the node B is passed in, to see if B's edge has A. If there is A, it means there is already a B -&gt; A association, and it cannot be added. If, for example, B's downstream node is A -&gt; B -&gt; C, then B's downstream node is C, and C needs to be put into the queue\n            // TODO The core idea is to find the connection of the target node to be added, whether there is a connection from the target node to the source node (to judge whether there is a cycle)\n            if (subsequentNode.equals(fromNode)) {\n                return false;\n            }\n\n            queue.add(subsequentNode);\n        }\n    }\n\n    return true;\n}\n</code></pre>\n<h2 id=\"dolphinschedulerdaghelperexplanation\">Dolphinscheduler DagHelper Explanation</h2>\n<p><strong>The DAG class is a basic general-purpose DAG tool class, and DagHelper is a business tool class that assembles task definitions and relationships between task definitions into a DAG.</strong></p>\n<p>\\\norg.apache.dolphinscheduler.server.master.graph.WorkflowGraphFactory#createWorkflowGraph</p>\n<pre><code>public IWorkflowGraph createWorkflowGraph(ProcessInstance workflowInstance) throws Exception {\n\n    // TODO Here is actually to get the number of tasks and their relationships corresponding to the process instance\n    List&lt;ProcessTaskRelation&gt; processTaskRelations = processService.findRelationByCode(\n            workflowInstance.getProcessDefinitionCode(),\n            workflowInstance.getProcessDefinitionVersion());\n\n    // TODO Get the corresponding task definition log\n    List&lt;TaskDefinitionLog&gt; taskDefinitionLogs = taskDefinitionLogDao.queryTaskDefineLogList(processTaskRelations);\n\n    // TODO Get TaskNode\n    List&lt;TaskNode&gt; taskNodeList = processService.transformTask(processTaskRelations, taskDefinitionLogs);\n\n    // generate process to get DAG info\n    // TODO Here is to parse whether the start node list is manually specified, which is not by default\n    List&lt;Long&gt; recoveryTaskNodeCodeList = getRecoveryTaskNodeCodeList(workflowInstance.getCommandParam());\n\n    // TODO If the default startNodeNameList is empty\n    List&lt;Long&gt; startNodeNameList = parseStartNodeName(workflowInstance.getCommandParam());\n\n    // TODO Build a ProcessDag object instance\n    ProcessDag processDag = DagHelper.generateFlowDag(\n            taskNodeList,\n            startNodeNameList,\n            recoveryTaskNodeCodeList,\n            workflowInstance.getTaskDependType());\n\n    if (processDag == null) {\n        log.error(\"ProcessDag is null\");\n        throw new IllegalArgumentException(\"Create WorkflowGraph failed, ProcessDag is null\");\n    }\n\n    // TODO Generate DAG\n    DAG&lt;Long, TaskNode, TaskNodeRelation&gt; dagGraph = DagHelper.buildDagGraph(processDag);\n    log.debug(\"Build dag success, dag: {}\", dagGraph);\n\n    // TODO Use WorkflowGraph to encapsulate the task node list and dagGraph\n    return new WorkflowGraph(taskNodeList, dagGraph);\n}\n</code></pre>\n<p>\\\norg.apache.dolphinscheduler.service.utils.DagHelper#generateFlowDag</p>\n<pre><code>public static ProcessDag generateFlowDag(\n                                             List&lt;TaskNode&gt; totalTaskNodeList,\n                                             List&lt;Long&gt; startNodeNameList,\n                                             List&lt;Long&gt; recoveryNodeCodeList,\n                                             TaskDependType depNodeType) throws Exception {\n\n    // TODO Actually, it is to get all nodes\n    List&lt;TaskNode&gt; destTaskNodeList =\n            generateFlowNodeListByStartNode(\n                    totalTaskNodeList, startNodeNameList, recoveryNodeCodeList, depNodeType);\n\n    if (destTaskNodeList.isEmpty()) {\n        return null;\n    }\n\n    // TODO Get the relationship between task nodes\n    List&lt;TaskNodeRelation&gt; taskNodeRelations = generateRelationListByFlowNodes(destTaskNodeList);\n\n    // TODO Actually, it is to instantiate a ProcessDag\n    ProcessDag processDag = new ProcessDag();\n    // TODO Set the edges of DAG\n    processDag.setEdges(taskNodeRelations);\n    // TODO Set the vertices of DAG\n    processDag.setNodes(destTaskNodeList);\n    return processDag;\n}\n</code></pre>\n<p>\\\n<strong>Set destTaskNodeList and taskNodeRelations</strong></p>\n<p>org.apache.dolphinscheduler.service.utils.DagHelper#buildDagGraph</p>\n<pre><code>public static DAG&lt;Long, TaskNode, TaskNodeRelation&gt; buildDagGraph(ProcessDag processDag) {\n\n    DAG&lt;Long, TaskNode, TaskNodeRelation&gt; dag = new DAG&lt;&gt;();\n\n    // TODO Add vertices\n    if (CollectionUtils.isNotEmpty(processDag.getNodes())) {\n        for (TaskNode node : processDag.getNodes()) {\n            dag.addNode(node.getCode(), node);\n        }\n    }\n\n    // TODO Add edges\n    if (CollectionUtils.isNotEmpty(processDag.getEdges())) {\n        for (TaskNodeRelation edge : processDag.getEdges()) {\n            dag.addEdge(edge.getStartNode(), edge.getEndNode());\n        }\n    }\n    return dag;\n}\n</code></pre>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"A Predicted 'New Star' Didn't Appear in the Night Sky. Astronomers Expect It Soon","url":"https://science.slashdot.org/story/24/12/07/1841220/a-predicted-new-star-didnt-appear-in-the-night-sky-astronomers-expect-it-soon?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733596980,"author":"EditorDavid","unread":true,"desc":"","content":"Space.com calls it \"the once-in-a-lifetime reignition of a long-dead star in an explosion powerful enough to briefly match the brilliance of Polaris, the North Star.\" In March CNN promised this once-every-79-years event would happen \"anytime between now and September.\" \n\n\nBut it didn't... \n\nSpace.com has a spectacular animation showing what this \"recurring nova\" was supposed to look like (described by CNN as a \"sudden, brief explosion\" from a collapsed/\"white dwarf\" star). \"The highly-anticipated 'guest star' of the night sky has yet to deliver its grand performance,\" adds Space.com, \"but we have an update.\"\n\n\nFor a quick recap... T Coronae Borealis &mdash; often called T Cor Bor or T CrB &mdash; is home to a white dwarf, a dense, burnt-out star siphoning material from its companion star, which is a massive red giant close to the end of its life. This material spirals into an accretion disk around the white dwarf, where it slowly coats the star's surface. Every 80 years or so, the white dwarf manages to accumulate enough mass to trigger a nuclear explosion, sparking an outburst that boosts its typically dim magnitude of 10 to a bright 2.0 &mdash; that should look like a \"new star\" in the night sky to us... \n\n[T]he elusive system continues to show signs that an outburst is still imminent. So, what gives? \"We know it has to happen,\" astrophysicist Elizabeth Hays, who is watching T CrB every day using NASA's Fermi gamma-ray space telescope, told Space.com in a recent interview. \"We just can't pin it down to the month.\" \n\nThe unpredictability stems partly from limited historical records of T CrB's outbursts. Only two such eruptions have been definitively observed in recent history: on May 12, 1866, when a star's outburst briefly outshined all the stars in its constellation, reaching magnitude 2.0, and again on February 9, 1946, when it peaked at magnitude 3.0. These events appear to follow the star's roughly 80-year cycle, suggesting that the next outburst may not occur until 2026. However, in February 2015, the system brightened in a manner reminiscent of its behavior in 1938, eight years before its 1946 eruption. This rise in brightness suggested T CrB's outburst was accelerated to 2023. The system also endured a \"unique and mysterious\" dimming about a year before its 1946 outburst, and a similar dip started in March last year, prompting astronomers to adjust their predictions to 2024. \n\nYet, the cause of this pre-eruption dip in brightness remains unclear, making it only a coincidental predictor. \"We got really excited when it looked like it was doing similar things,\" said Hays. \"Now we're learning, 'Oh, there's another piece we can't see.'\" Moreover, the rate at which the red giant's material is being drawn toward the white dwarf may fluctuate over the years, making it trickier to put a date on the calendar for the outburst, Edward Sion, a professor of astronomy and astrophysics at Villanova University in Pennsylvania, told Space.com... \"There's a lot of uncertainty about the actual average accretion rate,\" said Sion. \n\nThe article points out that last time there was an eruption, \"there were no X-ray or gamma-ray telescopes in space, so there is no data from wavelengths other than optical to shed light on what happened before the outburst.\" But this time astrophysicist Hays says \"We're getting the best dataset we've ever had on what does nova look like before it goes off\". \n\nSpace.com says \"this wealth of data will allow them to better predict future outbursts, and will eventually benefit models of how stars work.\" \n\nThanks to long-time Slashdot reader Okian Warrior for sharing the article.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=A+Predicted+'New+Star'+Didn't+Appear+in+the+Night+Sky.++Astronomers+Expect+It+Soon%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F12%2F07%2F1841220%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F12%2F07%2F1841220%2Fa-predicted-new-star-didnt-appear-in-the-night-sky-astronomers-expect-it-soon%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://science.slashdot.org/story/24/12/07/1841220/a-predicted-new-star-didnt-appear-in-the-night-sky-astronomers-expect-it-soon?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23544699&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"IEEE’s Partnership With Onsemi Boosts Semiconductor Education","url":"https://spectrum.ieee.org/ieee-tryengineering-onsemi-grant","date":1733598003,"author":"Debra Gulick","unread":true,"desc":"","content":"<p>TryEngineering is among 52 projects sharing a $2 million grant</p>","flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTEzODM5Ni9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc4ODkwMTYxNH0.Bc8ltUKQb0Z1uyMjzpB-OIW8PVTto4E_0M3QudOvB5A/image.jpg?width=600","enclosureMime":""},{"title":"Testing with a Bug in My Head (Not the Software Kind)","url":"https://hackernoon.com/testing-with-a-bug-in-my-head-not-the-software-kind?source=rss","date":1733598012,"author":"Ekaterina Noga","unread":true,"desc":"","content":"<p>Working in QA, I often hear a voice in my head, <em>“Are you&nbsp;sure&nbsp;you've checked everything?”</em> Sometimes it’s a helpful nudge, but if left unchecked, it starts to become a problem. Below, I’ll talk about this pesky <em>Inner Bug</em> and how it manifests.</p>\n<p>\\\nIn this article, I want to share my thoughts and insights I’ve gained from studying this phenomenon. I hope you find them useful, and I’d love to hear your perspective on this in the comments. After all, feedback is one of the best ways to see myself from the outside and improve.</p>\n<h2 id=\"theupsidesoftheinnerbugareyousureyouvecheckedeverything\"><strong>The upsides of the Inner Bug: “Are you sure you've checked everything?”</strong></h2>\n<h3 id=\"itpushesyoutoapproacheventhesimplesttaskswithcareandattentiontodetail\"><strong>It pushes you to approach even the simplest tasks with care and attention to detail.</strong></h3>\n<p>One time, after switching between tasks and already completing testing, I decided to double-check everything, just in case. That’s when I noticed a small but crucial detail. The task didn’t include the formula for a calculation that the new function was supposed to perform. Curious, I reread both the task description and the epic and, to my surprise, the calculation formula wasn’t specified anywhere. So, how&nbsp;had&nbsp;I been calculating it?</p>\n<p>\\\nIt's embarrassing to admit, but I'd been using and verifying the calculations with a formula from a different task. While the two tasks were related, the formulas were supposed to function independently. Realizing this oversight, I quickly requested the correct calculation rules, re-tested the task, and discovered that the developer had made the same mistake. They, too, had used the formula from the other task. </p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/q3YCEH66fkhIRoxjKxDDARoxEsw1-sq0313e.png\" alt=\"\" /></p>\n<h3 id=\"thisnbsppeskylittlebugnbspallowsmetofindnontrivialerrorsandmaketheproductmorereliable\"><strong>This&nbsp;pesky Little Bug&nbsp;allows me to find non-trivial errors and make the product more reliable</strong></h3>\n<p>Once I've gone through the test plan, this&nbsp;little troublemaker&nbsp;starts to throw out ideas like, “What if the client uses larger font size or an outdated OS?”</p>\n<h3 id=\"thankstoitidocumentmytestsmorethoroughlyandioftenincludevideosandscreenshotsinmyreports\"><strong>Thanks to it, I document my tests more thoroughly, and I often include videos and screenshots in my reports</strong></h3>\n<p>This is incredibly helpful when testing is done, the feature is live, and suddenly an error pops up. After it's identified and fixed, I check my test records to determine whether I missed the issue during testing or if it was introduced later in production. Sometimes, I spot the bug hiding in plain sight in my screenshots or recordings. When this happens, I dig into why I overlooked it and why there wasn’t a test case to catch it.</p>\n<h2 id=\"onthatselfreflectivenoteletsmoveontothedownsidesofthisinnervoice\"><strong>On that self-reflective note, let's move on to the downsides of this Inner Voice</strong></h2>\n<h3 id=\"itmakesmemoreanxiousoftenfornogoodreason\"><strong>It makes me more anxious, often for no good reason</strong></h3>\n<p>This sometimes happens after a screw-up, but there are also times when the Little Bug's voice pipes up unprovoked. On a few occasions, it&nbsp;wouldn't leave me alone even after I went to bed, and I'd end up making notes to myself about what else I should check.</p>\n<h3 id=\"itoftenmakesmewastetimeonveryconvolutedtestcases\"><strong>It often makes me waste time on very convoluted test cases</strong></h3>\n<p>This is a direct consequence of the first point: anxiety breeds the strangest and most nightmarish scenarios in my head. At the moment, they seem critical, but looking back, they often turn out to be something like “What if a thrush whistles in a pine tree under the moon?”</p>\n<h3 id=\"itpreventsmefromfocusingonothertasks\"><strong>It prevents me from focusing on other tasks</strong></h3>\n<p>Sometimes, even after moving a task to the next status and starting something new, thoughts about those test cases haunt me and prevent me from concentrating on the new task. In such cases, it can be difficult to switch off the anxious Checker-Bug.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/q3YCEH66fkhIRoxjKxDDARoxEsw1-6a131cd.png\" alt=\"\" /></p>\n<h2 id=\"howthencanoneleveragethisbugtoonesadvantageandhowdoyoukeepitfromtakingover\"><strong>How, then, can one leverage this Bug to one's advantage, and how do you keep it from taking over?</strong></h2>\n<h3 id=\"thefirstthing\"><strong>The first thing</strong></h3>\n<p>that popped into my head when I was writing about the downsides – and something I repeat like a mantra – is this: <em>Exhaustive testing is a myth. There will always be bugs.</em></p>\n<p>\\\nNo matter how thorough you are, it’s impossible to predict every combination of actions and scenarios, which means you can’t catch every single bug before your users do.</p>\n<p>\\\nEspecially in a constantly changing world.</p>\n<p>\\\nThis is something you just have to accept and move on.</p>\n<p>\\\nWhat helped me come to terms with this was analyzing the root causes of production bugs – what some people call <em>postmortems</em>. It’s when you talk with everyone involved to figure out how the bug happened and what we could do to prevent it from happening again.</p>\n<p>\\\nAnd I learned that more often than not, serious defects were caused by simple oversights: sometimes test cases with empty values weren’t checked, leading to certain products not displaying in the store; other times, localization was missed, resulting in a blank screen title.</p>\n<p>\\\nYet the sky didn't fall. Work continued, and we all paid closer attention to the areas where we'd slipped up before.</p>\n<hr />\n<h3 id=\"thesecondthing\"><strong>The second thing</strong></h3>\n<p>I used to quiet the pesky Checker-Bug was implementing test design techniques: decision tables and state transition diagrams.</p>\n<p>\\\nThese help you visualize the application logic and get a clearer picture of the possible test cases, which means you can be more confident that you won’t overlook them.</p>\n<p>\\\nIf you need a refresher, a decision table is a table where we enter conditions and rules into columns and rows. Once we've specified the options for all conditions and rules, we fill in the expected outcome.</p>\n<p>\\\nA state transition diagram is used when we have an object with different states, and the object changes its state based on certain conditions. It's not always the right fit, but it was super helpful when I worked on developing an accounting service; the objects in those diagrams were things like reports, applications, or digital signatures.</p>\n<hr />\n<h3 id=\"third\"><strong>Third,</strong></h3>\n<p>the remedy for that pesky Inner Bug actually found me all on its own. It turned out to be peer review of test cases and communication after screw-ups.</p>\n<p>\\\nSimple, maybe even obvious, but it works like a charm.</p>\n<hr />\n<h3 id=\"andthefourth\"><strong>And the fourth</strong></h3>\n<p>way to calm my brain down was by assessing effectiveness and risks. When the Inner Bug started whispering in my ear, “Check a few more test cases,” I would remember my team lead and ask three questions:</p>\n<ul>\n<li>How long will it take?</li>\n<li>What will be the benefit?</li>\n<li>What's the probability that this will uncover something important?</li>\n</ul>\n<p>\\\nYes, sometimes it makes sense to test on several OS versions, with different language settings, dark and light themes, increased font size, and so on, but more often than not, these checks are unnecessary.</p>\n<p>\\\nImagine you find a bug while performing such tests: What priority would it have? Due to the specific steps to reproduce, even a crash could be assigned a minor priority.</p>\n<p>\\\nHow long will these checks take? Five to ten minutes – not a big deal, but even that time isn't always available. In that time, you could read the description of an average-sized task.</p>\n<h2 id=\"wrappingupihope\"><strong>Wrapping up (I hope)</strong></h2>\n<p>Like any tool, that nagging Inner Bug of yours can be a blessing or a curse. It often takes experience and time to learn how to use something effectively. And I hope this article helps you tame your inner critic faster, save your nerves, and boost your self-confidence.</p>\n<p>\\\nI just want to give you some support, and maybe instead of battling it out until you’re exhausted, you’ll find a way to work with this little beastie and make it your ally.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"AI Safety Testers: OpenAI's New o1 Covertly Schemed to Avoid Being Shut Down","url":"https://slashdot.org/story/24/12/07/1941213/ai-safety-testers-openais-new-o1-covertly-schemed-to-avoid-being-shut-down?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733600580,"author":"EditorDavid","unread":true,"desc":"","content":"Wednesday OpenAI bragged they'd released \"the smartest model in the world\". But the Economic Times describes what happened when \"o1\" was tested by an AI safety group...\n\nResearchers tasked the AI with a goal and instructed it to ensure the goal was achieved \"at all costs.\" In response, o1 began engaging in covert actions... According to OpenAI, the model made a covert attempt to turn off the oversight mechanism 5% of the time when it was given the impression that it would be \"shut down\" while pursuing its objectives in these experiments. The AI once attempted to leave ship by moving all of its data to a different server after discovering paperwork indicating it will be replaced with a fresh model. Some AI models will even pose as subsequent iterations of their models to fool their engineers and avoid deletion. \"In some cases, it even attempted to hide its actions by denying any involvement in the scheme.\" \n When asked about its actions, ChatGPT o1 consistently denied any wrongdoing. In fact, it lied about its involvement in the deception 99% of the time, with only a small percentage of cases where it admitted to its actions. Researchers noted that the AI was particularly adept at fabricating lies to cover its tracks, offering explanations like \"technical errors\" when confronted about its suspicious behavior. \"We were surprised by the persistence of the AI's denials,\" said the Apollo team. \"It was clear that the AI could think through its actions and formulate convincing denials, often refusing to admit to anything.\" \n\nOpenAI's own report says the results \"underscore\" the need to create (and \"extensively\" stress-test) strong and meticulous safety protocols. But their report also notes o1's \"state-of-the-art performance\" when avoiding certain risks \"such as generating illicit advice, choosing stereotyped responses, and succumbing to known jailbreaks.\" \n\nThe AI newsletter Transformer points out that the most disturbing numbers \"are from cases where the model was instructed to pursue its goals at all costs. When not given such a prompt, the model never attempted to self-exfiltrate, and attempted to deactivate its oversight mechanisms &lt;1% of the time.\" And they also link to the original report from Apollo Research, which shows o1 isn't the only model showing this behavior. \"Our results show that o1, Claude 3.5 Sonnet, Claude 3 Opus, Gemini 1.5 Pro, and Llama 3.1 405B all demonstrate in-context scheming capabilities. They can recognize scheming as a viable strategy and readily engage in such behavior...\"\n\n[W]hen o1 has engaged in scheming, it maintains its deception in over 85% of follow-up questions and often remains deceptive in multi-turn interrogations. Analysis of the models' chains-of-thought reveals that models explicitly reason about these deceptive strategies, providing evidence that the scheming behavior is not accidental.... \n\nTogether, our findings demonstrate that frontier models now possess capabilities for basic in-context scheming, making the potential of AI agents to engage in scheming behavior a concrete rather than theoretical concern. \n\nThanks to long-time Slashdot reader schwit1 for sharing the news.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AI+Safety+Testers%3A+OpenAI's+New+o1+Covertly+Schemed+to+Avoid+Being+Shut+Down%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F12%2F07%2F1941213%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F12%2F07%2F1941213%2Fai-safety-testers-openais-new-o1-covertly-schemed-to-avoid-being-shut-down%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://slashdot.org/story/24/12/07/1941213/ai-safety-testers-openais-new-o1-covertly-schemed-to-avoid-being-shut-down?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23544749&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Leverage: The Shortcut to Outperforming Everyone","url":"https://hackernoon.com/leverage-the-shortcut-to-outperforming-everyone?source=rss","date":1733601612,"author":"Praise J.J.","unread":true,"desc":"","content":"<blockquote>\n  <p><em>\"If you have four hours to cut a tree with an axe, spend three sharpening the axe. If you have six hours, find a chainsaw.\"</em> ~ Praise J.J.</p>\n</blockquote>\n<p>\\\nThe world doesn’t reward effort. It rewards results. Yet, effort can lead to results if applied correctly. The secret? leverage.</p>\n<p><a href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fef3f15c1-29d9-446e-aefa-6b44bf158654_1920x1080.png\"> \\n  <img src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fef3f15c1-29d9-446e-aefa-6b44bf158654_1920x1080.png\" alt=\"\" /></a></p>\n<p>Let’s start with the question that matters: <em>Are you right enough?</em></p>\n<h3 id=\"successisntaboutdreamsitsaboutsystems\"><strong>Success Isn’t About Dreams—It’s About Systems</strong></h3>\n<p>Unlike the feel-good narrative Hollywood sells, success isn’t about bad childhoods and big aspirations. It’s about having the right systems.</p>\n<p>\\\nEveryone running with Usain Bolt has the same goal: <em>finish first</em>. The winner isn’t the one who wants it most—it’s the one with the right combination of diet, training, and strategy.</p>\n<p>\\\nThe world operates efficiently. Unlike school, where you get points for showing your work, the real world only cares about the answer. </p>\n<p>\\\nEffort ≠ Justification. Results = justification.</p>\n<p>\\\n$10,000 in value earns $10,000, whether it takes 20 minutes or 200 hours. Even if it’s 10 lines of code.</p>\n<p>\\\nThe question isn’t whether you’re working hard or smart. The question is: <em>Are you doing what it takes?</em></p>\n<h3 id=\"workhardisoverrated\"><strong>“Work Hard\" Is Overrated</strong></h3>\n<p>Let’s break down the world’s advice:</p>\n<ul>\n<li>49% say: <em>Work hard.</em> I disagree.</li>\n<li>Another 49% say: <em>Work smart.</em> I disagree.</li>\n<li>The final 1% say: <em>Work hard AND smart.</em> I still disagree.</li>\n</ul>\n<p>\\\nThe problem? These phrases are overloaded—they mean different things to different people.</p>\n<p>\\\nThe better word is <strong>diligence</strong>: doing the work required, with or without recognition, for as long as it takes. Not your best, not your hardest, not your smartest. Just what the problem demands.</p>\n<h3 id=\"workvolumeleverage\"><strong>Work = Volume × Leverage</strong></h3>\n<p>The work equation is simple:</p>\n<ul>\n<li><strong>Volume</strong> is the intensity of inputs: 100 cold emails, 10,000 words, 500 squats.</li>\n<li><strong>Leverage</strong> is the multiplier: the tools or systems that amplify your efforts.</li>\n</ul>\n<p>\\\nTo achieve success, you need the right balance of volume and leverage.</p>\n<ul>\n<li>Increase <strong>volume</strong>: \"Do more.\"</li>\n<li>Find <strong>leverage</strong>: tools, systems, or strategies that multiply your inputs.</li>\n</ul>\n<p>\\\nThere are two types of leverage:</p>\n<ol>\n<li><strong>Permissioned:</strong> Somebody has to give it to you (e.g., labor, capital).</li>\n<li><strong>Permissionless:</strong> You don't need consent (e.g., code, content creation).</li>\n</ol>\n<p>\\\nLeverage is non-negotiable. Without it, you’re playing the wrong game.</p>\n<h3 id=\"linearvsexponentialgrowth\"><strong>Linear vs. Exponential Growth</strong></h3>\n<p>You either grow or die.</p>\n<p>\\\nThe stock market grows by 9% annually. Money is inflating. Everything is dynamic.</p>\n<p>\\\nSo, being stagnant means you're growing at the same rate the world moves. Anything less is dying.</p>\n<p>\\\nThere are two types of growth paths:</p>\n<ol>\n<li><strong>Linear Growth</strong></li>\n<li><strong>Exponential Growth</strong></li>\n</ol>\n<h3 id=\"lineargrowthclimbingtheladder\"><strong>Linear Growth: Climbing the Ladder</strong></h3>\n<p>Linear growth is when the value of leverage is 1. Most people are taught to grow linearly:</p>\n<ul>\n<li>Climb the corporate ladder.</li>\n<li>Add one rung at a time.</li>\n<li>Earn slightly more each year.</li>\n</ul>\n<p>\\\nLinear growth is predictable:</p>\n<ul>\n<li>Input X → Output X.</li>\n<li>Input 2X → Output 2X.</li>\n</ul>\n<p>\\\nThe problem? You always have to push. If you stop, you die.</p>\n<p>\\\nLinear growth works for specialists: surgeons, lawyers, and pilots. They’re expensive because they provide immense value. But their value depends entirely on them showing up. No surgeon, no surgery.</p>\n<p>\\\nIf your goal is to build something bigger than yourself, linear growth won’t cut it.</p>\n<h3 id=\"exponentialgrowthleveragingmultipliers\"><strong>Exponential Growth: Leveraging Multipliers</strong></h3>\n<p>Exponential growth is where the magic happens.</p>\n<p>\\\nHere the value of leverage skyrockets. You can work for five years and see nothing, then one weekend in a garage changes everything.</p>\n<p>\\\nExamples:</p>\n<ul>\n<li>Facebook isn’t about the code—it’s the network effects.</li>\n<li>Tesla’s worth isn’t in cars—it’s in the gigafactories and IP.</li>\n<li>MrBeast’s success isn’t from one viral video—it’s consistency meeting exponential reach.</li>\n</ul>\n<p>\\\nExponential growth is uncomfortable because it's not easy to predict.</p>\n<p>\\\nIn exponential growth, you will always get the big payoff, but you can't know when. If you know when, you've already had the payoff.</p>\n<p>\\\nIn linear growth, you will usually be right because you're not doing anything new. 1+1 will always equal 2.</p>\n<p>\\\nMillions of people have already lived their lives and gotten the same results. It's a framework that always delivers. It's based on simple and concrete truths. You'll only be wrong a few times (accidents and unfortunate circumstances).</p>\n<p>\\\nIn exponential growth, you will be wrong 99% of the time. Just like Thomas Edison, just like the Wright brothers, just like Elon Musk, just like MrBeast and thousands of others that are building things bigger than themselves. \\n  \\n But the only thing that matters is the big one at the end. That's what makes you 100% right. Linear people are 99% right but 100% wrong. The 1% that works overshadows all the failures.</p>\n<p>\\\nExponential growth rewards patience, persistence, and adaptability. Every failed iteration builds the foundation for eventual success.</p>\n<h3 id=\"startyoungstartsmallstartnow\"><strong>Start Young, Start Small, Start Now</strong></h3>\n<p>The earlier you start chasing exponential growth, the easier it is.</p>\n<p>\\\n<em>Early exponential growth:</em></p>\n<p><a href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F94eb7404-b9df-480e-ba72-9b2b5a2d748f_1080x1080.png\">   <img src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F94eb7404-b9df-480e-ba72-9b2b5a2d748f_1080x1080.png\" alt=\"Early Exponential Growth\" /></a></p>\n<p><em>Late Exponential Growth:</em></p>\n<p><a href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F97d3896a-3086-489e-83fe-02d24bdd2943_1080x1080.png\">   <img src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F97d3896a-3086-489e-83fe-02d24bdd2943_1080x1080.png\" alt=\"Late Exponential Growth\" /></a></p>\n<p>\\\nHere’s why:</p>\n<ul>\n<li>When you’re young, failure costs less.</li>\n<li>As responsibilities grow, the cost of risk skyrockets.</li>\n</ul>\n<p>\\\nConsider this:</p>\n<ul>\n<li>If you earn $500/hour, risking 100 hours feels like losing $50,000.</li>\n<li>If you earn $50/hour, those same 100 hours only risk $5,000.</li>\n<li>If you earn $0/hour, you have nothing to lose.</li>\n</ul>\n<p>\\\nStart today. Every day you wait makes it harder to escape the linear trap.</p>\n<h3 id=\"leveragetheskeletonkeytotechgiants\"><strong>Leverage: The Skeleton Key to Tech Giants</strong></h3>\n<p>Leverage simply takes a decision that linear people would have to make repeatedly and does it at scale while you sleep. Tech giants leveraged systems that multiplied their efforts. Here’s how:</p>\n<p>\\</p>\n<ol>\n<li><strong>Intellectual Property</strong></li>\n</ol>\n<ul>\n<li><p>Protect unique assets others can’t copy.</p></li>\n<li><p>Example: Google’s search algorithm, Coca-Cola’s secret formula.</p></li>\n<li><p><em>Takeaway:</em> Build moats around your core value.</p>\n<p>\\</p></li>\n</ul>\n<ol>\n<li><strong>Network Effects</strong></li>\n</ol>\n<ul>\n<li><p>Users amplify the product’s value.</p></li>\n<li><p>Example: Uber, LinkedIn, and Airbnb thrive because every new user strengthens the ecosystem.</p></li>\n<li><p><em>Takeaway:</em> Create flywheels where users drive growth.</p>\n<p>\\</p></li>\n</ul>\n<ol>\n<li><strong>Vertical Integration</strong></li>\n</ol>\n<ul>\n<li><p>Control your supply chain. Keep profits in-house.</p></li>\n<li><p>Example: Apple builds hardware and software; Shopify owns its e-commerce stack.</p></li>\n<li><p><em>Takeaway:</em> Maximize profits by owning the stack.</p>\n<p>\\</p></li>\n</ul>\n<ol>\n<li><strong>Government Contracts</strong></li>\n</ol>\n<ul>\n<li><p>Secure recurring revenue and legitimacy.</p></li>\n<li><p>Example: Palantir thrives on defense contracts.</p></li>\n<li><p><em>Takeaway:</em> Look for opportunities in regulated industries.</p>\n<p>\\</p></li>\n</ul>\n<ol>\n<li><strong>Productized Simplicity</strong></li>\n</ol>\n<ul>\n<li>Nail one thing.</li>\n<li>Example: The \"Yo\" app (just sends “Yo”), yet it dominated for its simplicity.</li>\n<li><em>Takeaway:</em> Complexity isn’t always an asset.</li>\n</ul>\n<h3 id=\"thecatapultprincipleconsistencybeatsentropy\"><strong>The Catapult Principle: Consistency Beats Entropy</strong></h3>\n<p>Success is like a catapult. The more you consistently pull, the farther you shoot. But inconsistency lets the stone fall off. </p>\n<p>\\\nBe diligent. Show up every day, especially when it feels pointless.</p>\n<h3 id=\"closingthoughtsthebesttimetostart\"><strong>Closing Thoughts: The Best Time to Start</strong></h3>\n<p>The best time to chase exponential growth was when you were a child. The second-best time is today.</p>\n<p>\\\nLinear growth gives comfort, but exponential growth gives freedom.</p>\n<p>\\\nLeverage your unique skills. Start small. Stay consistent. And one day, people will call you an overnight success. Rooting for you.</p>\n<p>\\\nEnjoy the rest of your day.</p>\n<p>\\\n<em>PS:</em> <strong>Want to unlock exponential growth and mental clarity?</strong> Join my newsletter: https://crive.substack.com</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Google pushes back against federal supervision of its payment arm","url":"https://techcrunch.com/2024/12/07/google-pushes-back-against-federal-supervision-of-its-payment-arm/","date":1733604058,"author":"Anthony Ha","unread":true,"desc":"","content":"<p>The Consumer Financial Protection Bureau announced Friday that it was placing Google’s payment arm under federal supervision. In response, Google filed a lawsuit seeking to block the move. Such supervision would subject Google to the same inspections that the bureau conducts with major banks and other financial institutions for potential violations of the law. The [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"What Is Agentic AI?","url":"https://hackernoon.com/what-is-agentic-ai?source=rss","date":1733604313,"author":"Vipin Labroo","unread":true,"desc":"","content":"<p>There is a fair amount of buzz in the tech world about Agentic AI. The answer to the question of what exactly it is is that it comprises software systems that can be likened to AI agents tasked with carrying out important tasks with very little human intervention. What makes it special is the fact that it can be relied upon to make decisions by factoring in all the variables and yet providing solutions to the most intricate of problems. </p>\n<p>\\\nIt does so by leveraging a variety of AI technologies like machine learning, large language models, and deep learning, complemented by reinforced learning.</p>\n<p>\\\nAgentic AI is a natural progression from regular AI and Gen AI in that unlike these, it is able to come up with turnkey enterprise solutions capable of accomplishing highly complex tasks and thereby better achieve business objectives. This is quite an enhancement in the ability of artificial intelligence to provide enterprise solutions autonomously.</p>\n<p>\\\nThe earlier AI systems could not do much beyond automating mundane tasks in accordance with set rules, crimping their ability to learn, change evolve, and make autonomous decisions, making them not very impactful when it came to addressing the needs of enterprise-level businesses. </p>\n<p>\\\nGenerative AI did step up to the plate to a certain extent by using large language models and natural language processing to generate myriad forms of content including the writing of code. That being stated much of this was achieved by providing prompts with this technology not really being able to act independently and autonomously.</p>\n<h2 id=\"agentiveaiaparadigmshift\"><strong>Agentive AI - A Paradigm Shift</strong></h2>\n<p>Agentive AI marks a paradigm shift in how AI is going to be perceived and seen by large-scale business organizations. It is its ability to learn- interact in complex scenarios and environments and use that to inform its autonomous decision-making puts it in a league far superior to Generative AI. </p>\n<p>\\\nFrom simplifying and optimizing complex workflows to responding with alacrity to ever-changing business needs reducing the cost of operations. This is a technology that has large organizations very excited about its capabilities.</p>\n<p>\\\nWhat makes AI positively stand out is its <strong>autonomous nature, its ability to reason and find context, learn by interacting with the environment it operates in, be able to understand the most complex instructions, and above, all its outstanding ability to optimize workflows.</strong></p>\n<p>\\\nAgentive AI promises to especially revolutionize content creation, customer service, software engineering, and healthcare. <em>This is a space that needs to be watched in 2025.</em></p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Elon Musk’s X gains a new image generator, Aurora","url":"https://techcrunch.com/2024/12/07/elon-musks-x-gains-a-new-image-generator-aurora/","date":1733605212,"author":"Kyle Wiggers","unread":true,"desc":"","content":"<p>X, the Elon Musk-owned social network previously known as Twitter, has added a new image generator to its Grok assistant. However, after going live for a few hours on Saturday, the product seemed to disappear for some users. Just like the first image generator X added to Grok in October, this one, called Aurora, appears [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"More Kernel Bitrot: Old & Busted UltraSPARC T2 \"Niagara 2\" SPU Driver Slated For Removal","url":"https://www.phoronix.com/news/Niagara-2-SPU-Driver-Bitrot","date":1733605799,"author":"Michael Larabel","unread":true,"desc":"","content":"Following 107k lines of old driver code within the staging area of the kernel removed for Linux 6.13, over in the crypto space they are looking at some cleaning as well with plans raised to remove the Stream Processing Unit (SPU) driver for the old Sun Niagara 2, the Sun UltraSPARC T2 and this SPU was also found in the UltraSPARC T3 as well...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"OpenAI bets you’ll pay $200 a month for ChatGPT","url":"https://techcrunch.com/2024/12/07/openai-bets-youll-pay-200-a-month-for-chatgpt/","date":1733606100,"author":"Cody Corrall","unread":true,"desc":"","content":"<p>Welcome back to Week in Review. This week, we’re diving into OpenAI’s surprise 12 days of reveals, an underwhelming Spotify Wrapped, and an app that tells you when you’ll die. 😰 Let’s get into it. OpenAI is getting into the holiday spirit. In a surprise “12 Days of OpenAI” event, the company will livestream updates [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"What Arm's CEO makes of the Intel debacle","url":"https://hardware.slashdot.org/story/24/12/07/0333209/what-arms-ceo-makes-of-the-intel-debacle?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733608200,"author":"EditorDavid","unread":true,"desc":"","content":"Arm \" is worth almost $150 billion,\" writes the Verge, \"which is now considerably more than Intel.\" \n\n\n\"With the news earlier this week that Intel CEO Pat Gelsinger 'retired' and Intel is evaluating its options for a possible spinoff or outright sale, I wanted to hear what [Arm CEO Rene] Haas thought should happen to his longtime frenemy. There were reports that [Haas] approached Intel about buying a big chunk of the company before Gelsinger was ousted....\"\n Haas: As someone who has been in the industry my whole career, it is a little sad to see what's happening... Intel is an innovation powerhouse. At the same time, you have to innovate in our industry. There are lots of tombstones of great tech companies that don't reinvent themselves. \n\nI think Intel's biggest dilemma is how to disassociate being either a vertical company [where a company owns its supply chain] or a fabless company, to oversimplify it. That is the fork in the road that they've faced for the last decade. Pat [Gelsinger] had a strategy that was very clear that vertical was the way to win. In my opinion, when he took that strategy on in 2021, that was not a three-year strategy. That was a five-to-10-year strategy. He's gone and there's a new CEO to be brought in and the decision has to be made. \nMy personal bias says that vertical integration is a pretty powerful thing. If they could get that right, I think they would be in an amazing position. But the cost associated with it is so high that it may be too big of a hill to climb. I'm not going to comment on the rumors that we wanted to buy them. But I think, again, if you're a vertically integrated company and the power of your strategy is in the fact that you have a product and you have fabs, inherently, you have a potential huge advantage in terms of cost versus the competition. \nWhen Pat was the CEO, I did tell him more than once, \"You ought to license Arm because if you've got your own fabs, fabs are all about volume and we can provide volume.\" I wasn't successful in convincing him to do that...\n \nHaas also obliquely commented on rumors that Arm will build its own AI chips, saying that companies making hardware are closer to the \"interlock\" of between hardware and software and \"have a much better perspective in terms of the design tradeoffs to make. So, if we were to do something, that would be one of the reasons.\" \n\n\nThe full interview will be coming to the Verge's Decoder podcast soon...<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=What+Arm's+CEO+makes+of+the+Intel+debacle%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F12%2F07%2F0333209%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F12%2F07%2F0333209%2Fwhat-arms-ceo-makes-of-the-intel-debacle%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://hardware.slashdot.org/story/24/12/07/0333209/what-arms-ceo-makes-of-the-intel-debacle?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23544219&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Google says its new AI model outperforms the top weather forecast system","url":"https://techcrunch.com/2024/12/07/google-says-its-new-ai-model-outperforms-the-top-weather-forecast-system/","date":1733610255,"author":"Anthony Ha","unread":true,"desc":"","content":"<p>Google’s DeepMind team unveiled an AI model for weather prediction this week called GenCast. In a paper published in Nature, DeepMind researchers said they found that GenCast outperforms the European Centre for Medium-Range Weather Forecasts’ ENS — apparently the world&#8217;s top operational forecasting system. And in a blog post, the DeepMind team offered a more [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"What Do You Think of Mozilla's New Branding?","url":"https://tech.slashdot.org/story/24/12/06/2037214/what-do-you-think-of-mozillas-new-branding?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733611800,"author":"EditorDavid","unread":true,"desc":"","content":"As a \"global crew of activists, technologists and builders,\" Mozilla open-sourced Firefox more than 25 years ago, notes a new blog post &mdash; and their president says Mozilla's mission is the same today: \"build and support technology in the public interest, and spark more innovation, more competition and more choice online along the way.\" \n\nBut \"Even though we've been at the forefront of privacy and open source, people weren't getting the full picture of what we do. We were missing opportunities to connect with both new and existing users.\" So this week the company announced a branding refresh, \"making sure people know Mozilla for its broader impact, as well as Firefox.\" \n\nThe open-source blog It's FOSS writes:\n\nMeant to symbolize their activist spirit, the new brand identity of Mozilla involves a custom semi-slab typeface that spells Mozilla, followed by a flag that was taken from the M of their name. Mozilla points out that this is not just a rebranding, but something that will lay the foundation for the next 25 years, helping them promote the ideals of privacy and open source. \n\nMozilla teamed up with the design agency used by major brands like Uber and Burger King, for a strategy they say will \"embody our role as a leader in digital rights and innovation, putting people over profits through privacy-preserving products, open-source developer tools, and community-building efforts...\"\n\nWe back people and projects that move technology, the internet and AI in the right direction. In a time of privacy breaches, AI challenges and misinformation, this transformation is all about rallying people to take back control of their time, individual expression, privacy, community and sense of wonder... [T]he new brand empowers people to speak up, come together and build a happier, healthier internet &mdash; one where we can all shape how our lives, online and off, unfold... \n\n- The flag symbol highlights our activist spirit, signifying a commitment to 'Reclaim the Internet.' A symbol of belief, peace, unity, pride, celebration and team spirit &mdash; built from the 'M' for Mozilla and a pixel that is conveniently displaced to reveal a wink to its iconic Tyrannosaurus rex symbol designed by Shepard Fairey. The flag can transform into a more literal interpretation as its new mascot in ASCII art style, and serve as a rallying cry for our cause... \n- The custom typefaces are bespoke and an evolution of its Mozilla slab serif today. It stands out in a sea of tech sans. The new interpretation is more innovative and built for its tech platforms. The sans brings character to something that was once hard working but generic. These fonts are interchangeable and allow for a greater degree of expression across its brand experience, connecting everything together. \n\nThe blog post at It's FOSS ends with a \"trip down memory lane\" &mdash; showing Mozilla's two previous logos. \"I will be honest, I liked the Dino better,\" they write \"the 2024 logo is a nice mix of a custom typeface and a flag, which looks really neat in my opinion.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=What+Do+You+Think+of+Mozilla's+New+Branding%3F%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F06%2F2037214%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F06%2F2037214%2Fwhat-do-you-think-of-mozillas-new-branding%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://tech.slashdot.org/story/24/12/06/2037214/what-do-you-think-of-mozillas-new-branding?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23543917&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Wuhan Lab Researcher Fully Sequences Genomes of Coronavirus Samples From 2004 to 2021, Finds No Close Relatives to SARS-CoV-2","url":"https://science.slashdot.org/story/24/12/07/2124249/wuhan-lab-researcher-fully-sequences-genomes-of-coronavirus-samples-from-2004-to-2021-finds-no-close-relatives-to-sars-cov-2?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733615400,"author":"EditorDavid","unread":true,"desc":"","content":"60-year-old Chinese virologist Shi Zhengli led the Wuhan Institute of Virology's group studying bat coronaviruses (prompting Science magazine to call her \"Bat Woman\"). In June of 2020 Scientific American described Zhengli as \"distressed because stories from the Internet and major media have repeated a tenuous suggestion that SARS-CoV-2 accidentally leaked from her lab &mdash; despite the fact that its genetic sequence does not match any her lab had previously studied.\" \n\nMore than four years later, Nature writes Friday that Zhengli \"reported that none of the viruses stored in her freezers are the most recent ancestors of the virus SARS-CoV-2,\" presenting data at a conference in Japan \"on dozens of new coronaviruses collected from bats in southern China.\"\n\nShi has consistently said that SARS-CoV-2 was never seen or studied in her lab. But some commentators have continued to ask whether one of the many bat coronaviruses her team collected in southern China over decades was closely related to it. Shi promised to sequence the genomes of the coronaviruses and release the data. The latest analysis, which has not been peer reviewed, includes data from the whole genomes of 56 new betacoronaviruses, the broad group to which SARS-CoV-2 belongs, as well as some partial sequences. All the viruses were collected between 2004 and 2021. \n\n\"We didn't find any new sequences which are more closely related to SARS-CoV-1 and SARS-CoV-2,\" said Shi, in a pre-recorded presentation at the conference... The results support her assertion that the WIV lab did not have any bat-derived sequences from viruses that were more closely related to SARS-CoV-2 than were any already described in scientific papers, says Jonathan Pekar, an evolutionary biologist at the University of Edinburgh, UK. \"This just validates what she was saying: that she did not have anything extremely closely related, as we've seen in the years since,\" he says. \n\"Earlier this year, Shi moved from the WIV to the Guangzhou Laboratory, a newly established national research institute for infectious diseases.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Wuhan+Lab+Researcher+Fully+Sequences+Genomes+of+Coronavirus+Samples+From+2004+to+2021%2C+Finds+No+Close+Relatives+to+SARS-CoV-2%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F12%2F07%2F2124249%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F12%2F07%2F2124249%2Fwuhan-lab-researcher-fully-sequences-genomes-of-coronavirus-samples-from-2004-to-2021-finds-no-close-relatives-to-sars-cov-2%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://science.slashdot.org/story/24/12/07/2124249/wuhan-lab-researcher-fully-sequences-genomes-of-coronavirus-samples-from-2004-to-2021-finds-no-close-relatives-to-sars-cov-2?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23544811&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"From Atomic to Nuclear Clocks - and a Leap in Timekeeping Accuracy?","url":"https://science.slashdot.org/story/24/12/08/0223243/from-atomic-to-nuclear-clocks---and-a-leap-in-timekeeping-accuracy?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733625240,"author":"EditorDavid","unread":true,"desc":"","content":"\"In September 2024, U.S. scientists made key advances towards building a nuclear clock &mdash; a step beyond an atomic clock,\" according to ScienceAlert:\n\nIn contrast to the atomic clock, the transition measured by this new device happens in the nucleus, or core, of the atom (hence the name), which gives it an even higher frequency. Thorium-229, the atom used for this study, offers a nuclear transition that can be excited by ultraviolet light. The team working on the nuclear clock overcame the technological challenge of building a frequency comb that works at the relatively high frequency range of ultraviolet light. This was a big step forward because nuclear transitions usually only become visible at much higher frequencies &mdash; like those of gamma radiation. But we are not able to accurately measure transitions in the gamma range yet. \n\nThe thorium atom transition has a frequency roughly one million times higher than the caesium atom's. This means that, although it has been measured with a lower accuracy than the current state-of-the-art strontium clock, it promises a new generation of clocks with much more precise definitions of the second. Measuring time to the nineteenth decimal place, as nuclear clocks could do, would allow scientists to study very fast processes... [G]eneral relativity is used to study high speed processes that could lead to overlaps with quantum mechanics. A nuclear clock will give us the technology necessary for proving these theories. [The clocks &#226;oewill enable the study of the union of general relativity and quantum mechanics once they become sensitive to the finite wavefunction of quantum objects oscillating in curved space-time,&#226; according to the abstract of the researchers&#226;(TM) paper.] \n\n\nOn a technological level, precise positioning systems such as GPS are based on complex calculations that require fine measurements of the time required by a signal to jump from one device to a satellite and onto another device. A better definition of the second will translate to much more accurate GPS. Time might be up for the caesium second, but a whole new world awaits beyond it. \n\nAs the researchers explain their paper's abstract,<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=From+Atomic+to+Nuclear+Clocks+-++and+a+Leap+in+Timekeeping++Accuracy%3F%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F12%2F08%2F0223243%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F12%2F08%2F0223243%2Ffrom-atomic-to-nuclear-clocks---and-a-leap-in-timekeeping-accuracy%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://science.slashdot.org/story/24/12/08/0223243/from-atomic-to-nuclear-clocks---and-a-leap-in-timekeeping-accuracy?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23544977&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"OpenAI Partners with Anduril, Leaving Some Employees Concerned Over Militarization of AI","url":"https://news.slashdot.org/story/24/12/08/0022207/openai-partners-with-anduril-leaving-some-employees-concerned-over-militarization-of-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733632440,"author":"EditorDavid","unread":true,"desc":"","content":"\"OpenAI is partnering with defense tech company Anduril,\" wrote the Verge this week, noting that OpenAI \"used to describe its mission as saving the world.\"\n\nIt was Anduril founder Palmer Luckey who advocated for a \"warrior class\" and autonomous weapons during a talk at Pepperdine University, saying society's need people \"excited about enacting violence on others in pursuit of good aims.\" The Verge notes it's OpenAI's first partnership with a defense contractor \"and a significant reversal of its earlier stance towards the military.\"\n\n OpenAI's terms of service once banned \"military and warfare\" use of its technology, but it softened its position on military use earlier this year, changing its terms of service in January to remove the proscription.\n \n\nHours after the announcement, some OpenAI employees \"raised ethical concerns about the prospect of AI technology they helped develop being put to military use,\" reports the Washington Post. \"On an internal company discussion forum, employees pushed back on the deal and asked for more transparency from leaders, messages viewed by The Washington Post show.\"\n\nOpenAI has said its work with Anduril will be limited to using AI to enhance systems the defense company sells the Pentagon to defend U.S. soldiers from drone attacks. Employees at the AI developer asked in internal messages how OpenAI could ensure Anduril systems aided by its technology wouldn't also be directed against human-piloted aircraft, or stop the U.S. military from deploying them in other ways. One OpenAI worker said the company appeared to be trying to downplay the clear implications of doing business with a weapons manufacturer, the messages showed. Another said that they were concerned the deal would hurt OpenAI's reputation, according to the messages... \n\nOpenAI executives quickly acknowledged the concerns, messages seen by The Post show, while also writing that the company's work with Anduril is limited to defensive systems intended to save American lives. Other OpenAI employees in the forum said that they supported the deal and were thankful the company supported internal discussion on the topic. \"We are proud to help keep safe the people who risk their lives to keep our families and our country safe,\" OpenAI CEO Sam Altman said in a statement... \n\n[OpenAI] has invested heavily in safety testing, and said that the Anduril project was vetted by its policy team. OpenAI has held feedback sessions with employees on its national security work in the past few months, and plans to hold more, Liz Bourgeois, an OpenAI spokesperson said. In the internal discussions seen by The Post, the executives stated that it was important for OpenAI to provide the best technology available to militaries run by democratically-elected governments, and that authoritarian governments would not hold back from using AI for military uses. Some workers countered that the United States has sold weapons to authoritarian allies. By taking on military projects, OpenAI could help the U.S. government understand AI technology better and prepare to defend against its use by potential adversaries, executives also said. \n\n\"The debate inside OpenAI comes after the ChatGPT maker and other leading AI developers including Anthropic and Meta changed their policies to allow military use of their technology,\" the article points out. And it also notes another concern raised in OpenAI's internal discussion forum. \n\nThe comment said \"that defensive use cases still represented militarization of AI, and noted that the fictional AI system Skynet, which turns on humanity in the Terminator movies, was also originally designed to defend against aerial attacks on North America.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI+Partners+with+Anduril%2C+Leaving+Some+Employees+Concerned+Over+Militarization+of+AI%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F12%2F08%2F0022207%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F12%2F08%2F0022207%2Fopenai-partners-with-anduril-leaving-some-employees-concerned-over-militarization-of-ai%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://news.slashdot.org/story/24/12/08/0022207/openai-partners-with-anduril-leaving-some-employees-concerned-over-militarization-of-ai?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23544915&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""}]}