{"id":"6C2W1azD1rBrwqWWL9kQ1NofbtZZftJZnfQ3u9LZdNi3d1BmyU9HagS","title":"Command+Shift+Left","displayTitle":"Podcast - Cmd+Shift+Left","url":"https://feeds.buzzsprout.com/2105116.rss","feedLink":"https://www.cmdshiftleft.com/","items":[{"title":"E28: Quantum Security & Tech Debt Traps","url":"","date":1730379600,"author":"","unread":true,"desc":"","content":"<p>In this episode, we dive into the fascinating layers of &quot;everything as code&quot; and how recursive coding practices are changing software management. We explore the potential of quantum cryptography to revolutionize data security, possibly making hacks a thing of the past. Finally, we tackle the growing tech debt that comes from trying to reinvent the wheel and why keeping things “boring” can be the smartest strategy. </p><p>Stay updated with new weekly episodes every Thursday – and don&apos;t forget to subscribe! For more behind-the-scenes content, follow us @justshiftleft on Facebook, Instagram, Twitter, and LinkedIn.</p>","flags":null,"enclosureUrl":"https://www.buzzsprout.com/2105116/episodes/16025431-e28-quantum-security-tech-debt-traps.mp3","enclosureMime":""},{"title":"E29: Hacktoberfest & AI Paradoxes","url":"","date":1730901600,"author":"","unread":true,"desc":"","content":"<p>In this episode, we discuss Hacktoberfest’s impact on open-source contributions and the unique challenges it brings for maintainers. Then, we went into the “Jevons Paradox” and its relevance to AI, exploring how increased efficiency can lead to skyrocketing demand and unexpected consequences. <br/><br/>We also tackle the age-old question of balancing quick MVP development with long-term scalability—when to cut corners and when to plan for the future. Finally, we look at how FPGAs and specialized silicon are transforming hardware development.</p><p>Stay updated with new weekly episodes every Thursday – and don&apos;t forget to subscribe! For more behind-the-scenes content, follow us @justshiftleft on Facebook, Instagram, Twitter, and LinkedIn.</p>","flags":null,"enclosureUrl":"https://www.buzzsprout.com/2105116/episodes/16053123-e29-hacktoberfest-ai-paradoxes.mp3","enclosureMime":""}]}