{
  "id": "6gUbcJtcgqw1wQBapm8qwcP58MMnPvoDmUVDva7XtKUuLQTDpuyDxDo1yehnZDohDQ6a5p",
  "title": "Slashdot: Developers",
  "displayTitle": "Dev - Slashdot - Dev",
  "url": "http://rss.slashdot.org/Slashdot/slashdotDevelopers",
  "feedLink": "https://developers.slashdot.org/",
  "items": [
    {
      "title": "Verify the Rust's Standard Library's 7,500 Unsafe Functions - and Win 'Financial Rewards'",
      "url": "https://developers.slashdot.org/story/24/11/23/2327203/verify-the-rusts-standard-librarys-7500-unsafe-functions---and-win-financial-rewards?utm_source=rss1.0mainlinkanon&utm_medium=feed",
      "date": 1732415640,
      "author": "EditorDavid",
      "unread": true,
      "desc": "",
      "content": "The Rust community has \"recognized the unsafety of Rust (if used incorrectly),\" according to a blog post by Amazon Web Services. \nSo now AWS and the Rust Foundation are \"crowdsourcing an effort to verify the Rust standard library,\" according to an article at DevClass.com, \"by setting out a series of challenges for devs and offering financial rewards for solutions...\"\n\nRust includes ways to bypass its safety guarantees though, with the use of the \"unsafe\" keyword... The issue AWS highlights is that even if developers use only safe code, most applications still depend on the Rust standard library. AWS states that there are approximately 7.5K unsafe functions in the Rust Standard Library and notes that 57 \"soundness issues\" and 20 CVEs (Common Vulnerabilities and Exposures) have been reported in the last three years. [28% of the soundness issues were discovered in 2024.] \n\nMarking a function as unsafe does not mean it is vulnerable, only that Rust does not guarantee its safety. AWS plans to reduce the risk by using tools and techniques for formal verification of key library code, but believes that \"a single team would be unable to make significant inroads\" for reasons including the lack of a verification mechanism in the Rust ecosystem and what it calls the \"unknowns of scalable verification.\" The plan therefore is to turn this over to the community, by posing challenges and rewarding developers for solutions.... A GitHub repository provides a fork of the Rust code and includes a set of challenges, currently 13 of them... The Rust Foundation says that there is a financial reward tied to each challenge, and that the \"challenge rewards committee is responsible for reviewing activity and dispensing rewards.\" How much will be paid though is not stated. \nDespite the wide admiration for Rust, there is no formal specification for the language, an issue which impacts formal verification efforts. \n\n\nThanks to Slashdot reader sean-it-all for sharing the news.\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Verify+the+Rust's+Standard+Library's+7%2C500+Unsafe+Functions+-+and+Win+'Financial+Rewards'%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F11%2F23%2F2327203%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F11%2F23%2F2327203%2Fverify-the-rusts-standard-librarys-7500-unsafe-functions---and-win-financial-rewards%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://developers.slashdot.org/story/24/11/23/2327203/verify-the-rusts-standard-librarys-7500-unsafe-functions---and-win-financial-rewards?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>",
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": ""
    },
    {
      "title": "MacFORTH Code for 1984 Robot-Coding Game 'ChipWits' from 1984 is Now Open Source",
      "url": "https://news.slashdot.org/story/24/11/24/019242/macforth-code-for-1984-robot-coding-game-chipwits-from-1984-is-now-open-source?utm_source=rss1.0mainlinkanon&utm_medium=feed",
      "date": 1732469640,
      "author": "EditorDavid",
      "unread": true,
      "desc": "",
      "content": "Back in the mid-1980s Mark Roth was in 5th grade when the game ChipWits \"helped kindle his interest in coding,\" according to an online biography. (\"By middle school, he wrote his first Commodore 64 assembler and by high school he authored a 3D Graphics library for DOS.\") \n\nAnd 40 years later, Slashdot reader markroth8 writes that the programming puzzle/logic game \"inspired many people to become professional coders\":\n\nChipWits was first released for Mac in 1984, and was later ported to Commodore 64 and Apple II in 1985. To celebrate the game's 40th anniversary, the team behind the new Steam reboot of ChipWits (including its original co-creator Doug Sharp, also of fame for the game King of Chicago) is announcing the recovery and open source release of the original game's source code, written in the FORTH programming language, for both Mac and Commodore 64 platforms. \n\nRecovering data from 40-year old 5.25\" and 3.5\" disks was a challenge in and of itself, and most of the data survived unscathed! It's interesting to read the 40-year-old code, and compare it to modern game development. \n\n\"Our goal for open sourcing the original version of ChipWits is to ensure its legacy lives on,\" according to the announcement. (It adds that \"We also wanted to share an appreciation for what cross-platform software development for 8-bit microcomputers was like in 1984.\")<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=MacFORTH+Code+for+1984+Robot-Coding+Game+'ChipWits'+from+1984+is+Now+Open+Source%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F11%2F24%2F019242%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F11%2F24%2F019242%2Fmacforth-code-for-1984-robot-coding-game-chipwits-from-1984-is-now-open-source%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://news.slashdot.org/story/24/11/24/019242/macforth-code-for-1984-robot-coding-game-chipwits-from-1984-is-now-open-source?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>",
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": ""
    },
    {
      "title": "Coding Boot Gamp Graduates Find Tough Prospects In an AI-Powered World",
      "url": "https://news.slashdot.org/story/24/11/24/2159232/coding-boot-gamp-graduates-find-tough-prospects-in-an-ai-powered-world?utm_source=rss1.0mainlinkanon&utm_medium=feed",
      "date": 1732485840,
      "author": "EditorDavid",
      "unread": true,
      "desc": "",
      "content": "An anonymous reader shared this report from the New York Times:\n\nBetween the time [construction worker Florencio] Rendon applied for the coding boot camp and the time he graduated, what Mr. Rendon imagined as a \"golden ticket\" to a better life had expired. About 135,000 start-up and tech industry workers were laid off from their jobs, according to one count. At the same time, new artificial intelligence tools like ChatGPT, an online chatbot from OpenAI, which could be used as coding assistants, were quickly becoming mainstream, and the outlook for coding jobs was shifting. Mr. Rendon says he didn't land a single interview. \n\nCoding boot camp graduates across the country are facing a similarly tough job market. In Philadelphia, Mal Durham, a lawyer who wanted to change careers, was about halfway through a part-time coding boot camp late last year when its organizers with the nonprofit Launchcode delivered disappointing news. \"They said: 'Here is what the hiring metrics look like. Things are down. The number of opportunities is down,'\" she said. \"It was really disconcerting.\" In Boston, Dan Pickett, the founder of a boot camp called Launch Academy, decided in May to pause his courses indefinitely because his job placement rates, once as high as 90 percent, had dwindled to below 60 percent. \"I loved what we were doing,\" he said. \"We served the market. We changed a lot of lives. The team didn't want that to turn sour.\" \n\nCompared with five years ago, the number of active job postings for software developers has dropped 56 percent, according to data compiled by CompTIA. For inexperienced developers, the plunge is an even worse 67 percent. \"I would say this is the worst environment for entry-level jobs in tech, period, that I've seen in 25 years,\" said Venky Ganesan, a partner at the venture capital firm Menlo Ventures. \n\n\nA Stack Overflow survey of 65,000 developers found that 60% had used AI coding tools this year, the article points out. And it includes two predictions about the future:\n\n\n Armando Solar-Lezama, leader of MIT's Computer-Assisted Programming Group, \"believes that A.I. tools are good news for programming careers. If coding becomes easier, he argues, we'll just make more, better software. We'll use it to solve problems that wouldn't have been worth the hassle previously, and standards will skyrocket.\"\n\nZach Sims, a co-founder of Codecademy, said of the job prospects for coding boot camp graduates\" \"I think it's pretty grim.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Coding+Boot+Gamp+Graduates+Find+Tough+Prospects+In+an+AI-Powered+World%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F11%2F24%2F2159232%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F11%2F24%2F2159232%2Fcoding-boot-gamp-graduates-find-tough-prospects-in-an-ai-powered-world%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://news.slashdot.org/story/24/11/24/2159232/coding-boot-gamp-graduates-find-tough-prospects-in-an-ai-powered-world?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>",
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": ""
    },
    {
      "title": "Tech Job Slump Hits Coding Bootcamp Graduates as AI Reshapes Industry",
      "url": "https://developers.slashdot.org/story/24/11/25/1241210/tech-job-slump-hits-coding-bootcamp-graduates-as-ai-reshapes-industry?utm_source=rss1.0mainlinkanon&utm_medium=feed",
      "date": 1732543200,
      "author": "msmash",
      "unread": true,
      "desc": "",
      "content": "U.S. software developer job listings have plummeted 56% since 2019, according to CompTIA data, as coding bootcamp graduates face mounting challenges from AI tools and widespread tech industry layoffs. \n\nFor entry-level positions, postings have dropped even further at 67%. The downturn has forced several bootcamps to adapt or close. Boston's Launch Academy suspended operations in May after job placement rates fell from 90% to below 60%. Meanwhile, AI coding tools like ChatGPT and GitHub's Copilot are transforming the industry, with Google reporting that AI now generates over 25% of its new code. \n\n\"This is the worst environment for entry-level tech jobs I've seen in 25 years,\" said Menlo Ventures partner Venky Ganesan.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Tech+Job+Slump+Hits+Coding+Bootcamp+Graduates+as+AI+Reshapes+Industry%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F11%2F25%2F1241210%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F11%2F25%2F1241210%2Ftech-job-slump-hits-coding-bootcamp-graduates-as-ai-reshapes-industry%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://developers.slashdot.org/story/24/11/25/1241210/tech-job-slump-hits-coding-bootcamp-graduates-as-ai-reshapes-industry?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>",
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": ""
    },
    {
      "title": "Senator Introduces Bill To Compel More Transparency From AI Developers",
      "url": "https://yro.slashdot.org/story/24/11/26/0047249/senator-introduces-bill-to-compel-more-transparency-from-ai-developers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
      "date": 1732583400,
      "author": "BeauHD",
      "unread": true,
      "desc": "",
      "content": "A new bill introduced by Sen. Peter Welch (D-Vt) aims to make it easier for human creators to find out if their work was used without permission to train artificial intelligence. NBC News reports: The Transparency and Responsibility for Artificial Intelligence Networks (TRAIN) Act would enable copyright holders to subpoena training records of generative AI models, if the holder can declare a \"good faith belief\" that their work was used to train the model. The developers would only need to reveal the training material that is \"sufficient to identify with certainty\" whether the copyright holder's works were used. Failing to comply would create a legal assumption -- until proven otherwise -- that the AI developer did indeed use the copyrighted work. [...]\n \nIn a news release, Welch said the TRAIN Act has been endorsed by several organizations -- including the Screen Actors Guild-American Federation of Television and Radio Artists (SAG-AFTRA), the American Federation of Musicians, and the Recording Academy -- as well as major music labels -- including Universal Music Group, Warner Music Group and Sony Music Group.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Senator+Introduces+Bill+To+Compel+More+Transparency+From+AI+Developers%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F24%2F11%2F26%2F0047249%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fyro.slashdot.org%2Fstory%2F24%2F11%2F26%2F0047249%2Fsenator-introduces-bill-to-compel-more-transparency-from-ai-developers%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://yro.slashdot.org/story/24/11/26/0047249/senator-introduces-bill-to-compel-more-transparency-from-ai-developers?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>",
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": ""
    },
    {
      "title": "Pokemon Fan Learns To Code In Order To Archive TCG",
      "url": "https://developers.slashdot.org/story/24/11/26/016253/pokemon-fan-learns-to-code-in-order-to-archive-tcg?utm_source=rss1.0mainlinkanon&utm_medium=feed",
      "date": 1732591800,
      "author": "BeauHD",
      "unread": true,
      "desc": "",
      "content": "An anonymous reader quotes a report from TheGamer: With thousands of cards available in Pokemon's \"Pokemon Trading Card Game,\" it can be hard to remember what is what. After all, since first debuting in the mid 1990s to coincide with the games of the same name, the popular collectible has been going strong ever since, with new releases constantly filling store shelves. That said, one avid Pokemon fan took it upon themselves to archive the card game's unique artwork. After hundreds of hours of work, over 23,000 cards have been archived, along with an additional 2,000 pieces of artwork. The end result is one of the best fan creations around.\n \nMeet Twitter user pkm_jp, who devoted hundreds of hours to learning how to program in order to make their dream of a one-stop shop of all available card art a reality. \"I remember the joy of getting the first set page working, displaying a small collection of cards,\" they wrote on Twitter. \"I knew it was just the beginning.\" The site, artofpkm.com, \"is dedicated to bringing artists and fans together,\" the created said on X (formerly Twitter). They note that there is still \"lots of artwork still to be added and labeled,\" among other features such as \"custom lists, voting, and a proper blog.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Pokemon+Fan+Learns+To+Code+In+Order+To+Archive+TCG%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F11%2F26%2F016253%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F11%2F26%2F016253%2Fpokemon-fan-learns-to-code-in-order-to-archive-tcg%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://developers.slashdot.org/story/24/11/26/016253/pokemon-fan-learns-to-code-in-order-to-archive-tcg?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>",
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": ""
    },
    {
      "title": "Stanford Research Reveals 9.5% of Software Engineers 'Do Virtually Nothing'",
      "url": "https://developers.slashdot.org/story/24/11/26/1346219/stanford-research-reveals-95-of-software-engineers-do-virtually-nothing?utm_source=rss1.0mainlinkanon&utm_medium=feed",
      "date": 1732629600,
      "author": "msmash",
      "unread": true,
      "desc": "",
      "content": "A Stanford study of over 50,000 software engineers across hundreds of companies has found that approximately 9.5% of engineers perform minimal work while drawing full salaries, potentially costing tech companies billions annually. \n\nThe research showed the issue is most prevalent in remote work settings, where 14% of engineers were classified as \"ghost engineers\" compared to 6% of office-based staff. The study evaluated productivity through analysis of private Git repositories and simulated expert assessments of code commits. \n\nMajor tech companies could be significantly impacted, with IBM estimated to have 17,100 underperforming engineers at an annual cost of $2.5 billion. Across the global software industry, the researchers estimate the total cost of underperforming engineers could reach $90 billion, based on a conservative 6.5% rate of \"ghost engineers\" worldwide.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Stanford+Research+Reveals+9.5%25+of+Software+Engineers+'Do+Virtually+Nothing'%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F11%2F26%2F1346219%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F11%2F26%2F1346219%2Fstanford-research-reveals-95-of-software-engineers-do-virtually-nothing%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://developers.slashdot.org/story/24/11/26/1346219/stanford-research-reveals-95-of-software-engineers-do-virtually-nothing?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>",
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": ""
    },
    {
      "title": "USPTO Petitioned To Cancel Oracle's JavaScript Trademark",
      "url": "https://developers.slashdot.org/story/24/11/26/1312213/uspto-petitioned-to-cancel-oracles-javascript-trademark?utm_source=rss1.0mainlinkanon&utm_medium=feed",
      "date": 1732639260,
      "author": "msmash",
      "unread": true,
      "desc": "",
      "content": "Software company Deno Land has filed a petition with the U.S. Patent and Trademark Office to cancel Oracle's JavaScript trademark, citing trademark abandonment and fraud. The November 22 filing claims Oracle has not sold JavaScript products or services since acquiring the trademark through its 2009 Sun Microsystems purchase. The petition alleges Oracle committed fraud during its 2019 trademark renewal by submitting Node.js website screenshots without authorization. \n\nThe legal action follows a September open letter from JavaScript creator Brendan Eich, Node.js and Deno creator Ryan Dahl, and other prominent JavaScript developers urging Oracle to relinquish the trademark. The letter has garnered over 14,000 signatures.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=USPTO+Petitioned+To+Cancel+Oracle's+JavaScript+Trademark%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F11%2F26%2F1312213%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F11%2F26%2F1312213%2Fuspto-petitioned-to-cancel-oracles-javascript-trademark%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://developers.slashdot.org/story/24/11/26/1312213/uspto-petitioned-to-cancel-oracles-javascript-trademark?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>",
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": ""
    },
    {
      "title": "'Hour of Code' Cartoon Includes a Shout-Out to AI",
      "url": "https://news.slashdot.org/story/24/11/30/2343244/hour-of-code-cartoon-includes-a-shout-out-to-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
      "date": 1733070840,
      "author": "EditorDavid",
      "unread": true,
      "desc": "",
      "content": "Nonprofit Code.org has posted this year's cartoon for \"Hour of Code,\" their annual learn-to-code event for schoolchildren. \n\nLong-time Slashdot reader theodp notes its animated pigeon gives a shout-out to the AI that could ultimately replace programmers:\n\nIn an Instagram post introducing the video, Code.org explains: \"Bartlett the Pigeon just learned how to code and now thinks he's smarter than us. Honestly...he might be. Meet the face (and feathers) of this year's #HourOfCode.\" In the video, Bartlett wows a social media influencer with his coding skills. \"Is this pigeon typing code?\" she asks in disbelief. \"I'm going to film this for my socials!\" Bartlett goes on to explain that the song he remixes with coding blocks &mdash; Aloe Blacc's \"I Need a Dollar\" &mdash; could have instead been generated by simply using AI, which he says is \"like having a personal DJ assistant who never misses a beat!\" \n\nInterestingly, Blacc noted in a 2011 interview that he wrote \"I Need a Dollar\" after being made redundant in his career as a business consultant by Ernst &amp; Young. That multinational company is now advising global business leaders on how they can harness the power of GenAI \"to achieve more with fewer resources\" by disrupting professions &mdash; like programming &mdash; that \"involve a high degree of repetitive and data-driven tasks that AI can automate.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status='Hour+of+Code'+Cartoon+Includes+a+Shout-Out+to+AI%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F11%2F30%2F2343244%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F11%2F30%2F2343244%2Fhour-of-code-cartoon-includes-a-shout-out-to-ai%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://news.slashdot.org/story/24/11/30/2343244/hour-of-code-cartoon-includes-a-shout-out-to-ai?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>",
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": ""
    },
    {
      "title": "CJIT - C, Just In Time!",
      "url": "https://developers.slashdot.org/story/24/12/01/0016250/cjit---c-just-in-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
      "date": 1733078040,
      "author": "EditorDavid",
      "unread": true,
      "desc": "",
      "content": "Long-time Slashdot reader jaromil writes:\nAs a fun project, we hacked together a C interpreter (based on Tiny C Compiler) that compiles C code in-memory and runs it live. \n\nCJIT today is a 2MB executable that can do a lot, including call functions from any installed library on Linux, Windows, and MacOSX.\n \nSlashdot reader oliwer points out \"they are also including a REPL, which could be interesting.\" And the CJIT web page promises there's \"no EULA to sign, no IDE to install... 100% Free and open source!\" \n\nIt also says the project was inspired by Terry Davis (TempleOS) and Fabrice Bellard (Tiny C Compiler).<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=CJIT+-+C%2C+Just+In+Time!%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F01%2F0016250%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F01%2F0016250%2Fcjit---c-just-in-time%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://developers.slashdot.org/story/24/12/01/0016250/cjit---c-just-in-time?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>",
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": ""
    },
    {
      "title": "Greg Kroah-Hartman Sees 'Tipping Point' for Rust Drivers in Linux Kernel",
      "url": "https://linux.slashdot.org/story/24/12/01/1837222/greg-kroah-hartman-sees-tipping-point-for-rust-drivers-in-linux-kernel?utm_source=rss1.0mainlinkanon&utm_medium=feed",
      "date": 1733081640,
      "author": "EditorDavid",
      "unread": true,
      "desc": "",
      "content": "Greg Kroah-Hartman noted some coming changes in Linux 6.13 will make it possible to create \"way more\" Rust-based kernel drivers. \"The veteran kernel developer believes we're at a tipping point of seeing more upstream Rust drivers ahead,\" reports Phoronix:\n\nThese Rust char/misc changes are on top of the main Rust pull for Linux 6.13 that brought 3k lines of code for providing more Rust infrastructure. Linux 6.13 separately is also bringing Rust file abstractions.\n \n\n\"Sorry for doing this at the end of the merge window,\" Greg Kroah-Hartman wrote in the pull request, explaining that \"conference and holiday travel got in the way on my side (hence the 5am pull request emails...)\"\n\nLoads of things in here... \n &mdash; Rust misc driver bindings and other rust changes to make misc drivers actually possible. I think this is the tipping point, expect to see way more rust drivers going forward now that these bindings are present. \nNext merge window hopefully we will have pci and platform drivers working, which will fully enable almost all driver subsystems to start accepting (or at least getting) rust drivers. This is the end result of a lot of work from a lot of people, congrats to all of them for getting this far, you've proved many of us wrong in the best way possible, working code :)\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Greg+Kroah-Hartman+Sees+'Tipping+Point'+for+Rust+Drivers+in+Linux+Kernel%3A+https%3A%2F%2Flinux.slashdot.org%2Fstory%2F24%2F12%2F01%2F1837222%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Flinux.slashdot.org%2Fstory%2F24%2F12%2F01%2F1837222%2Fgreg-kroah-hartman-sees-tipping-point-for-rust-drivers-in-linux-kernel%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://linux.slashdot.org/story/24/12/01/1837222/greg-kroah-hartman-sees-tipping-point-for-rust-drivers-in-linux-kernel?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>",
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": ""
    },
    {
      "title": "2024's Geek 'Advent Calendar's Offer Challenges - and a Magnus Carlsen-Signed Chessboard",
      "url": "https://entertainment.slashdot.org/story/24/12/04/0132245/2024s-geek-advent-calendars-offer-challenges---and-a-magnus-carlsen-signed-chessboard?utm_source=rss1.0mainlinkanon&utm_medium=feed",
      "date": 1733326440,
      "author": "EditorDavid",
      "unread": true,
      "desc": "",
      "content": "The long-running Advent of Code site just entered its 10th year, with 162,809 people completing both of its Day One puzzles (which involve a hunt for the missing historian of the North Pole).\n\nBut its not the only site offering Christmas-themed programming puzzles:\n\n\nHundreds of SQL lovers are trying the daily challenges from the \"Advent of SQL\" site.\n\nYou can sign up for daily emails with webdev challenges from the Advent of JavaScript and Advent of CSS sites. \nThe \"Advent of No-Code\" site challenges you to build something new every day using no-code tools like AI-powered dev environments or the social coding site Val Town.\n TryHackMe.com is publishing \"beginner-friendly, daily gamified cyber security challenges\" in an event they're calling the \"Advent of Cyber.\"\n\nAnd Norway's biggest chess club (founded by world champion Magnus Carlsen) has even launched a site with daily chess puzzles called &mdash; what else? &mdash; Advent of Chess. (It promises at the end of the event someone will win a chessboard signed by Magnus Carlsen).\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=2024's+Geek+'Advent+Calendar's+Offer+Challenges+-+and+a+Magnus+Carlsen-Signed+Chessboard%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F24%2F12%2F04%2F0132245%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F24%2F12%2F04%2F0132245%2F2024s-geek-advent-calendars-offer-challenges---and-a-magnus-carlsen-signed-chessboard%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://entertainment.slashdot.org/story/24/12/04/0132245/2024s-geek-advent-calendars-offer-challenges---and-a-magnus-carlsen-signed-chessboard?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>",
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": ""
    },
    {
      "title": "Meta Using OpenAI's GPT-4 in Internal Coding Tool Despite Llama Push",
      "url": "https://developers.slashdot.org/story/24/12/04/0033227/meta-using-openais-gpt-4-in-internal-coding-tool-despite-llama-push?utm_source=rss1.0mainlinkanon&utm_medium=feed",
      "date": 1733333640,
      "author": "msmash",
      "unread": true,
      "desc": "",
      "content": "Meta is using OpenAI's GPT-4 alongside its own Llama AI model in Metamate, an internal coding assistance tool, Fortune reported Tuesday. The dual-model approach has been in place since early 2024, despite CEO Mark Zuckerberg's public promotion of Llama as a leading AI model. \n\nMetamate, previously known as Code Compose, serves Meta's developers and employees with coding support. The Chan Zuckerberg Initiative, Zuckerberg's philanthropic organization, is separately developing an educational AI tool using OpenAI's technology, with OpenAI CEO Sam Altman joining CZI's AI advisory board.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Meta+Using+OpenAI's+GPT-4+in+Internal+Coding+Tool+Despite+Llama+Push%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F04%2F0033227%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F04%2F0033227%2Fmeta-using-openais-gpt-4-in-internal-coding-tool-despite-llama-push%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://developers.slashdot.org/story/24/12/04/0033227/meta-using-openais-gpt-4-in-internal-coding-tool-despite-llama-push?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>",
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": ""
    },
    {
      "title": "The Rust Foundation's Plan to Grow the Pool of Well-Trained Rust Developers",
      "url": "https://developers.slashdot.org/story/24/12/05/2222220/the-rust-foundations-plan-to-grow-the-pool-of-well-trained-rust-developers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
      "date": 1733437500,
      "author": "EditorDavid",
      "unread": true,
      "desc": "",
      "content": "\"The Rust Foundation is dedicated to ensuring a healthy Rust ecosystem,\" according to a new announcement today, \" which depends on a growing pool of well-trained developers to thrive.\"\n\nThe latest SlashData Developer Nation survey found Rust to be the fastest-growing programming language, doubling its users over the past two years. As Rust's adoption continues to accelerate, the demand for a multifaceted ecosystem of quality training will too.\n \n\nTheir blog post highlights three examples of the Rust community \"creating new pathways for learning Rust\" and \"addressing the critical need for Rust training in academic settings...\"\n\n\nRust-Edu operates as a non-profit through Portland State University, with funding from Futurewei. Their mission is to \"spread Rust use and development through academic curricula and communities throughout the world, making Rust the language of choice for 'systems programming' in its broadest sense through shared efforts of faculty, students and the Rust community.\" They focus on three main areas: curriculum development, educational tools, and language improvements... \n\n\nteach-rs, pronounced \"teachers,\" is a modular and reusable university course designed for in-person teaching in Rust. Its mission is to introduce Rust in higher education and ensure that more students enter the job market with considerable Rust experience. The teach-rs project provides ready-to-use Rust teaching materials, including slide decks and exercises that can be adapted to various teaching contexts... As an open source permissively licensed project, teach-rs enables educators to share and improve resources, making introducing Rust instruction into their programs more accessible. Many institutions now use teach-rs in their courses, including the Slovak University of Technology, RustIEC (a collaboration between Vrije Universiteit Brussel and KU Leuven), and the University Politehnica of Bucharest. At the time of this writing, teach-rs has nearly 3000 stars on GitHub... \n\nUnder the guidance of The Rust Foundation's Global Rust Coordinator and Rust Nation UK's organizer Ernest Kissiedu, Mordecai Etukudo (Mart) has developed a guide to help educational institutions adopt Rust in their systems. This resource walks organizations through the entire implementation process, from initial assessment to community engagement.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=The+Rust+Foundation's+Plan+to+Grow+the+Pool+of+Well-Trained+Rust+Developers%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F05%2F2222220%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F05%2F2222220%2Fthe-rust-foundations-plan-to-grow-the-pool-of-well-trained-rust-developers%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://developers.slashdot.org/story/24/12/05/2222220/the-rust-foundations-plan-to-grow-the-pool-of-well-trained-rust-developers?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>",
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": ""
    },
    {
      "title": "Mozilla Announces 'JavaScriptmas' - Daily Coding Challenges with a Chance at Prizes",
      "url": "https://tech.slashdot.org/story/24/12/04/0138255/mozilla-announces-javascriptmas---daily-coding-challenges-with-a-chance-at-prizes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
      "date": 1733499240,
      "author": "EditorDavid",
      "unread": true,
      "desc": "",
      "content": "Mozilla's developer blog is announcing \"JavaScriptmas\".\n\n [F]rom December 1st to December 24th, we will release a fun, daily coding challenge for you to solve on [code-learning platform] Scrimba. Each challenge comes with an introductory screencast called \"scrim\", some starter code, and then it's your turn to fill in the gaps. \n\nJavaScriptmas is about coding, learning, and the chance to win exciting prizes. Two lucky coders will be chosen as winners at the end of JavaScriptmas, and each will win a MacBook Air M3, swag from MDN and Scrimba, and a lifetime Scrimba Pro membership (worth ~$200 per year). The Scrimba membership will give you access to all courses, including the Frontend Developer Career Path based on the MDN curriculum. \nMost of the challenges will evolve around JavaScript algorithms. You will also practice subjects like DOM manipulation, UI design, CSS, accessibility, and even a bit of cyber security. The challenges are a collaborative effort from Scrimba teachers, mentors, and MDN content writers, all with the goal of turning you into a more well-rounded web developer. \nWinners will be chosen randomly from everyone who submits correct solutions. We want JavaScriptmas to be accessible for both beginners and experienced developers alike. That said, the more challenges you solve, the better your chances of winning! To maximize your chances, try to solve all 24 challenges and submit them as both regular entries and social entries. You don't have to submit your solutions on the same day they're published &mdash; the deadline for any submission is midnight UTC on Christmas Eve.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Mozilla+Announces+'JavaScriptmas'+-+Daily+Coding+Challenges+with+a+Chance+at+Prizes%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F04%2F0138255%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F04%2F0138255%2Fmozilla-announces-javascriptmas---daily-coding-challenges-with-a-chance-at-prizes%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://tech.slashdot.org/story/24/12/04/0138255/mozilla-announces-javascriptmas---daily-coding-challenges-with-a-chance-at-prizes?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>",
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": ""
    }
  ]
}