{
  "id": "B69zEhWZA8UEAMn3PhHgwARc5WGncWEYFkmfHhvUDpmmwCTb86SBbpJu5kTKr3v5o6YroQ4JppktdusuZqEoEbsCggBQzkuKKLW771YC",
  "title": "code.talks (ehem. Developer Conference)",
  "displayTitle": "Podcast - CodeTalks",
  "url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfuj1MM5p37CRzWYPv_PsWA",
  "feedLink": "https://www.youtube.com/channel/UCfuj1MM5p37CRzWYPv_PsWA",
  "items": [
    {
      "title": "code.talks 2024 Aftermovie: The Greatest 2-Day Tech Conference in Germany",
      "url": "https://www.youtube.com/watch?v=IseasDZvieg",
      "date": 1730289606,
      "author": "code.talks (ehem. Developer Conference)",
      "unread": true,
      "desc": "",
      "content": "Already missing code.talks 2024? Don’t worry—the aftermovie will take you right back into the heart of the 12th edition of our developer conference!\nRelive the energy of our vibrant two-day event, which brought together over 3,000 developers and 130 speakers from around the globe at the stunning CCH in Hamburg. With more than 100 talks across 14 subject areas, we dove into the latest innovations and global tech trends—truly an edition for the books.\nFrom exchanging ideas and insights to networking with partners and dancing the night away at our legendary after-party, the atmosphere at code.talks 2024 was electric. Thank you for making it all possible; we couldn’t have done it without you. Check out the highlights and get inspired for the next edition!",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/IseasDZvieg?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Becoming an AI engineering company",
      "url": "https://www.youtube.com/watch?v=VfIGFiIPKrA",
      "date": 1732014006,
      "author": "code.talks (ehem. Developer Conference)",
      "unread": true,
      "desc": "",
      "content": "by Malte Ubl (CTO @ Vercel)\n\nAI represents the biggest disruption to software development since the release of the iPhone and maybe even the web itself. What makes the AI revolution unique is that it transforms how we write software, and what software we write, and that these dual disruptions compound: AI makes it easier to write software, and smarter AI models make it easier to use AI in software.\n\n\nYet beyond the initial excitement lies a deeper change to software development that requires us to step out of our comfort zone as legacy processes, rooted in specifications, and automated testing confront a world of non-determinism and free-form human computer interaction.\n\n\nIn this talk we’ll dive into Vercel’s own journey from being a traditional software company to becoming an AI company, and how you can apply some of the same lessons to your own business.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/VfIGFiIPKrA?version=3",
      "enclosureMime": ""
    },
    {
      "title": "What AI Can, Can’t, and Shouldn’t Do for Games",
      "url": "https://www.youtube.com/watch?v=20QzT_OeQ_8",
      "date": 1732020886,
      "author": "code.talks (ehem. Developer Conference)",
      "unread": true,
      "desc": "",
      "content": "by John Romero (Managing Director @ Romero Games)\n\nJohn Romero explores the evolving role of artificial intelligence in game development. He highlights AI's potential for enhancing gameplay, such as creating dynamic and responsive environments when its custom crafted by the team. However, he cautions against over-reliance on AI for creative decisions, emphasizing that human creativity and intuition remain irreplaceable. Romero also discusses ethical considerations, urging developers to use AI responsibly to avoid negative impacts on player experience and industry practices.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/20QzT_OeQ_8?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Security Kaizen for developers",
      "url": "https://www.youtube.com/watch?v=idoH57TA59M",
      "date": 1732020957,
      "author": "code.talks (ehem. Developer Conference)",
      "unread": true,
      "desc": "",
      "content": "by Dr. Melanie Rieback (CEO/Co-founder @ Radically Open Security)\n\nAs cyberattacks grow in number and sophistication, it is essential that\ndata is protected. With today’s evolving threat landscape, cybercrime is\ngrowing parallel to technological progress, and incorporating\nexponential algorithmic and computational advances.\n\nAward winning Cybersecurity expert and social entrepreneur Melanie Rieback, CEO of the\nworld's first not-for-profit cyber security company Radically Open\nSecurity, will explain what you need to know, and help you future-proof\nthe security of your systems and infrastructure. She will discuss how\nopen source methods, transparency and information sharing help to\nimprove security.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/idoH57TA59M?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Escaping the Build Trap",
      "url": "https://www.youtube.com/watch?v=gGiEM4toNig",
      "date": 1732021712,
      "author": "code.talks (ehem. Developer Conference)",
      "unread": true,
      "desc": "",
      "content": "by Melissa Perri (Board Member | CEO | CEO Advisor | Author | Product Management Expert | InstructorBio @ Product Institute)\n\nAre you building what your customers want, or are you just building? When successful companies first started out, they had to constantly deliver value to understand what their users wanted. This grew their business. Many large companies that have been around for decades, or even newer startups that have found some stability, fall into a dangerous place called “The Build Trap”. They continue building feature after feature, without stopping to validate it’s what customer truly want and need. This is due in part to poor understanding of Product Strategy, Product Management, and how to manage teams. In order to get out of “The Build Trap”, businesses need to restructure their thinking to focus on finding value for the user through experimentation to achieve business goals.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/gGiEM4toNig?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Most of the Time It Works Every Time: The Mindset Behind Using Probabilistic Data Structures",
      "url": "https://www.youtube.com/watch?v=daE6uhlFie8",
      "date": 1732022668,
      "author": "code.talks (ehem. Developer Conference)",
      "unread": true,
      "desc": "",
      "content": "by Prof. Wolfram Wingerath\n\nIf you are in the software industry, you likely know that one dev in the office who disregards good advice, keeps ignoring best practices, and – most annoyingly – still outperforms the rest of the team. But this kind of behavior shouldn't be that successful, right? Because after all, writing good software is about well-structured procedures and following protocol, right?! WRONG! In this presentation, we will talk about data structures that behave like THAT guy in the office. We will talk about the data structures that don't always do what you expect of them and get away with it more often than not. In this presentation, we will talk about probabilistic data structures.\n\n\nWe will start with skip lists that strike a perfect balance between linked lists and array lists in theory. But since maintaining the perfect skip list structure is infeasible in practice, we also explore how to structure imperfect skip lists that work \"well enough\" most of the time. To this end, we will compare basic coin flipping approaches with heuristic optimizations in a synoptic runtime analysis. We conclude the presentation with an overview of other probabilistic data structures like Bloom Filters and Count-Min Sketches, focusing on their probabilistic elements and providing practical examples of where and why they are used in applications.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/daE6uhlFie8?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Why HTMX is crushing React, Vue & Svelte",
      "url": "https://www.youtube.com/watch?v=-o5dn4ts4zM",
      "date": 1732023396,
      "author": "code.talks (ehem. Developer Conference)",
      "unread": true,
      "desc": "",
      "content": "by Benedikt Stemmildt\n\nImagine a world where frontend frameworks would have no dependency conflicts, no outdated libraries and no security issues. A world where the gap between frontend and backend is finally closed. Only one deployment is needed and only one service must run.\n\nA framework that lets you focus on HTML, with no boiler plate in between. No JSON & GraphQL, no serialization, no virtual DOM. Easy to understand and maintain - packed with much higher performance than any existing Javascript framework. And the best part? You have the freedom to choose your backend and preferred typed language.\n\nPresenting: HTMX, the new approach in writing web applications.\n\nIn this session, we'll show you how simple building an e-commerce shop can be. Using Kotlin, Spring Boot, and plain Tailwind, we'll demonstrate key features that make HTMX a revolutionary approach in writing web applications. Join us to see HTMX in action and explore its potential to transform your web development experience.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/-o5dn4ts4zM?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Reducing Cloud Costs: Practical Strategies and Lessons Learned",
      "url": "https://www.youtube.com/watch?v=jnOtWtfKlRo",
      "date": 1732026590,
      "author": "code.talks (ehem. Developer Conference)",
      "unread": true,
      "desc": "",
      "content": "by Claire Fautsch\n\nIn this talk, we will share our journey of significantly reducing cloud costs through practical strategies and optimizations. While our experience is rooted in Google Cloud Platform, most insights presented are applicable for various cloud providers\n\n\nKey topics covered will include:\n\nOptimizing Kubernetes resources by adjusting CPU and memory allocations and reducing unallocated resources.\n\nCommitted Use Discounts (CUDs)\n\nUsing cost-effective machine types\n\nNetwork traffic\n\n\nWe will also outline the potential risks and drawbacks encountered during these optimizations and highlight the importance of proactive alerting and monitoring.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/jnOtWtfKlRo?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Breaking Boundaries: A Journey Through Console Hacking History",
      "url": "https://www.youtube.com/watch?v=j4dikJPpm-Q",
      "date": 1732026678,
      "author": "code.talks (ehem. Developer Conference)",
      "unread": true,
      "desc": "",
      "content": "by Emanuel Schleussinger & Philipp Jablonski\n\nDive into the rich history of video game console hacking, from pioneering exploits on the Commodore C64 and Amiga to the latest Nintendo Switch or PlayStation hacks. Discover how floppy disk-based cartridge copiers revolutionized the Super Nintendo scene and how developers used NeoGeo Pocket linker cables to unlock the Dreamcast’s potential. This session will showcase pivotal techniques and tools that shaped the hacking & home-brew landscape. Join us to witness the evolution of console hacking, spanning decades of innovation and ingenuity.\n(After the event, in a live hackathon, where you’ll see some of these legendary exploits in action)",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/j4dikJPpm-Q?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Journey to Fullstack Mobile Game Development in Rust",
      "url": "https://www.youtube.com/watch?v=Xvpxa-U3KKw",
      "date": 1732026903,
      "author": "code.talks (ehem. Developer Conference)",
      "unread": true,
      "desc": "",
      "content": "by Stephan Dilly\n\nThis talk takes the audience on a journey of adopting Rust more and more in mobile games over the last 5 years. Starting with shy shared libraries wrapped up behind c interfaces used in a Go-backend and a C# frontend, over pure Rust Backends using Warp to now finally Fullstack Rust Mobile Games with the recently launched title Zoolitaire and TinyTakeoff.\n\n\nMobile game development was dominated by Unity and inherently C# for over a decade. The future lies with open-source technology and significant improvements in developer experience, productivity, and performance. This talk shows how Rust is ready for it today!",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/Xvpxa-U3KKw?version=3",
      "enclosureMime": ""
    },
    {
      "title": "From Chaos to Calm: Vulnerability Management for a Dynamic, Sprawling Technology Estate",
      "url": "https://www.youtube.com/watch?v=C4W73btdSTY",
      "date": 1732091514,
      "author": "code.talks (ehem. Developer Conference)",
      "unread": true,
      "desc": "",
      "content": "by Nazneen Rupawalla and Felix Hammerl\n\nIn this talk, we will dive into the challenges that scale and rate of change impose on our vulnerability management program and relive key decisions on our journey to building a robust, scalable, automated security framework that embraces a vast technology estate, autonomous teams, and competing priorities.\n\nIn our journey, we have learned what traditional vulnerability management gets wrong, the ineffectiveness of patching all CVEs, and how SLAs are counterproductive. We learned about alert fatigue and ownership in a DevOps world. We adopted a more nuanced view on actual security issues and gave teams visibility and autonomy in how to address them.\n\nWe will showcase the technologies underpinning this transformation and how we used serverless computing to make modern tools like Wiz, Shodan, and Tenable play nice with our technology estate.\n\nWe will end with a note on how offensive security helps us combat complacency.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/C4W73btdSTY?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Designing for data privacy",
      "url": "https://www.youtube.com/watch?v=TNUd8TOXiqI",
      "date": 1732193195,
      "author": "code.talks (ehem. Developer Conference)",
      "unread": true,
      "desc": "",
      "content": "by Christoph Hartmann\n\nGDPR poses significant challenges for system architecture, especially in microservice environments. When we started on this journey two years ago, our data was scattered across databases, documents, events, log messages, data warehouses, support tickets, and shared excels. Today, it is unique, secure, and fully auditable. In this talk, I will discuss how we transformed our platform by centralizing personal data in a secure vault and using tokens elsewhere. I'll cover our architectural decisions, the mindset shifts required, lessons learned, and how you can implement similar strategies without a complete rebuild.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/TNUd8TOXiqI?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Achieving Weekly Releases: A Technical Deep Dive into Our Development Process",
      "url": "https://www.youtube.com/watch?v=QmM-Z0HyPzE",
      "date": 1732271683,
      "author": "code.talks (ehem. Developer Conference)",
      "unread": true,
      "desc": "",
      "content": "by Mihri Minaz (Co-founder @ beams)\n\nAs a small team of six, we shipped 15 new versions of beams in 24 weeks, nearly one per week. We achieved this by gathering feedback from email, Slack, LinkedIn, our feature request page, and UI/UX research meetings to inform our roadmap. Prioritizing is crucial in a startup, balancing bugs, hot fixes, new features, and improvements, focusing on impactful tasks to keep core functionalities unblocked. We don't use sprints or endless backlogs; instead, we prefer brainstorming sessions, with developers crossing roles to prevent bottlenecks. Using Linear, our workflow moves tasks from Backlog to Done, ensuring tasks are well-defined before development, enabling rapid, iterative improvements and frequent releases.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/QmM-Z0HyPzE?version=3",
      "enclosureMime": ""
    }
  ]
}