{"id":"B69zEhWZA8UEAMn3PhHgwARc5WGncWEYFkmfHhvUDpmmwCTb86SBbpJu5kTKr3v5o6YroQ4JppnTPmKLxpU2tRhdtRTKSt57YWBdJkQg","title":"Closer To Truth","displayTitle":"Podcast - Closer to Truth","url":"https://www.youtube.com/feeds/videos.xml?channel_id=UCl9StMQ79LtEvlrskzjoYbQ","feedLink":"https://www.youtube.com/channel/UCl9StMQ79LtEvlrskzjoYbQ","items":[{"title":"Andrew Pinsent - The Big Bang and the Structure of Reality","url":"https://www.youtube.com/watch?v=SgwxxGoPH4c","date":1733331629,"author":"Closer To Truth","unread":true,"desc":"","content":"Donate to Closer To Truth this holiday season and help us keep our content free and without paywalls: https://shorturl.at/OnyRq\n\nHow do physicists and philosophers who believe in God harmonize the discoveries of cosmology with the doctrine of creation? How does cosmology enhance or erode their belief in God? If God exists, must the universe have had a beginning? Conversely, if the universe had a beginning, must God exist?\n\nFollow Closer To Truth on Instagram for news, announcements, and exciting updates: https://shorturl.at/p2IhM\n\nFr. Andrew Pinsent is professor of theology and philosophy at the Athenaeum of Ohio in Cincinnati, Ohio, and a Catholic priest of the Diocese of Arundel and Brighton in England. \n\nGet member exclusives like early access to new content with a free Closer To Truth account: https://closertotruth.com/\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/SgwxxGoPH4c?version=3","enclosureMime":""},{"title":"Paul Griffiths - Why Philosophy of Biology?","url":"https://www.youtube.com/watch?v=AiU62nzdb58","date":1733414407,"author":"Closer To Truth","unread":true,"desc":"","content":"Subscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nExplore the process of science with the content of biology. Life’s nature and structure. Evolution’s challenges. Examine race, sex and gender, cognition, culture, morality, religion, alien life, and more.\n\nMake a donation to Closer To Truth to help us continue exploring the world's deepest questions without the need for paywalls: https://shorturl.at/OnyRq\n\nPaul Griffiths is Professor of Philosophy at the University of Sydney and works primarily in the Philosophy of Science and more particularly Philosophy of Biology.\n\nShow your support for the show (and snag a great holiday gift) with a Closer To Truth merch purchase: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/AiU62nzdb58?version=3","enclosureMime":""},{"title":"Subhash Kak - Alternative Concepts of God?","url":"https://www.youtube.com/watch?v=pZRhUNronDE","date":1733500844,"author":"Closer To Truth","unread":true,"desc":"","content":"Are you a Closer to Truth member? Register for a free account to receive special exclusives today: https://closertotruth.com/.\n\nIs God, if there is a God, a personal, conscious, all-powerful Supreme Being? Some offer radically different concepts of ‘God’, exploring novel ideas of what God may be like. They challenge theism—the God of Judaism, Christianity and Islam—with radically new kinds of gods. Is this ‘heresy’? Or enlarging our vision of what the Ultimate can be like?\n\nSupport the show with a donation of any amount to help Closer To Truth continue exploring life's deepest questions: shorturl.at/OnyRq\n\nSubhash Kak is an Indian-American computer scientist and historical revisionist. He is the Regents Professor of Computer Science Department at Oklahoma State University–Stillwater, an honorary visiting professor of engineering at Jawaharlal Nehru University, and a member of the Indian Prime Minister's Science, Technology and Innovation Advisory Council (PM-STIAC).\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/pZRhUNronDE?version=3","enclosureMime":""},{"title":"Neil Theise - Should Science Even Talk to Religion?","url":"https://www.youtube.com/watch?v=s1p1QGUCpRo","date":1733515233,"author":"Closer To Truth","unread":true,"desc":"","content":"Like us on Facebook for daily videos, announcements, and more: https://shorturl.at/JkgVs\n\nTo do good science, science need not speak with religion. Many scientists, even believers in God, state that science can comfortably ignore religion. A minority claim that the revelations of religion can help adjudicate knotty problems in science, such as the nature of time. But does any reality really exist beyond the expanding reach of science?\n\nDo you have a Closer to Truth membership? Register for a free account to receive special exclusives today: https://closertotruth.com/.\n\nNeil Theise is a professor of pathology at the NYU Grossman School of Medicine. Through his scientific research, he has been a pioneer of adult stem cell plasticity and the anatomy of the human interstitium. He is also a longtime student of Zen Buddhism. Dr. Theise's studies in complexity theory have led to interdisciplinary collaborations in fields such as integrative medicine, consciousness studies, and the science-religion dialogue.\n\nSupport the show with a donation of any amount to help Closer To Truth continue exploring life's deepest questions: shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/s1p1QGUCpRo?version=3","enclosureMime":""},{"title":"Ian McFarland - What is Human Mind?","url":"https://www.youtube.com/watch?v=uPlTC8yOGKM","date":1733587251,"author":"Closer To Truth","unread":true,"desc":"","content":"Get special exclusives and discounts with a free Closer To Truth membership today: https://closertotruth.com/.\n\nThe nature of human mind and consciousness is one of the perennial, deep questions in philosophy. Assuming that God exists, what happens to the question? In a God-created world, what would human mind be?\n\nSupport Closer To Truth with a tax-deductible donation of any amount: https://shorturl.at/OnyRq\n\nIan Alexander McFarland is an American Lutheran theologian and has since 2019 served as Robert W. Woodruff Professor of Theology at Emory University's Candler School of Theology, where he also taught from 2005 to 2015. From 2015 to 2019 he was the Regius Professor of Divinity at the University of Cambridge. He holds degrees from Trinity College (Hartford), Union Theological Seminary (New York), the Lutheran School of Theology at Chicago, the University of Cambridge, and Yale University.\n\nFollow us on X for announcements, news, updates, and more: https://x.com/CloserToTruth\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/uPlTC8yOGKM?version=3","enclosureMime":""},{"title":"Tom McLeish - Critical Realism in Science and Theology","url":"https://www.youtube.com/watch?v=cqbM726QwbA","date":1733673628,"author":"Closer To Truth","unread":true,"desc":"","content":"Shop our merch and get a unique holiday gift for everyone on your list: https://bit.ly/3P2ogje\n\nDoes what we discover in science reflect what really exists in the world? Can science access external, independent, ultimate reality? “Realists” say Yes; “anti-realists”, No. Can we discern the ultimate reach of human knowledge? Clearly in science, but also, potentially, in theology. That’s what “critical realism” attempts to do.\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nTom McLeish was Emeritus Professor of Natural Philosophy at the University of York. Elected Fellow of the Royal Society in 2011, he chaired its Education Committee. He was also a Senior Associate of Pembroke College, Oxford, and a former fellow of Emmanuel College Cambridge.\n\nMake a donation of any amount to help support Closer To Truth: https://shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/cqbM726QwbA?version=3","enclosureMime":""},{"title":"Aging: Body and Mind","url":"https://www.youtube.com/watch?v=3upW9K9Zvvg","date":1733749206,"author":"Closer To Truth","unread":true,"desc":"","content":"Biologist Denis Noble discusses aging, preventative healthcare, and self preservation #shorts","flags":null,"enclosureUrl":"https://www.youtube.com/v/3upW9K9Zvvg?version=3","enclosureMime":""},{"title":"Alan Torrance - How Does Atonement Work?","url":"https://www.youtube.com/watch?v=XFlQip9C4NI","date":1733760025,"author":"Closer To Truth","unread":true,"desc":"","content":"Love the show? Make a donation of any amount to help support Closer To Truth: https://shorturl.at/OnyRq\n\nChristians are accustomed to hearing that “Jesus died for our sins”. But what would that mean literally? How would atonement work? What would be happening? Is there a process, a sequence of logical steps? One need not be a Christian to appreciate the philosophical obstacles.\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nAlan Torrance is professor of systematic theology at St. Mary's College of the University of St Andrews. Previously he lectured at King's College London, where he was also Director of the Research Institute in Systematic Theology. During this time he served as Senior Research Fellow at the Erasmus Institute, University of Notre Dame. He previously lectured at Knox Theological Hall and the University of Otago in New Zealand.\n\nShop Closer To Truth merch for unique holiday gifts like notebooks, mugs, and apparel: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/XFlQip9C4NI?version=3","enclosureMime":""},{"title":"Elliott Sober - Philosophy of Medicine & Healthcare","url":"https://www.youtube.com/watch?v=6_5-9nVswhU","date":1733846410,"author":"Closer To Truth","unread":true,"desc":"","content":"This holiday season, support Closer To Truth with a tax-deductible donation of any amount: https://shorturl.at/OnyRq\n\nCan philosophy contribute to medicine and healthcare? For example, philosophy can help clarify the concept of cancer, its nature, kinds and variations. Philosophy can also help discern different levels or qualities of healthcare for different groups.\n\nAre you a Closer To Truth member? Register for a free account to get special exclusives and discounts at https://closertotruth.com/.\n\nElliott R. Sober is Hans Reichenbach Professor and William F. Vilas Research Professor Emeritus in the Department of Philosophy at University of Wisconsin–Madison.\n\nFollow Closer To Truth on X for articles, videos, updates, and more: https://x.com/CloserToTruth\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/6_5-9nVswhU?version=3","enclosureMime":""},{"title":"John Bishop - Why Believe in God?","url":"https://www.youtube.com/watch?v=JhQIwYYvcSI","date":1733932819,"author":"Closer To Truth","unread":true,"desc":"","content":"Follow Closer To Truth on Instagram for news, announcements, and exciting updates: https://shorturl.at/p2IhM\n\nThis is personal. ‘Why believe in God’ can mean two things: ‘What are the possible benefits of believing in God?’ and ‘what are the possible reasons justifying a belief in God?’ The two are not the same, though they could interact. Why should I want to believe in God? Is belief a circular path of self-deception? Or the shortest route to bedrock reality?\n\nDonate to Closer To Truth this holiday season and help us keep our content free and without paywalls: https://shorturl.at/OnyRq\n\nJohn Bishop is a Professor of Philosophy at the University of Auckland in New Zealand. He hodls a BA from the Australian National Unviersity and a PhD from Cambridge.\n\nGet member exclusives like early access to new content with a free Closer To Truth account: https://closertotruth.com/\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/JhQIwYYvcSI?version=3","enclosureMime":""},{"title":"Joshua Swamidass - Philosophy of Transhumanism & Artificial Intelligence (AI)","url":"https://www.youtube.com/watch?v=BKfWQDzsFHU","date":1733947208,"author":"Closer To Truth","unread":true,"desc":"","content":"Subscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nHumanity’s future is now framed by artificial intelligence (AI) and increasing interventions in the human body to cure and to enhance, i.e., transhumanism. Considering the stakes, and the dangers, a philosophical perspective is imperative.\n\nMake a donation to Closer To Truth to help us continue exploring the world's deepest questions without the need for paywalls: https://shorturl.at/OnyRq\n\nS. Joshua Swamidass is a computational biologist, physician, academic, and author. He is an associate professor of Laboratory and Genomic Medicine, and a Faculty Lead of Translational Bioinformatics in the Institute for Informatics at Washington University in St. Louis.\n\nShow your support for the show (and snag a great holiday gift) with a Closer To Truth merch purchase: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/BKfWQDzsFHU?version=3","enclosureMime":""},{"title":"Andrew Briggs - Why Are Science and Theology so Fascinating?","url":"https://www.youtube.com/watch?v=tn6pUIcOh_w","date":1734019256,"author":"Closer To Truth","unread":true,"desc":"","content":"Register for a Closer To Truth membership to receive special exclusives like early access to new episodes and more: https://closertotruth.com/.\n\nScience and theology both reach for the heavens. Both seek the deep truths of existence and human life. Scientific facts, once demonstrated, are recognized widely as correct, but science may be limited in its scope. Theology makes grand pronouncements, but how can theological claims be verified independently?\n\nSupport the show with a donation of any amount to help Closer To Truth continue exploring life's deepest questions: shorturl.at/OnyRq\n\nGeorge Andrew Davidson Briggs is a British scientist. He is Professor of Nanomaterials in the Department of Materials at the University of Oxford. He is best known for his early work in acoustic microscopy and his current work in materials for quantum technologies.\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/tn6pUIcOh_w?version=3","enclosureMime":""},{"title":"Derek Turner - Philosophy of Sex, Sexuality, and Gender","url":"https://www.youtube.com/watch?v=Y56h_OguGa8","date":1734105634,"author":"Closer To Truth","unread":true,"desc":"","content":"Like us on Facebook for daily videos, announcements, and more: https://shorturl.at/JkgVs\n\nSexual questions abound. What is “normal” sexual behavior vs. multiple variations? How to appreciate LGBTQ+ issues? What can be learned from sex in animal models that is relevant for human sexuality? A philosophical perspective can provide clarity.\n\nAre you a Closer to Truth member? Register for a free account today to receive special exclusives: https://closertotruth.com/.\n\nDerek Turner teaches philosophy at Connecticut College where he is also the Karla Heurich Harrison ’28 Director of the Goodwin-Niering Center for the Environment.\n\nSupport the show with a donation of any amount to help Closer To Truth continue exploring life's deepest questions: shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/Y56h_OguGa8?version=3","enclosureMime":""},{"title":"Oliver Crisp - Can the Bible Address Philosophical Questions?","url":"https://www.youtube.com/watch?v=15bwMxmzKO0","date":1734192000,"author":"Closer To Truth","unread":true,"desc":"","content":"Get special exclusives and discounts with a free Closer To Truth membership today: https://closertotruth.com/.\n\nPhilosophy of religion poses numerous questions about God: “proof” or “disproofs” of existence, nature and attributes, personhood, relation to time, relation to humankind — it’s a long list. In Judeo-Christian religions, the ultimate authority is supposed to be the Bible. But the Bible seems radically different from philosophy of religion.\n\nSupport Closer To Truth with a tax-deductible donation of any amount: https://shorturl.at/OnyRq\n\nOliver D. Crisp is a British theologian who currently works as Professor of Analytic Theology at the University of St Andrews, and was formerly a professor of systematic theology at Fuller Theological Seminary in Pasadena, California.\n\nFollow us on X for announcements, news, updates, and more: https://x.com/CloserToTruth\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/15bwMxmzKO0?version=3","enclosureMime":""},{"title":"David Hunt - What is Perfect Being Theology?","url":"https://www.youtube.com/watch?v=uPvkBxNkefE","date":1734278446,"author":"Closer To Truth","unread":true,"desc":"","content":"Shop our merch and get a unique holiday gift for everyone on your list: https://bit.ly/3P2ogje\n\nA perfect being, as defined by philosophically motivated theologians, is “that which no greater can be conceived”. What does this mean? Is this coherent? Is conceivability different from possibility? What would a ‘perfect being’ be like? What capabilities? What traits? Is there only one way to be ‘perfect’?\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nDavid Hunt was a Professor and Department Chair of the Department of Philosophy at Whittier College in Whittier, CA. He earned a BA from Pomona College and a PhD from Vanderbilt University. His academic interests included Ancient and Early Medieval Philosophy (especially Plato, Plotinus, and Augustine), Metaphysics, Action Theory, and the Philosophy of Religion.\n\nMake a donation of any amount to help support Closer To Truth reach new audiences and continue exploring deep questions: https://shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/uPvkBxNkefE?version=3","enclosureMime":""}]}