{
  "id": "B69zEhWZA8UEAMn3PhHgwARc5WGncWEYFkmfHhvUDpmmwCTb86SBbpJu5kTKr3v5o6YroQ4JppnTPmKLxpU2tRhdtRTKSt57YWBdJkQg",
  "title": "Closer To Truth",
  "displayTitle": "Podcast - Closer to Truth",
  "url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCl9StMQ79LtEvlrskzjoYbQ",
  "feedLink": "https://www.youtube.com/channel/UCl9StMQ79LtEvlrskzjoYbQ",
  "items": [
    {
      "title": "Is free will an illusion?",
      "url": "https://www.youtube.com/watch?v=J2MT0IMk0Yw",
      "date": 1732629617,
      "author": "Closer To Truth",
      "unread": true,
      "desc": "",
      "content": "Astrobiologist and theoretical physicist Sara Imari Walker discusses free will as a real physical property. Watch the full interview on our YouTube channel here: https://t.ly/JsjtY #shorts",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/J2MT0IMk0Yw?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Peter Forrest - Pantheism: Is God All Reality?",
      "url": "https://www.youtube.com/watch?v=giOgBa8bz3Y",
      "date": 1732636839,
      "author": "Closer To Truth",
      "unread": true,
      "desc": "",
      "content": "Make a tax-deductible donation to support Closer To Truth's mission of exploring the world's deepest questions around the globe: https://shorturl.at/OnyRq\n\nIs our search for God too narrow? Why do some philosophers espouse ‘pantheism’? Pantheism’s claim is not shy: God is the Cosmos and the Cosmos is God. But does re-naming all-that-exists ‘God’ add understanding? Can the new name make the world ‘sacred’? What is gained, and what is lost, if a theist becomes a pantheist?\n\nGet special exclusives and discounts with a free Closer To Truth membership today: https://closertotruth.com/.\n\nPeter Forrest teaches the areas of Epistemology and Metaphysics at the University of New England. He works in the area of the philosophy of physics, epistemology, the philosophy of religion, and other issues in metaphysics and epistemology.\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/giOgBa8bz3Y?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Walter Sinnott-Armstrong - Neuroscience and the Human Mind",
      "url": "https://www.youtube.com/watch?v=SreQQfXWHaI",
      "date": 1732723232,
      "author": "Closer To Truth",
      "unread": true,
      "desc": "",
      "content": "Donate to Closer To Truth and help us keep our content free and without paywalls: https://shorturl.at/OnyRq\n\nSociety is composed of human minds working collectively. By appreciating consciousness can we understand society better? Conversely, by appreciating society can we understand consciousness better? What’s the relationship between society and consciousness? Can we have either without the other? Or are they inextricably bound together?\n\nFollow Closer To Truth on Instagram for news, announcements, and exciting updates: https://shorturl.at/p2IhM\n\nWalter Sinnott-Armstrong is an American philosopher specializing in ethics, epistemology, neuroethics, the philosophy of law, and the philosophy of cognitive science. He is the Chauncey Stillman Professor of Practical Ethics in the Department of Philosophy and the Kenan Institute for Ethics at Duke University.\n\nGet member exclusives like early access to new content with a free Closer To Truth account: https://closertotruth.com/\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/SreQQfXWHaI?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Huston Smith - What is God Like?",
      "url": "https://www.youtube.com/watch?v=-jTf_aXkcQE",
      "date": 1732737601,
      "author": "Closer To Truth",
      "unread": true,
      "desc": "",
      "content": "Are you a Closer to Truth member? Register for a free account to receive special exclusives today: https://closertotruth.com/.\n\nWhat can we know about God? The easy answer is ‘nothing’: God is not like anything. Finite humans cannot know an infinite God. But that’s not good enough. If there is a God, God must have traits, attributes, characteristics. More deeply, God should have an ‘essence’, a nature. We must be able to say something about God. At least we must try.\n\nSupport the show with a donation of any amount to help Closer To Truth continue exploring life's deepest questions: shorturl.at/OnyRq\n\nHuston Cummings Smith was a scholar of religious studies in the United States, He authored at least thirteen books on world's religions and philosophy, and his book about comparative religion, The World's Religions sold over three million copies as of 2017.\n\nFollow us on X for daily news, announcements, and more: https://x.com/CloserToTruth\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/-jTf_aXkcQE?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Anjan Chatterjee - Can Neuroscience Help Us Understand Art?",
      "url": "https://www.youtube.com/watch?v=X6v7Of3t5P4",
      "date": 1732809629,
      "author": "Closer To Truth",
      "unread": true,
      "desc": "",
      "content": "Use code THANKSCTT to get 20% off Closer To Truth merch: https://bit.ly/3P2ogje\n\nMake a donation to Closer To Truth to help us continue exploring the world's deepest questions without the need for paywalls: https://shorturl.at/OnyRq\n\nWhat is the nature of art? What makes something “art”, and why should we value it? What are aesthetics and art theory? How is the philosophy of art (or aesthetics) relevant to the study, appreciation, and practice of the arts?\n\nFollow us on X for announcements, news, updates, and more: https://x.com/CloserToTruth\n\nAnjan Chatterjee is a professor of neurology, psychology, and architecture at the University of Pennsylvania.\n\nGet special exclusives and discounts with a free Closer To Truth membership today: https://closertotruth.com/.\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/X6v7Of3t5P4?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Elizabeth Loftus - Can Our Memories be Manipulated?",
      "url": "https://www.youtube.com/watch?v=xSe6q6pyxMM",
      "date": 1732896056,
      "author": "Closer To Truth",
      "unread": true,
      "desc": "",
      "content": "Subscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nWhy do people believe the things they do? We like to think that we are rational, that what we believe is true. But often we come to our beliefs, unknowingly, as a product of our particular ‘belief systems’. How do belief systems work their credulous magic? What principles enable belief systems to influence individuals and commandeer groups?\n\nFollow Closer To Truth on Instagram for news, event discounts, and exciting updates: https://www.instagram.com/closertotruth/\n\nElizabeth F. Loftus is an American psychologist who is best known in relation to the misinformation effect, false memory and criticism of recovered memory therapies.\n\nSupport Closer To Truth with a tax-deductible donation of any amount: https://shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/xSe6q6pyxMM?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Michael Almeida - Is This the Best of All Possible Worlds?",
      "url": "https://www.youtube.com/watch?v=jXDrHcGd_Jc",
      "date": 1732982438,
      "author": "Closer To Truth",
      "unread": true,
      "desc": "",
      "content": "Like us on Facebook for daily videos, announcements, and more: https://www.facebook.com/CloserToTruthTV\n\nIs this a joke? Our world, with its vast evils, the ‘best possible world’? It seems absurd. Yet some do claim that ultimately our world will be the best possible world, because the sum total of all the good, primarily generated by human free will and divine providence, will overpower all the obvious evils. Perhaps the calculus should include the entire cosmos?\n\nDo you have a Closer to Truth membership? Register for a free account to receive special exclusives today: https://closertotruth.com/.\n\nMike Almeida is Professor of Philosophy and chair of the Department of Philosophy and Classics at the University of Texas at San Antonio.\n\nSupport the show with a donation of any amount to help Closer To Truth continue exploring life's deepest questions: shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/jXDrHcGd_Jc?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Richard Dawkins - Evolution, Inheritance, and Biology",
      "url": "https://www.youtube.com/watch?v=g_Vz2qR4b40",
      "date": 1733068836,
      "author": "Closer To Truth",
      "unread": true,
      "desc": "",
      "content": "Giving Tuesday is this week! Make a donation of any amount to help support Closer To Truth: https://shorturl.at/OnyRq\n\nWhat is the extended evolutionary synthesis (EES) and why better? Includes multilevel selection, transgenerational epigenetic inheritance, niche construction, evolvability, and ideas from evolutionary developmental biology. Why is EES controversial?\n\nGet exclusive member benefits—like early access to new episodes—with a free Closer To Truth account: https://closertotruth.com/register.\n\nMake a donation to Closer To Truth to help us continue exploring the world's deepest questions without the need for paywalls: https://shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/g_Vz2qR4b40?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Is Life After Death Possible?",
      "url": "https://www.youtube.com/watch?v=NJHXxpC9zfg",
      "date": 1733148024,
      "author": "Closer To Truth",
      "unread": true,
      "desc": "",
      "content": "Does everything about a person disappear at death? The body? Sure, it's gone. The brain? It stops working, then dissolves. But what about awareness? Does our consciousness end forever? Nothing could be more frightening! Is there any hope? Are there ways that, conceivably, our consciousness can survive the ultimate insult?\n\nWatch our full interview with Sam Parnia here: https://t.ly/DZlGS #shorts",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/NJHXxpC9zfg?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Nancey Murphy - What Gives Us Personal Identity?",
      "url": "https://www.youtube.com/watch?v=BE-FAt7lB7U",
      "date": 1733155211,
      "author": "Closer To Truth",
      "unread": true,
      "desc": "",
      "content": "Get 20% off your Closer To Truth merch purchase with code THANKSCTT at checkout: https://bit.ly/3P2ogje\n\nWhat makes one a person or a self? If he or she sees, hears, thinks and feels, is that a person or a self? How can separate perceptions bind together into a coherent mental unity of a single person or self? And how does personhood or self persist through time? If persons are all material, what enables the continuity? Is there a ‘carrier’ of personal identity?\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nMake a donation of any amount to help support Closer To Truth: https://shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/BE-FAt7lB7U?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Your Gift Means the World",
      "url": "https://www.youtube.com/watch?v=QFLmJqn5tlY",
      "date": 1733241630,
      "author": "Closer To Truth",
      "unread": true,
      "desc": "",
      "content": "For over 20 years, Closer To Truth has explored humanity’s deepest questions in the fields of cosmos, life, mind, and meaning. \n\nBut there’s a new question we need to explore: What comes next? \n\nCloser to Truth has just launched our first-ever donation platform. Every tax-deductible donation—big or small—helps us share fresh, transformative perspectives on questions that have shaped human thought for millennia.\n\nWe want to continue breaking new ground and conducting interviews with top thinkers and scientists who do the same.\n\nGive what you can today: https://shorturl.at/nzbqn\n\nThank you.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/QFLmJqn5tlY?version=3",
      "enclosureMime": ""
    },
    {
      "title": "E. Thomas Lawson - Art and Cognitive Science",
      "url": "https://www.youtube.com/watch?v=bhVToAW1zFw",
      "date": 1733241636,
      "author": "Closer To Truth",
      "unread": true,
      "desc": "",
      "content": "Today is #givingtuesday — support Closer To Truth with a tax-deductible donation of any amount: https://shorturl.at/OnyRq\n\nMake a donation to Closer To Truth to help us continue exploring the world's deepest questions without the need for paywalls: https://shorturl.at/OnyRq\n\nAesthetic Cognitivism is a theory about the arts as sources of understanding. What are the scholarly or scientific fields that form its foundation? Explore art’s relationship with cognitive science, philosophy, neuroscience, history, theology and religion.\n\nAre you a Closer To Truth member? Register for a free account to get special exclusives and discounts at https://closertotruth.com/.\n\nErnest Thomas Lawson is an honorary professor at the Institute of Cognition and Culture at Queen’s University Belfast. He is the executive editor of the Journal of Cognition and Culture and co-founder of the North American Association for the Study of Religion. He is a founding member and has served as the first President of the International Association for the Cognitive Science of Religion.\n\nFollow Closer To Truth on X for articles, videos, updates, and more: https://x.com/CloserToTruth\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/bhVToAW1zFw?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Support Closer to Truth This Giving Tuesday",
      "url": "https://www.youtube.com/watch?v=kQZCW9PLTAs",
      "date": 1733242881,
      "author": "Closer To Truth",
      "unread": true,
      "desc": "",
      "content": "Today, on Giving Tuesday, you have the power to shape the future of knowledge. \n\nOur mission at Closer to Truth has remained the same: to bring the world’s greatest minds together to explore the biggest questions about existence, consciousness, reality, and more.\n\nBut we need your help to reach even more people with these critical conversations.\n\nMake a tax deductible donation to help us expand our global reach, produce fresh, new content, and explore uncharted questions\n\nTogether we can explore the mysteries of life and our universe. Be a part of something bigger. \n\n#givingtuesday #givingtuesday2024 #mightycause #philosophical #philosopher #physicist #bigquestions #ultimatequestions #thinkingbig #outerspace #cosmos #existence",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/kQZCW9PLTAs?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Andrew Pinsent - The Big Bang and the Structure of Reality",
      "url": "https://www.youtube.com/watch?v=SgwxxGoPH4c",
      "date": 1733331629,
      "author": "Closer To Truth",
      "unread": true,
      "desc": "",
      "content": "Donate to Closer To Truth this holiday season and help us keep our content free and without paywalls: https://shorturl.at/OnyRq\n\nHow do physicists and philosophers who believe in God harmonize the discoveries of cosmology with the doctrine of creation? How does cosmology enhance or erode their belief in God? If God exists, must the universe have had a beginning? Conversely, if the universe had a beginning, must God exist?\n\nFollow Closer To Truth on Instagram for news, announcements, and exciting updates: https://shorturl.at/p2IhM\n\nFr. Andrew Pinsent is professor of theology and philosophy at the Athenaeum of Ohio in Cincinnati, Ohio, and a Catholic priest of the Diocese of Arundel and Brighton in England. \n\nGet member exclusives like early access to new content with a free Closer To Truth account: https://closertotruth.com/\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/SgwxxGoPH4c?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Paul Griffiths - Why Philosophy of Biology?",
      "url": "https://www.youtube.com/watch?v=AiU62nzdb58",
      "date": 1733414407,
      "author": "Closer To Truth",
      "unread": true,
      "desc": "",
      "content": "Subscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nExplore the process of science with the content of biology. Life’s nature and structure. Evolution’s challenges. Examine race, sex and gender, cognition, culture, morality, religion, alien life, and more.\n\nMake a donation to Closer To Truth to help us continue exploring the world's deepest questions without the need for paywalls: https://shorturl.at/OnyRq\n\nPaul Griffiths is Professor of Philosophy at the University of Sydney and works primarily in the Philosophy of Science and more particularly Philosophy of Biology.\n\nShow your support for the show (and snag a great holiday gift) with a Closer To Truth merch purchase: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/AiU62nzdb58?version=3",
      "enclosureMime": ""
    }
  ]
}