{"id":"B69zEhWZA8UEAMn3PhHgwARc5WGncWEYFkmfHhvUDpmmwCTb86SBbpJu5kTKr3v5o6YroQ4JppdVoDHLN4yWZAVi5Siw4M8AuwbDYBxU","title":"The Wall Street Journal","displayTitle":"News - Wall Street Journal","url":"https://www.youtube.com/feeds/videos.xml?channel_id=UCK7tptUDHh-RYDsdxO1-5QQ","feedLink":"https://www.youtube.com/channel/UCK7tptUDHh-RYDsdxO1-5QQ","items":[{"title":"Ukraine’s First-Ever ATACMS Strike in Russia, Explained | WSJ","url":"https://www.youtube.com/watch?v=teeYFzdsQYU","date":1732039152,"author":"The Wall Street Journal","unread":true,"desc":"","content":"Ukraine fired long-range U.S. missiles inside Russia for the first time despite Moscow’s threats of retaliation. The attack hit an ammunition storage facility near the Russian city of Karachev and is the first such assault to use long-range, NATO-made arms. \n\nWSJ’s Alistair MacDonald explains why the Kremlin sees this as a major escalation.\n\nChapters:\n0:00 Ukraine fired long-range missiles into Russia\n0:45 ATACMS and Storm Shadow\n2:28 New targets and logistics\n3:57 What’s next?\n\nRussia-Ukraine Conflict\nWSJ’s latest news coverage around the 2022-2024 Russia-Ukraine conflict.\n\n#Ukraine #Russia #WSJ","flags":null,"enclosureUrl":"https://www.youtube.com/v/teeYFzdsQYU?version=3","enclosureMime":""},{"title":"Why So Many TGI Friday Restaurants Are Closing | WSJ What Went Wrong","url":"https://www.youtube.com/watch?v=z9PgTO9MxYY","date":1732114870,"author":"The Wall Street Journal","unread":true,"desc":"","content":"TGI Fridays, widely considered the first singles bar in the U.S., filed for Chapter 11 bankruptcy in November, citing a problematic capital structure and fallout from the pandemic. The fast-casual restaurant chain has closed over 200 locations across the U.S. since 2019 and have even been kicked out of its headquarters in Dallas.\n\nWSJ breaks down how the once happy hour hot spot lost its flair.\n\nChapters:\n0:00 TGI Fridays filed for bankruptcy\n0:35 The rise \n2:01 Turning point\n4:24 The downfall\n5:33 What’s next for franchisees?\n\nWhat Went Wrong explores the challenging conditions and decisions that led to a company's downturn.\n\n#TGIFridays #Food #WSJ","flags":null,"enclosureUrl":"https://www.youtube.com/v/z9PgTO9MxYY?version=3","enclosureMime":""},{"title":"How Airline Frequent Flier Programs Have Evolved","url":"https://www.youtube.com/watch?v=R7ojXlE2SMo","date":1732204831,"author":"The Wall Street Journal","unread":true,"desc":"","content":"American Airlines created the first major airline loyalty program in 1981 as a way to compete for customers post-deregulation. But today these programs are the industry norm, having transformed into billions of dollar businesses with legs outside the aviation industry. The AAdvantage loyalty program has even become a business in its own right with airlines selling miles to banks, and was followed by similar programs with United, Delta, Southwest, and more. \n\nWSJ breaks down how American Airlines created the program that changed the way the world flies.\n\n#Airlines #Travel #Shorts","flags":null,"enclosureUrl":"https://www.youtube.com/v/R7ojXlE2SMo?version=3","enclosureMime":""},{"title":"What Trump Can and Can’t Do on Day One | WSJ","url":"https://www.youtube.com/watch?v=7GsvtOKswvY","date":1732293625,"author":"The Wall Street Journal","unread":true,"desc":"","content":"President-elect Donald Trump has a long list of policy objectives that he wants to implement quickly including border policy for immigration, closing the Department of Education, implementing tariffs and more. For most of Trump’s objectives for his second term, there are limitations including checks and balances within the process or limitations directly from Congress.\n\nWSJ explains which of these plans he can carry out on his own, which he’ll need help from Congress for, and what might end up in the courts.  \n\nChapters:\n0:00 Trump’s second term\n0:38 Immigration\n2:23 Military\n3:06 Education\n4:34 Energy\n5:32 Tariffs\n6:48 Checks and balances\n\nNews Explainers\nSome days the high-speed news cycle can bring more questions than answers. WSJ’s news explainers break down the day's biggest stories into bite-size pieces to help you make sense of the news.\n\n#Trump #Politics #WSJ","flags":null,"enclosureUrl":"https://www.youtube.com/v/7GsvtOKswvY?version=3","enclosureMime":""},{"title":"How Much Control Will Trump Actually Have Over Inflation? | WSJ","url":"https://www.youtube.com/watch?v=CJgQUqlNejk","date":1732546811,"author":"The Wall Street Journal","unread":true,"desc":"","content":"President-elect Donald Trump vowed on the campaign trail to lower inflation. About half of Trump voters said higher prices were the largest factor in their decision, according to AP VoteCast. But the Federal Reserve is independent and uses interest rates to encourage or discourage borrowing money, which leads to more or less spending. So how much control does the president actually have over inflation?\n\nWSJ asked a former Federal Reserve vice chair to break down the inflation-fighting tools Trump will have at his disposal.\n\nChapters:\n0:00 Trump wants to lower inflation\n0:31 What can affect inflation\n2:35 What a president can do about inflation\n3:25 Where Trump stands \n\nNews Explainers\nSome days the high-speed news cycle can bring more questions than answers. WSJ’s news explainers break down the day's biggest stories into bite-size pieces to help you make sense of the news.\n\n#Trump #Inflation #WSJ","flags":null,"enclosureUrl":"https://www.youtube.com/v/CJgQUqlNejk?version=3","enclosureMime":""},{"title":"How India’s New Nuclear Submarine Base Challenges China’s Naval Plans | WSJ","url":"https://www.youtube.com/watch?v=LS9MXoaE5cs","date":1732633220,"author":"The Wall Street Journal","unread":true,"desc":"","content":"Modi's India is building a new base for nuclear-armed submarines in the Bay of Bengal called INS Varsha in a bid to curb China’s naval footprint growing in India’s backyard. The Bay of Bengal is a critical shipping lane and some China experts believe the waterway could play a key role in any conflict over Taiwan or the South China Sea. \n\nWSJ examined satellite images to see how INS Varsha has expanded and explores how this project is forming the backbone of New Delhi’s plans to keep Beijing’s ambitions in the region in check. \n\nChapters:\n0:00 India’s new military base\n0:31 Bay of Bengal\n1:21 China’s presence in the bay\n2:44 INS Varsha \n3:46 India’s nuclear submarines\n\nNews Explainers\nSome days the high-speed news cycle can bring more questions than answers. WSJ’s news explainers break down the day's biggest stories into bite-size pieces to help you make sense of the news.\n\n#India #China #WSJ","flags":null,"enclosureUrl":"https://www.youtube.com/v/LS9MXoaE5cs?version=3","enclosureMime":""},{"title":"What Trump’s Dismantling of the Education Department Could Look Like | WSJ","url":"https://www.youtube.com/watch?v=uakm3Z2D9yQ","date":1732719665,"author":"The Wall Street Journal","unread":true,"desc":"","content":"President-elect Donald Trump has vowed to dismantle the Department of Education and reverse Biden-era policies on transgender students and racial disparities. Trump has also signaled support for religions in schools, including prayer in the classroom. But why do Trump and other Republicans want to abolish the Department of Education and what would that look like?  \n\nOklahoma schools superintendent Ryan Walters and former U.S. Education Secretary Arne Duncan weigh in on Trump’s education plan. \n\nChapters:\n0:00 Trump wants to close Department of Education\n0:49 The Department of Education, explained\n2:30 Dismantling the department \n4:18 Title IX protections\n5:14 Religion in schools\n6:35 What’s next?\n\nNews Explainers\nSome days the high-speed news cycle can bring more questions than answers. WSJ’s news explainers break down the day's biggest stories into bite-size pieces to help you make sense of the news.\n\n#Trump #Education #WSJ","flags":null,"enclosureUrl":"https://www.youtube.com/v/uakm3Z2D9yQ?version=3","enclosureMime":""},{"title":"Inside Japan’s $80B Fukushima Cleanup as AI Fuels Atomic Energy’s Comeback | WSJ","url":"https://www.youtube.com/watch?v=zb9jB7FAPYo","date":1733151671,"author":"The Wall Street Journal","unread":true,"desc":"","content":"Japan is home to vast nuclear plants made dormant after the Fukushima meltdown. The area around the power plant remains a ghost town almost 14 years after the reactor shut down, showing the dangers of nuclear power gone awry. But power companies are clamoring to restart dormant reactors across Japan, as the AI revolution sends demand for energy soaring. \n\nWSJ’s Peter Landers travelled into the exclusion zone to explore the risks of atomic power and see how Japan is grappling with atomic energy’s dramatic comeback.\n\nChapters:\n0:00 Fukushima meltdown\n0:57 Traveling to Fukushima Nuclear Power Plant\n1:52 Entering the facility\n2:56 Japan’s power grid and AI demands\n4:05 Kashiwazaki-Kariwa Nuclear Power Plant\n5:29 What’s next?\n\nNews Explainers\nSome days the high-speed news cycle can bring more questions than answers. WSJ’s news explainers break down the day's biggest stories into bite-size pieces to help you make sense of the news.\n\n#Japan #Nuclear #WSJ","flags":null,"enclosureUrl":"https://www.youtube.com/v/zb9jB7FAPYo?version=3","enclosureMime":""},{"title":"Why North Korea has Sent Thousands of Trash Balloons Across the DMZ | WSJ","url":"https://www.youtube.com/watch?v=i_ycBmT5J8o","date":1733758843,"author":"The Wall Street Journal","unread":true,"desc":"","content":"North Korea has launched thousands of trash balloons across the DMZ into South Korea. A campaign of psychological warfare has begun on the Korean Peninsula as the demilitarized zone has now become a frontline for a dangerous and bizarre tit for tat. \n\nWSJ’s Timothy Martin travelled up to the world’s most militarized border to see how this fragile border could soon deliver a foreign policy headache for the incoming Trump administration.\n\nChapters:\n0:00 Psychological warfare\n0:43 Anti-NK activist\n3:12 Inside Paju\n4:11 NK weaponry\n4:48 Trump administration\n\nNews Explainers\nSome days the high-speed news cycle can bring more questions than answers. WSJ’s news explainers break down the day's biggest stories into bite-size pieces to help you make sense of the news.\n\n#NorthKorea #SouthKorea #WSJ","flags":null,"enclosureUrl":"https://www.youtube.com/v/i_ycBmT5J8o?version=3","enclosureMime":""},{"title":"Acoustic Engineer Fixes NYC Subway, Parks and Buildings to Limit Noise | WSJ Pro Perfected","url":"https://www.youtube.com/watch?v=5oXiOFR5Xyo","date":1733842812,"author":"The Wall Street Journal","unread":true,"desc":"","content":"From trains and traffic to concerts and sporting events, many cities around the world are dangerously loud. Noise pollution can have a huge impact on health and quality of life - causing stress and increasing risk for heart disease and other issues. So what are some of the tools that engineers have to limit loud noise?\n\nRaj Patel, an acoustics expert who helped design Manhattan’s Little Island waterfront park, explains how noise pollution can be minimized in metropolises like New York City.\n\nChapters:\n0:00 Noise pollution in cities\n0:52 Street noise and parks\n2:57 Subways\n5:15 Building insulation\nConcert venue\n\nPro Perfected\nExperts in engineering and design break down a ubiquitous problem, examining how the world is built and what can make it better.\n\n#Noise #NewYork #WSJ","flags":null,"enclosureUrl":"https://www.youtube.com/v/5oXiOFR5Xyo?version=3","enclosureMime":""},{"title":"Syria’s Assad Regime Has Fallen: What’s Next for the Middle East? | WSJ","url":"https://www.youtube.com/watch?v=3HSZDjnChAw","date":1733885451,"author":"The Wall Street Journal","unread":true,"desc":"","content":"It took just over a week for the 54-year Assad regime to fall in Syria. Now, President Bashar al-Assad has fled to Russia, and the Hayat Tahrir al-Sham are in control of Damascus. Why did Assad have Russian and Iranian support? Who were the rebel forces fighting in Syria to overthrow Assad’s regime? \n\nWSJ breaks down how it happened – and what might come next with a group the U.S. designates as a terrorist organization now in charge. \n\nChapters:\n0:00 Syria falls\n0:38 Why Assad had Russian and Iranian support\n2:08 Who are the rebels in Syria\n3:45 How the coup unfolded\n5:38 What’s next?\n\nNews Explainers\nSome days the high-speed news cycle can bring more questions than answers. WSJ’s news explainers break down the day's biggest stories into bite-size pieces to help you make sense of the news.\n\n#Syria #Assad #WSJ","flags":null,"enclosureUrl":"https://www.youtube.com/v/3HSZDjnChAw?version=3","enclosureMime":""},{"title":"Why Liquid Death’s Branding Sells—Even Though Its Water Isn’t Special | WSJ The Economics Of","url":"https://www.youtube.com/watch?v=UfpBPk8HiaY","date":1734015637,"author":"The Wall Street Journal","unread":true,"desc":"","content":"Liquid Death, a brand that markets water in beer cans, has achieved a $1.4 billion valuation in 2024. With over 10 million social media followers, it ranks as one of the most followed beverage brands worldwide, trailing Red Bull and Monster. Despite its rapid rise, Liquid Death has managed to build its identity without ever mentioning typical water features like electrolytes, source location or pH balance—something that luxury water brands like Evian, Smartwater and Fiji emphasize.\n\nWSJ breaks down how the water company’s success underscores a shift in consumer behavior, where branding and culture often speak louder than product substance.\n\nChapters:\n0:00 Liquid Death’s marketing\n0:42 Competing with luxury brands\n2:25 Distributions and partnerships\n4:09 Additional products and expansion\n\nThe Economics Of\nHow do the world's most successful companies generate revenue? In this explainer series, we'll dive into the surprising stories behind how businesses work--exploring everything from Costco's \"treasure-hunt\" model to the economics behind Amazon's AWS.\n\n#LiquidDeath #Water #WSJ","flags":null,"enclosureUrl":"https://www.youtube.com/v/UfpBPk8HiaY?version=3","enclosureMime":""},{"title":"The Hidden Autopilot Data That Reveals Why Teslas Crash | WSJ","url":"https://www.youtube.com/watch?v=mPUGh0qAqWA","date":1734119777,"author":"The Wall Street Journal","unread":true,"desc":"","content":"Video and data gathered by the Wall Street Journal from over 200 Tesla Autopilot crashes shows that longstanding concerns about Tesla’s camera-based technology, which differs from the rest of the industry, are showing up on the roads and putting the public at risk.\n\nChapters:\n0:00 Tesla autopilot crashes\n2:00 The Journal’s investigation\n3:32 Why this is happening: Tesla’s camera-based system\n7:36 Obtaining Tesla video and data\n8:49 How humans interact with Tesla’s systems\n9:56 What’s next?\n\nVideo Investigations\nWSJ video investigations use visual evidence to reveal the truth behind the most important stories of the day.\n\n#Tesla #Autopilot #WSJ","flags":null,"enclosureUrl":"https://www.youtube.com/v/mPUGh0qAqWA?version=3","enclosureMime":""},{"title":"What Are These Drones Doing Over New Jersey? A Closer Look at the Mystery | WSJ","url":"https://www.youtube.com/watch?v=HxX56MmFd10","date":1734127462,"author":"The Wall Street Journal","unread":true,"desc":"","content":"Unidentified aircraft flying only hundreds of feet from the ground have appeared in the skies over New Jersey in recent weeks. Experts who have seen the reported “drone” footage of these aircrafts categorize it into two buckets: quadcopter and fixed-winged aircraft. \n\nThe unidentified aircrafts have flown over WSJ tech columnist’s Joanna Stern’s neighborhood. She takes a closer look from the ground in the Garden State.\n\nChapters:\n0:00 Unidentified aircrafts above NJ\n1:00 The findings\n3:23 What’s next?\n\nTech Things With Joanna Stern\nEverything is now a tech thing. In creative and humorous videos, WSJ senior personal tech columnist Joanna Stern explains and reviews the products, services and trends that are changing our world.\n\n#Drones #NewJersey #WSJ","flags":null,"enclosureUrl":"https://www.youtube.com/v/HxX56MmFd10?version=3","enclosureMime":""},{"title":"The Issues with Health Insurance Companies, Explained by Doctors | WSJ","url":"https://www.youtube.com/watch?v=0zV9qk5rIaM","date":1734134872,"author":"The Wall Street Journal","unread":true,"desc":"","content":"After the shooting of UnitedHealthcare CEO Brian Thompson in New York City, physicians offer a sober look at frustrations with the healthcare system in the U.S.\n\nWSJ’s Anna Wilde Mathews walks through the findings of a Journal investigation exposing how private insurance companies collected billions in payments through Medicare Advantage programs.\n\nChapters:\n0:00 Anger towards health insurance companies \n0:43 Denials of care and pre-authorizations\n1:49 How doctors and patients are affected\n2:48 Medicare Advantage, explained\n4:15 Insurance-driven diagnoses \n5:11 How insurance companies see themselves\n\n#UnitedHealth #Healthcare #WSJ","flags":null,"enclosureUrl":"https://www.youtube.com/v/0zV9qk5rIaM?version=3","enclosureMime":""}]}