{
  "id": "B69zEhWZA8UEAMn3PhHgwARc5WGncWEYFkmfHhvUDpmmwCTb86SBbpJu5kTKr3v5o6YroQ4JppdVoDHLN4yWZAVi5Siw4M8AuwbDYBxU",
  "title": "The Wall Street Journal",
  "displayTitle": "News - Wall Street Journal",
  "url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCK7tptUDHh-RYDsdxO1-5QQ",
  "feedLink": "https://www.youtube.com/channel/UCK7tptUDHh-RYDsdxO1-5QQ",
  "items": [
    {
      "title": "Why Captchas Keep Getting More Complicated | WSJ Tech Behind",
      "url": "https://www.youtube.com/watch?v=9k-uPSEGl-c",
      "date": 1731423614,
      "author": "The Wall Street Journal",
      "unread": true,
      "desc": "",
      "content": "Captchas, the online tests designed to tell if you’re robot or human, have been getting harder. What began as a simple text to prove you’re not a robot has rapidly evolved into a battle between humans and AI as more and more data has made these systems better at solving tasks.\n\nWSJ explores the latest online methods to prove that we’re not a robot, and explains why AI algorithms may always eventually get the upper hand.\n\nChapters:\n0:00 Captchas are getting harder\n0:40 Origins of Captcha\n1:51 Early Captchas\n3:02 Visual Captcha\n4:34 Nocaptcha \n5:29 Future Captchas\n\n'The Tech Behind' explores the amazing engineering, computing, science and algorithms that power our favorite tech.\n\n#AI #Tech #WSJ",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/9k-uPSEGl-c?version=3",
      "enclosureMime": ""
    },
    {
      "title": "I Spent 24 Hours in the Woods With Talking AI Chatbots | WSJ",
      "url": "https://www.youtube.com/watch?v=hUyj3d-BSh8",
      "date": 1731510048,
      "author": "The Wall Street Journal",
      "unread": true,
      "desc": "",
      "content": "Meta AI, Google Gemini, OpenAI ChatGPT and Microsoft Copilot now have eerily human voices. WSJ’s Joanna Stern strapped the AI bots to a tripod and took them to a cabin in the woods to test their skills as helpers—and as friends.\n\nChapters:\n0:00 Human-sounding AI \n1:10 The voice setup\n2:02 Testing bots as helpers \n4:01 Testing bots as friends\n6:16 Takeaways\n\nTech Things With Joanna Stern\nEverything is now a tech thing. In creative and humorous videos, WSJ senior personal tech columnist Joanna Stern explains and reviews the products, services and trends that are changing our world.\n\n#AI #Chatbot #WSJ",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/hUyj3d-BSh8?version=3",
      "enclosureMime": ""
    },
    {
      "title": "What Does It Take to Perfect the Commuter Train?",
      "url": "https://www.youtube.com/watch?v=byYHNh_snlA",
      "date": 1731524422,
      "author": "The Wall Street Journal",
      "unread": true,
      "desc": "",
      "content": "Commuter trains are renowned for potentially being cramped and crowded, but they don’t have to be that way. Tiny adjustments to a commuter train’s design – from the width of the doors to the position of the handholds – can have huge impacts on the speed that passengers can get on and off, and can make or break the economics of a train service. WSJ sits down with train manufacturer Alstom to discover what a perfected commuter train could look like.\n\n#Train #Subway #Shorts",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/byYHNh_snlA?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Why Airlines Can’t Survive Without Loyalty Programs | WSJ Case Study",
      "url": "https://www.youtube.com/watch?v=mTTW8RDJUEE",
      "date": 1731596611,
      "author": "The Wall Street Journal",
      "unread": true,
      "desc": "",
      "content": "American Airlines created the first major airline loyalty program in 1981 as a way to compete for customers post-deregulation. But today these programs are the industry norm, having transformed into billions of dollar businesses with legs outside the aviation industry. The AAdvantage loyalty program has even become a business in its own right with airlines selling miles to banks, and was followed by similar programs with United, Delta, Southwest and more. \n\nWSJ breaks down how American Airlines created the program that changed the way the world flies.\n\nChapters:\n0:00 Shift in air travel\n1:07 History of airline loyalty programs\n3:30 The industry\n4:37 Airline miles and banks\n6:57 Loyalty program competition\n\nWatch exclusive interviews with the creator of the first airline loyalty program and American Airlines VP of Revenue here: https://on.wsj.com/48Lej3z \n\n#Airlines #Travel #WSJ",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/mTTW8RDJUEE?version=3",
      "enclosureMime": ""
    },
    {
      "title": "SpaceX Caught a Rocket With ‘Chopsticks.’ What Will Musk Try Next? | WSJ",
      "url": "https://www.youtube.com/watch?v=dQ4UHTf4p74",
      "date": 1731683309,
      "author": "The Wall Street Journal",
      "unread": true,
      "desc": "",
      "content": "The next test flight for SpaceX’s massive Starship rocket is scheduled for Nov. 18. CEO Elon Musk wants Starship to revolutionize spaceflight and on Oct. 13, SpaceX made history in aerospace engineering when Starship’s booster was caught by two mechanical arms as it descended to the launch pad.\n\nFrom China and Russia, to NASA and Boeing, none of SpaceX’s competitors have been able to reuse rockets like SpaceX does. So what are SpaceX’s goals on its next test flight?\n\nWSJ explains the significance of Starships development and previews what to expect in its next mission.\n\nChapters:\n0:00 Catching the rocket on landing\n0:55 Review of Starship’s fifth test flight\n3:33 SpaceX’s competitors\n6:05 What to expect from Starships’s sixth test flight\n\nNews Explainers\nSome days the high-speed news cycle can bring more questions than answers. WSJ’s news explainers break down the day's biggest stories into bite-size pieces to help you make sense of the news.\n\n#SpaceX #Starship #WSJ",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/dQ4UHTf4p74?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Red Lobster CEO's Plan to Save the Restaurant From Bankruptcy | WSJ",
      "url": "https://www.youtube.com/watch?v=e2-EJGquBAw",
      "date": 1731942080,
      "author": "The Wall Street Journal",
      "unread": true,
      "desc": "",
      "content": "Red Lobster exited bankruptcy in September after decades of declining sales and a disastrous all-you-can-eat shrimp promotion. Now, they’ve hired 35-year-old Damola Adamolekun as its new CEO to see the brand through bankruptcy and out the other side. Adamolekun revitalized P.F. Chang’s during Covid and hopes to do the same for America’s oldest seafood chain.\n\nWSJ’s Heather Haddon spoke to the new, millennial CEO in Orlando to learn his plans to bring the casual dining restaurant back to its former glory.\n\nChapters:\n0:00 Red Lobster’s new CEO\n0:41 Immediate fixes\n3:37 Challenges ahead\n6:22 Goals for the next few years\n\nWatch the full, wide-ranging interview here: https://on.wsj.com/4eOzJhI \n\n#RedLobster #Food #WSJ",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/e2-EJGquBAw?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Inside the Race to Save a Museum Home to Some of Humanity's Oldest Bones | WSJ",
      "url": "https://www.youtube.com/watch?v=dx9j9m8nz5s",
      "date": 1732029302,
      "author": "The Wall Street Journal",
      "unread": true,
      "desc": "",
      "content": "The Nairobi National Museum in Kenya is home to million-year-old fossils, an unparalleled collection of insects, tens of thousands of bones and a fossilized skeleton crucial to our understanding of humanity. Despite its significance, the museum’s roughly 10 millions specimens are at risk as years of limited resources, mismanagement and corruption have left it in a state of dilapidation and decay. \n\nWSJ visits the museum and investigates how an international coalition of scientists is racing to save the museum and secure the millions needed to overhaul it in order to restore the institution and its vast collection to a state more befitting its immense importance to humanity. \n\nChapters:\n0:00 The Nairobi National Museum \n1:24 Hominid Vault and Turkana Boy\n2:46 Paleontology backroom: issues with the museum \n5:25 The Leakey family\n7:05 Kenya’s Lake Turkana region\n9:35 The rest of the museum \n12:03 Plans to reform the museum \n\n#History #Kenya #WSJ",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/dx9j9m8nz5s?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Ukraine’s First-Ever ATACMS Strike in Russia, Explained | WSJ",
      "url": "https://www.youtube.com/watch?v=teeYFzdsQYU",
      "date": 1732039152,
      "author": "The Wall Street Journal",
      "unread": true,
      "desc": "",
      "content": "Ukraine fired long-range U.S. missiles inside Russia for the first time despite Moscow’s threats of retaliation. The attack hit an ammunition storage facility near the Russian city of Karachev and is the first such assault to use long-range, NATO-made arms. \n\nWSJ’s Alistair MacDonald explains why the Kremlin sees this as a major escalation.\n\nChapters:\n0:00 Ukraine fired long-range missiles into Russia\n0:45 ATACMS and Storm Shadow\n2:28 New targets and logistics\n3:57 What’s next?\n\nRussia-Ukraine Conflict\nWSJ’s latest news coverage around the 2022-2024 Russia-Ukraine conflict.\n\n#Ukraine #Russia #WSJ",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/teeYFzdsQYU?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Why So Many TGI Friday Restaurants Are Closing | WSJ What Went Wrong",
      "url": "https://www.youtube.com/watch?v=z9PgTO9MxYY",
      "date": 1732114870,
      "author": "The Wall Street Journal",
      "unread": true,
      "desc": "",
      "content": "TGI Fridays, widely considered the first singles bar in the U.S., filed for Chapter 11 bankruptcy in November, citing a problematic capital structure and fallout from the pandemic. The fast-casual restaurant chain has closed over 200 locations across the U.S. since 2019 and have even been kicked out of its headquarters in Dallas.\n\nWSJ breaks down how the once happy hour hot spot lost its flair.\n\nChapters:\n0:00 TGI Fridays filed for bankruptcy\n0:35 The rise \n2:01 Turning point\n4:24 The downfall\n5:33 What’s next for franchisees?\n\nWhat Went Wrong explores the challenging conditions and decisions that led to a company's downturn.\n\n#TGIFridays #Food #WSJ",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/z9PgTO9MxYY?version=3",
      "enclosureMime": ""
    },
    {
      "title": "How Airline Frequent Flier Programs Have Evolved",
      "url": "https://www.youtube.com/watch?v=R7ojXlE2SMo",
      "date": 1732204831,
      "author": "The Wall Street Journal",
      "unread": true,
      "desc": "",
      "content": "American Airlines created the first major airline loyalty program in 1981 as a way to compete for customers post-deregulation. But today these programs are the industry norm, having transformed into billions of dollar businesses with legs outside the aviation industry. The AAdvantage loyalty program has even become a business in its own right with airlines selling miles to banks, and was followed by similar programs with United, Delta, Southwest, and more. \n\nWSJ breaks down how American Airlines created the program that changed the way the world flies.\n\n#Airlines #Travel #Shorts",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/R7ojXlE2SMo?version=3",
      "enclosureMime": ""
    },
    {
      "title": "What Trump Can and Can’t Do on Day One | WSJ",
      "url": "https://www.youtube.com/watch?v=7GsvtOKswvY",
      "date": 1732293625,
      "author": "The Wall Street Journal",
      "unread": true,
      "desc": "",
      "content": "President-elect Donald Trump has a long list of policy objectives that he wants to implement quickly including border policy for immigration, closing the Department of Education, implementing tariffs and more. For most of Trump’s objectives for his second term, there are limitations including checks and balances within the process or limitations directly from Congress.\n\nWSJ explains which of these plans he can carry out on his own, which he’ll need help from Congress for, and what might end up in the courts.  \n\nChapters:\n0:00 Trump’s second term\n0:38 Immigration\n2:23 Military\n3:06 Education\n4:34 Energy\n5:32 Tariffs\n6:48 Checks and balances\n\nNews Explainers\nSome days the high-speed news cycle can bring more questions than answers. WSJ’s news explainers break down the day's biggest stories into bite-size pieces to help you make sense of the news.\n\n#Trump #Politics #WSJ",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/7GsvtOKswvY?version=3",
      "enclosureMime": ""
    },
    {
      "title": "How Much Control Will Trump Actually Have Over Inflation? | WSJ",
      "url": "https://www.youtube.com/watch?v=CJgQUqlNejk",
      "date": 1732546811,
      "author": "The Wall Street Journal",
      "unread": true,
      "desc": "",
      "content": "President-elect Donald Trump vowed on the campaign trail to lower inflation. About half of Trump voters said higher prices were the largest factor in their decision, according to AP VoteCast. But the Federal Reserve is independent and uses interest rates to encourage or discourage borrowing money, which leads to more or less spending. So how much control does the president actually have over inflation?\n\nWSJ asked a former Federal Reserve vice chair to break down the inflation-fighting tools Trump will have at his disposal.\n\nChapters:\n0:00 Trump wants to lower inflation\n0:31 What can affect inflation\n2:35 What a president can do about inflation\n3:25 Where Trump stands \n\nNews Explainers\nSome days the high-speed news cycle can bring more questions than answers. WSJ’s news explainers break down the day's biggest stories into bite-size pieces to help you make sense of the news.\n\n#Trump #Inflation #WSJ",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/CJgQUqlNejk?version=3",
      "enclosureMime": ""
    },
    {
      "title": "How India’s New Nuclear Submarine Base Challenges China’s Naval Plans | WSJ",
      "url": "https://www.youtube.com/watch?v=LS9MXoaE5cs",
      "date": 1732633220,
      "author": "The Wall Street Journal",
      "unread": true,
      "desc": "",
      "content": "Modi's India is building a new base for nuclear-armed submarines in the Bay of Bengal called INS Varsha in a bid to curb China’s naval footprint growing in India’s backyard. The Bay of Bengal is a critical shipping lane and some China experts believe the waterway could play a key role in any conflict over Taiwan or the South China Sea. \n\nWSJ examined satellite images to see how INS Varsha has expanded and explores how this project is forming the backbone of New Delhi’s plans to keep Beijing’s ambitions in the region in check. \n\nChapters:\n0:00 India’s new military base\n0:31 Bay of Bengal\n1:21 China’s presence in the bay\n2:44 INS Varsha \n3:46 India’s nuclear submarines\n\nNews Explainers\nSome days the high-speed news cycle can bring more questions than answers. WSJ’s news explainers break down the day's biggest stories into bite-size pieces to help you make sense of the news.\n\n#India #China #WSJ",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/LS9MXoaE5cs?version=3",
      "enclosureMime": ""
    },
    {
      "title": "What Trump’s Dismantling of the Education Department Could Look Like | WSJ",
      "url": "https://www.youtube.com/watch?v=uakm3Z2D9yQ",
      "date": 1732719665,
      "author": "The Wall Street Journal",
      "unread": true,
      "desc": "",
      "content": "President-elect Donald Trump has vowed to dismantle the Department of Education and reverse Biden-era policies on transgender students and racial disparities. Trump has also signaled support for religions in schools, including prayer in the classroom. But why do Trump and other Republicans want to abolish the Department of Education and what would that look like?  \n\nOklahoma schools superintendent Ryan Walters and former U.S. Education Secretary Arne Duncan weigh in on Trump’s education plan. \n\nChapters:\n0:00 Trump wants to close Department of Education\n0:49 The Department of Education, explained\n2:30 Dismantling the department \n4:18 Title IX protections\n5:14 Religion in schools\n6:35 What’s next?\n\nNews Explainers\nSome days the high-speed news cycle can bring more questions than answers. WSJ’s news explainers break down the day's biggest stories into bite-size pieces to help you make sense of the news.\n\n#Trump #Education #WSJ",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/uakm3Z2D9yQ?version=3",
      "enclosureMime": ""
    },
    {
      "title": "Inside Japan’s $80B Fukushima Cleanup as AI Fuels Atomic Energy’s Comeback | WSJ",
      "url": "https://www.youtube.com/watch?v=zb9jB7FAPYo",
      "date": 1733151671,
      "author": "The Wall Street Journal",
      "unread": true,
      "desc": "",
      "content": "Japan is home to vast nuclear plants made dormant after the Fukushima meltdown. The area around the power plant remains a ghost town almost 14 years after the reactor shut down, showing the dangers of nuclear power gone awry. But power companies are clamoring to restart dormant reactors across Japan, as the AI revolution sends demand for energy soaring. \n\nWSJ’s Peter Landers travelled into the exclusion zone to explore the risks of atomic power and see how Japan is grappling with atomic energy’s dramatic comeback.\n\nChapters:\n0:00 Fukushima meltdown\n0:57 Traveling to Fukushima Nuclear Power Plant\n1:52 Entering the facility\n2:56 Japan’s power grid and AI demands\n4:05 Kashiwazaki-Kariwa Nuclear Power Plant\n5:29 What’s next?\n\nNews Explainers\nSome days the high-speed news cycle can bring more questions than answers. WSJ’s news explainers break down the day's biggest stories into bite-size pieces to help you make sense of the news.\n\n#Japan #Nuclear #WSJ",
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/zb9jB7FAPYo?version=3",
      "enclosureMime": ""
    }
  ]
}