{"id":"B69zEhWZA8UEAMn3PhHgwARc5WGncWEYFkmfHhvUDpmmwCTb86SBbpJu5kTKr3v5o6YroQ4JppnTPmKLxpU2tRhdtRTKSt57YWBdJkQg","title":"Closer To Truth","displayTitle":"Podcast - Closer to Truth","url":"https://www.youtube.com/feeds/videos.xml?channel_id=UCl9StMQ79LtEvlrskzjoYbQ","feedLink":"https://www.youtube.com/channel/UCl9StMQ79LtEvlrskzjoYbQ","items":[{"title":"Michael Almeida - Is This the Best of All Possible Worlds?","url":"https://www.youtube.com/watch?v=jXDrHcGd_Jc","date":1732982438,"author":"Closer To Truth","unread":true,"desc":"","content":"Like us on Facebook for daily videos, announcements, and more: https://www.facebook.com/CloserToTruthTV\n\nIs this a joke? Our world, with its vast evils, the ‘best possible world’? It seems absurd. Yet some do claim that ultimately our world will be the best possible world, because the sum total of all the good, primarily generated by human free will and divine providence, will overpower all the obvious evils. Perhaps the calculus should include the entire cosmos?\n\nDo you have a Closer to Truth membership? Register for a free account to receive special exclusives today: https://closertotruth.com/.\n\nMike Almeida is Professor of Philosophy and chair of the Department of Philosophy and Classics at the University of Texas at San Antonio.\n\nSupport the show with a donation of any amount to help Closer To Truth continue exploring life's deepest questions: shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/jXDrHcGd_Jc?version=3","enclosureMime":""},{"title":"Richard Dawkins - Evolution, Inheritance, and Biology","url":"https://www.youtube.com/watch?v=g_Vz2qR4b40","date":1733068836,"author":"Closer To Truth","unread":true,"desc":"","content":"Giving Tuesday is this week! Make a donation of any amount to help support Closer To Truth: https://shorturl.at/OnyRq\n\nWhat is the extended evolutionary synthesis (EES) and why better? Includes multilevel selection, transgenerational epigenetic inheritance, niche construction, evolvability, and ideas from evolutionary developmental biology. Why is EES controversial?\n\nGet exclusive member benefits—like early access to new episodes—with a free Closer To Truth account: https://closertotruth.com/register.\n\nMake a donation to Closer To Truth to help us continue exploring the world's deepest questions without the need for paywalls: https://shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/g_Vz2qR4b40?version=3","enclosureMime":""},{"title":"Is Life After Death Possible?","url":"https://www.youtube.com/watch?v=NJHXxpC9zfg","date":1733148024,"author":"Closer To Truth","unread":true,"desc":"","content":"Does everything about a person disappear at death? The body? Sure, it's gone. The brain? It stops working, then dissolves. But what about awareness? Does our consciousness end forever? Nothing could be more frightening! Is there any hope? Are there ways that, conceivably, our consciousness can survive the ultimate insult?\n\nWatch our full interview with Sam Parnia here: https://t.ly/DZlGS #shorts","flags":null,"enclosureUrl":"https://www.youtube.com/v/NJHXxpC9zfg?version=3","enclosureMime":""},{"title":"Nancey Murphy - What Gives Us Personal Identity?","url":"https://www.youtube.com/watch?v=BE-FAt7lB7U","date":1733155211,"author":"Closer To Truth","unread":true,"desc":"","content":"Get 20% off your Closer To Truth merch purchase with code THANKSCTT at checkout: https://bit.ly/3P2ogje\n\nWhat makes one a person or a self? If he or she sees, hears, thinks and feels, is that a person or a self? How can separate perceptions bind together into a coherent mental unity of a single person or self? And how does personhood or self persist through time? If persons are all material, what enables the continuity? Is there a ‘carrier’ of personal identity?\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nMake a donation of any amount to help support Closer To Truth: https://shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/BE-FAt7lB7U?version=3","enclosureMime":""},{"title":"Your Gift Means the World","url":"https://www.youtube.com/watch?v=QFLmJqn5tlY","date":1733241630,"author":"Closer To Truth","unread":true,"desc":"","content":"For over 20 years, Closer To Truth has explored humanity’s deepest questions in the fields of cosmos, life, mind, and meaning. \n\nBut there’s a new question we need to explore: What comes next? \n\nCloser to Truth has just launched our first-ever donation platform. Every tax-deductible donation—big or small—helps us share fresh, transformative perspectives on questions that have shaped human thought for millennia.\n\nWe want to continue breaking new ground and conducting interviews with top thinkers and scientists who do the same.\n\nGive what you can today: https://shorturl.at/nzbqn\n\nThank you.","flags":null,"enclosureUrl":"https://www.youtube.com/v/QFLmJqn5tlY?version=3","enclosureMime":""},{"title":"E. Thomas Lawson - Art and Cognitive Science","url":"https://www.youtube.com/watch?v=bhVToAW1zFw","date":1733241636,"author":"Closer To Truth","unread":true,"desc":"","content":"Today is #givingtuesday — support Closer To Truth with a tax-deductible donation of any amount: https://shorturl.at/OnyRq\n\nAesthetic Cognitivism is a theory about the arts as sources of understanding. What are the scholarly or scientific fields that form its foundation? Explore art’s relationship with cognitive science, philosophy, neuroscience, history, theology and religion.\n\nAre you a Closer To Truth member? Register for a free account to get special exclusives and discounts at https://closertotruth.com/.\n\nErnest Thomas Lawson is an honorary professor at the Institute of Cognition and Culture at Queen’s University Belfast. He is the executive editor of the Journal of Cognition and Culture and co-founder of the North American Association for the Study of Religion. He is a founding member and has served as the first President of the International Association for the Cognitive Science of Religion.\n\nFollow Closer To Truth on X for articles, videos, updates, and more: https://x.com/CloserToTruth\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/bhVToAW1zFw?version=3","enclosureMime":""},{"title":"Support Closer to Truth This Giving Tuesday","url":"https://www.youtube.com/watch?v=kQZCW9PLTAs","date":1733242881,"author":"Closer To Truth","unread":true,"desc":"","content":"Today, on Giving Tuesday, you have the power to shape the future of knowledge. \n\nOur mission at Closer to Truth has remained the same: to bring the world’s greatest minds together to explore the biggest questions about existence, consciousness, reality, and more.\n\nBut we need your help to reach even more people with these critical conversations.\n\nMake a tax deductible donation to help us expand our global reach, produce fresh, new content, and explore uncharted questions\n\nTogether we can explore the mysteries of life and our universe. Be a part of something bigger. \n\n#givingtuesday #givingtuesday2024 #mightycause #philosophical #philosopher #physicist #bigquestions #ultimatequestions #thinkingbig #outerspace #cosmos #existence","flags":null,"enclosureUrl":"https://www.youtube.com/v/kQZCW9PLTAs?version=3","enclosureMime":""},{"title":"Andrew Pinsent - The Big Bang and the Structure of Reality","url":"https://www.youtube.com/watch?v=SgwxxGoPH4c","date":1733331629,"author":"Closer To Truth","unread":true,"desc":"","content":"Donate to Closer To Truth this holiday season and help us keep our content free and without paywalls: https://shorturl.at/OnyRq\n\nHow do physicists and philosophers who believe in God harmonize the discoveries of cosmology with the doctrine of creation? How does cosmology enhance or erode their belief in God? If God exists, must the universe have had a beginning? Conversely, if the universe had a beginning, must God exist?\n\nFollow Closer To Truth on Instagram for news, announcements, and exciting updates: https://shorturl.at/p2IhM\n\nFr. Andrew Pinsent is professor of theology and philosophy at the Athenaeum of Ohio in Cincinnati, Ohio, and a Catholic priest of the Diocese of Arundel and Brighton in England. \n\nGet member exclusives like early access to new content with a free Closer To Truth account: https://closertotruth.com/\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/SgwxxGoPH4c?version=3","enclosureMime":""},{"title":"Paul Griffiths - Why Philosophy of Biology?","url":"https://www.youtube.com/watch?v=AiU62nzdb58","date":1733414407,"author":"Closer To Truth","unread":true,"desc":"","content":"Subscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nExplore the process of science with the content of biology. Life’s nature and structure. Evolution’s challenges. Examine race, sex and gender, cognition, culture, morality, religion, alien life, and more.\n\nMake a donation to Closer To Truth to help us continue exploring the world's deepest questions without the need for paywalls: https://shorturl.at/OnyRq\n\nPaul Griffiths is Professor of Philosophy at the University of Sydney and works primarily in the Philosophy of Science and more particularly Philosophy of Biology.\n\nShow your support for the show (and snag a great holiday gift) with a Closer To Truth merch purchase: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/AiU62nzdb58?version=3","enclosureMime":""},{"title":"Subhash Kak - Alternative Concepts of God?","url":"https://www.youtube.com/watch?v=pZRhUNronDE","date":1733500844,"author":"Closer To Truth","unread":true,"desc":"","content":"Are you a Closer to Truth member? Register for a free account to receive special exclusives today: https://closertotruth.com/.\n\nIs God, if there is a God, a personal, conscious, all-powerful Supreme Being? Some offer radically different concepts of ‘God’, exploring novel ideas of what God may be like. They challenge theism—the God of Judaism, Christianity and Islam—with radically new kinds of gods. Is this ‘heresy’? Or enlarging our vision of what the Ultimate can be like?\n\nSupport the show with a donation of any amount to help Closer To Truth continue exploring life's deepest questions: shorturl.at/OnyRq\n\nSubhash Kak is an Indian-American computer scientist and historical revisionist. He is the Regents Professor of Computer Science Department at Oklahoma State University–Stillwater, an honorary visiting professor of engineering at Jawaharlal Nehru University, and a member of the Indian Prime Minister's Science, Technology and Innovation Advisory Council (PM-STIAC).\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/pZRhUNronDE?version=3","enclosureMime":""},{"title":"Neil Theise - Should Science Even Talk to Religion?","url":"https://www.youtube.com/watch?v=s1p1QGUCpRo","date":1733515233,"author":"Closer To Truth","unread":true,"desc":"","content":"Like us on Facebook for daily videos, announcements, and more: https://shorturl.at/JkgVs\n\nTo do good science, science need not speak with religion. Many scientists, even believers in God, state that science can comfortably ignore religion. A minority claim that the revelations of religion can help adjudicate knotty problems in science, such as the nature of time. But does any reality really exist beyond the expanding reach of science?\n\nDo you have a Closer to Truth membership? Register for a free account to receive special exclusives today: https://closertotruth.com/.\n\nNeil Theise is a professor of pathology at the NYU Grossman School of Medicine. Through his scientific research, he has been a pioneer of adult stem cell plasticity and the anatomy of the human interstitium. He is also a longtime student of Zen Buddhism. Dr. Theise's studies in complexity theory have led to interdisciplinary collaborations in fields such as integrative medicine, consciousness studies, and the science-religion dialogue.\n\nSupport the show with a donation of any amount to help Closer To Truth continue exploring life's deepest questions: shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/s1p1QGUCpRo?version=3","enclosureMime":""},{"title":"Ian McFarland - What is Human Mind?","url":"https://www.youtube.com/watch?v=uPlTC8yOGKM","date":1733587251,"author":"Closer To Truth","unread":true,"desc":"","content":"Get special exclusives and discounts with a free Closer To Truth membership today: https://closertotruth.com/.\n\nThe nature of human mind and consciousness is one of the perennial, deep questions in philosophy. Assuming that God exists, what happens to the question? In a God-created world, what would human mind be?\n\nSupport Closer To Truth with a tax-deductible donation of any amount: https://shorturl.at/OnyRq\n\nIan Alexander McFarland is an American Lutheran theologian and has since 2019 served as Robert W. Woodruff Professor of Theology at Emory University's Candler School of Theology, where he also taught from 2005 to 2015. From 2015 to 2019 he was the Regius Professor of Divinity at the University of Cambridge. He holds degrees from Trinity College (Hartford), Union Theological Seminary (New York), the Lutheran School of Theology at Chicago, the University of Cambridge, and Yale University.\n\nFollow us on X for announcements, news, updates, and more: https://x.com/CloserToTruth\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/uPlTC8yOGKM?version=3","enclosureMime":""},{"title":"Tom McLeish - Critical Realism in Science and Theology","url":"https://www.youtube.com/watch?v=cqbM726QwbA","date":1733673628,"author":"Closer To Truth","unread":true,"desc":"","content":"Shop our merch and get a unique holiday gift for everyone on your list: https://bit.ly/3P2ogje\n\nDoes what we discover in science reflect what really exists in the world? Can science access external, independent, ultimate reality? “Realists” say Yes; “anti-realists”, No. Can we discern the ultimate reach of human knowledge? Clearly in science, but also, potentially, in theology. That’s what “critical realism” attempts to do.\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nTom McLeish was Emeritus Professor of Natural Philosophy at the University of York. Elected Fellow of the Royal Society in 2011, he chaired its Education Committee. He was also a Senior Associate of Pembroke College, Oxford, and a former fellow of Emmanuel College Cambridge.\n\nMake a donation of any amount to help support Closer To Truth: https://shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/cqbM726QwbA?version=3","enclosureMime":""},{"title":"Aging: Body and Mind","url":"https://www.youtube.com/watch?v=3upW9K9Zvvg","date":1733749206,"author":"Closer To Truth","unread":true,"desc":"","content":"Biologist Denis Noble discusses aging, preventative healthcare, and self preservation #shorts","flags":null,"enclosureUrl":"https://www.youtube.com/v/3upW9K9Zvvg?version=3","enclosureMime":""},{"title":"Alan Torrance - How Does Atonement Work?","url":"https://www.youtube.com/watch?v=XFlQip9C4NI","date":1733760025,"author":"Closer To Truth","unread":true,"desc":"","content":"Love the show? Make a donation of any amount to help support Closer To Truth: https://shorturl.at/OnyRq\n\nChristians are accustomed to hearing that “Jesus died for our sins”. But what would that mean literally? How would atonement work? What would be happening? Is there a process, a sequence of logical steps? One need not be a Christian to appreciate the philosophical obstacles.\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nAlan Torrance is professor of systematic theology at St. Mary's College of the University of St Andrews. Previously he lectured at King's College London, where he was also Director of the Research Institute in Systematic Theology. During this time he served as Senior Research Fellow at the Erasmus Institute, University of Notre Dame. He previously lectured at Knox Theological Hall and the University of Otago in New Zealand.\n\nShop Closer To Truth merch for unique holiday gifts like notebooks, mugs, and apparel: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/XFlQip9C4NI?version=3","enclosureMime":""}]}